{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output\HW5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}11 Apr 2019, 23:23:29

{com}. do "C:\Users\jiere\AppData\Local\Temp\STD4870_000000.tmp"
{txt}
{com}. clear all
{res}{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. set scrollbufsize 2000000
{txt}({cmd:set scrollbufsize} will take effect the next time you launch Stata)

{com}. cd "C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output"
{res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output
{txt}
{com}. pwd
{res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output
{txt}
{com}. 
. ********
. * HW 2 *
. ********
. * Exercise 1
. set seed 613
{txt}
{com}. set obs 1000 
{txt}{p}
number of observations (_N)  was 0,
now 1,000
{p_end}

{com}. gen X1 = runiform(1,3)
{txt}
{com}. gen X2 = rgamma(3,2)
{txt}
{com}. gen X3 = rbinomial(1,0.3)
{txt}
{com}. gen eps = rnormal(2,1)
{txt}
{com}. gen Y = 0.5 + 1.2*X1 - 0.9*X2 + 0.1*100*eps
{txt}
{com}. egen Y_mean = mean(Y)
{txt}
{com}. gen Y_dum = (Y>Y_mean)
{txt}
{com}. 
. * Exercise 2
. cor Y X1
{txt}(obs=1,000)

             {c |}        Y       X1
{hline 13}{c +}{hline 18}
           Y {c |}{res}   1.0000
          {txt}X1 {c |}{res}   0.0227   1.0000

{txt}
{com}. 
. reg Y X1 X2 X3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,000
{txt}{hline 13}{c +}{hline 34}   F(3, 996)       = {res}    43.08
{txt}       Model {c |} {res} 12634.4282         3  4211.47608   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 97377.2777       996  97.7683511   {txt}R-squared       ={res}    0.1148
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1122
{txt}       Total {c |} {res} 110011.706       999  110.121828   {txt}Root MSE        =   {res} 9.8878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4383503{col 26}{space 2} .5474372{col 37}{space 1}    0.80{col 46}{space 3}0.423{col 54}{space 4}-.6359123{col 67}{space 3} 1.512613
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.010387{col 26}{space 2} .0890912{col 37}{space 1}  -11.34{col 46}{space 3}0.000{col 54}{space 4}-1.185215{col 67}{space 3}-.8355589
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .3731411{col 26}{space 2} .6730355{col 37}{space 1}    0.55{col 46}{space 3}0.579{col 54}{space 4}-.9475893{col 67}{space 3} 1.693871
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.54193{col 26}{space 2} 1.281739{col 37}{space 1}   17.59{col 46}{space 3}0.000{col 54}{space 4} 20.02671{col 67}{space 3} 25.05715
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto X_Y
{txt}
{com}. 
. bootstrap, size(1000) reps(49): reg Y X1 X2 X3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}    114.36
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.1148
{txt}{col 49}Adj R-squared{col 67}= {res}    0.1122
{txt}{col 49}Root MSE{col 67}= {res}    9.8878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4383503{col 26}{space 2} .5869734{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-.7120964{col 67}{space 3} 1.588797
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.010387{col 26}{space 2} .1005793{col 37}{space 1}  -10.05{col 46}{space 3}0.000{col 54}{space 4}-1.207519{col 67}{space 3}-.8132549
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .3731411{col 26}{space 2} .7407251{col 37}{space 1}    0.50{col 46}{space 3}0.614{col 54}{space 4}-1.078653{col 67}{space 3} 1.824936
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.54193{col 26}{space 2} 1.438683{col 37}{space 1}   15.67{col 46}{space 3}0.000{col 54}{space 4} 19.72216{col 67}{space 3} 25.36169
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto boot49
{txt}
{com}. 
. bootstrap, size(1000) reps(499): reg Y X1 X2 X3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}499{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}Replications{col 67}= {res}       499
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}    124.16
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.1148
{txt}{col 49}Adj R-squared{col 67}= {res}    0.1122
{txt}{col 49}Root MSE{col 67}= {res}    9.8878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4383503{col 26}{space 2} .5666617{col 37}{space 1}    0.77{col 46}{space 3}0.439{col 54}{space 4}-.6722862{col 67}{space 3} 1.548987
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.010387{col 26}{space 2} .0915077{col 37}{space 1}  -11.04{col 46}{space 3}0.000{col 54}{space 4}-1.189739{col 67}{space 3}-.8310349
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .3731411{col 26}{space 2} .6286373{col 37}{space 1}    0.59{col 46}{space 3}0.553{col 54}{space 4}-.8589654{col 67}{space 3} 1.605248
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.54193{col 26}{space 2} 1.361051{col 37}{space 1}   16.56{col 46}{space 3}0.000{col 54}{space 4} 19.87432{col 67}{space 3} 25.20954
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto boot499
{txt}
{com}. 
. * Exercise 3
. probit Y_dum X1 X2 X3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-693.14718}  
Iteration 1:{space 3}log likelihood = {res:-653.59547}  
Iteration 2:{space 3}log likelihood = {res:-653.55831}  
Iteration 3:{space 3}log likelihood = {res:-653.55831}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}     79.18
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-653.55831{txt}{col 49}Pseudo R2{col 67}= {res}    0.0571

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0449721{col 26}{space 2} .0712062{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.0945895{col 67}{space 3} .1845336
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1074452{col 26}{space 2} .0128088{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.1325499{col 67}{space 3}-.0823404
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1243928{col 26}{space 2} .0877001{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0474962{col 67}{space 3} .2962818
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .486808{col 26}{space 2} .1690792{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} .1554188{col 67}{space 3} .8181971
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto probit_
{txt}
{com}. 
. margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     1,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(Y_dum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0168296{col 26}{space 2} .0266319{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.0353679{col 67}{space 3} .0690271
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0402084{col 26}{space 2} .0042561{col 37}{space 1}   -9.45{col 46}{space 3}0.000{col 54}{space 4}-.0485503{col 67}{space 3}-.0318666
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0465506{col 26}{space 2} .0327187{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0175768{col 67}{space 3}  .110678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto probit_m
{txt}
{com}. 
. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     1,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(Y_dum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0168296{col 26}{space 2} .0266319{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.0353679{col 67}{space 3} .0690271
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0402084{col 26}{space 2} .0042561{col 37}{space 1}   -9.45{col 46}{space 3}0.000{col 54}{space 4}-.0485503{col 67}{space 3}-.0318666
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0465506{col 26}{space 2} .0327187{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0175768{col 67}{space 3}  .110678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto probit_mdelta
{txt}
{com}. 
. bootstrap, size(1000) reps(49): logit Y_dum X1 X2 X3
{txt}(running logit on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}     70.80
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-653.74994{txt}{col 49}Pseudo R2{col 67}= {res}    0.0568

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0752562{col 26}{space 2} .0906072{col 37}{space 1}    0.83{col 46}{space 3}0.406{col 54}{space 4}-.1023307{col 67}{space 3} .2528431
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1736359{col 26}{space 2} .0216899{col 37}{space 1}   -8.01{col 46}{space 3}0.000{col 54}{space 4}-.2161474{col 67}{space 3}-.1311244
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2007914{col 26}{space 2}  .156628{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-.1061938{col 67}{space 3} .5077767
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7787889{col 26}{space 2} .2433847{col 37}{space 1}    3.20{col 46}{space 3}0.001{col 54}{space 4} .3017636{col 67}{space 3} 1.255814
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto probit_mboot
{txt}
{com}. 
. * Exercise 4&5
. reg Y_dum X1 X2 X3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,000
{txt}{hline 13}{c +}{hline 34}   F(3, 996)       = {res}    26.54
{txt}       Model {c |} {res} 18.5076085         3  6.16920282   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 231.492392       996   .23242208   {txt}R-squared       ={res}    0.0740
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0712
{txt}       Total {c |} {res}        250       999   .25025025   {txt}Root MSE        =   {res}  .4821

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0187419{col 26}{space 2} .0266916{col 37}{space 1}    0.70{col 46}{space 3}0.483{col 54}{space 4}-.0336363{col 67}{space 3}   .07112
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0383407{col 26}{space 2} .0043438{col 37}{space 1}   -8.83{col 46}{space 3}0.000{col 54}{space 4}-.0468648{col 67}{space 3}-.0298165
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0465913{col 26}{space 2} .0328154{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0178039{col 67}{space 3} .1109865
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6708107{col 26}{space 2} .0624941{col 37}{space 1}   10.73{col 46}{space 3}0.000{col 54}{space 4} .5481754{col 67}{space 3} .7934459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto linear_
{txt}
{com}. 
. logit Y_dum X1 X2 X3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-693.14718}  
Iteration 1:{space 3}log likelihood = {res:-653.79128}  
Iteration 2:{space 3}log likelihood = {res:-653.74994}  
Iteration 3:{space 3}log likelihood = {res:-653.74994}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}     78.79
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-653.74994{txt}{col 49}Pseudo R2{col 67}= {res}    0.0568

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0752562{col 26}{space 2}  .115287{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.1507022{col 67}{space 3} .3012146
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1736359{col 26}{space 2} .0213784{col 37}{space 1}   -8.12{col 46}{space 3}0.000{col 54}{space 4}-.2155369{col 67}{space 3} -.131735
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2007914{col 26}{space 2} .1418988{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4} -.077325{col 67}{space 3} .4789079
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7787889{col 26}{space 2} .2735991{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .2425444{col 67}{space 3} 1.315033
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto logit_
{txt}
{com}. 
. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     1,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(Y_dum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0173997{col 26}{space 2} .0266328{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.0347996{col 67}{space 3} .0695989
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0401456{col 26}{space 2} .0042956{col 37}{space 1}   -9.35{col 46}{space 3}0.000{col 54}{space 4}-.0485649{col 67}{space 3}-.0317263
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0464241{col 26}{space 2} .0326824{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0176321{col 67}{space 3} .1104803
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto logit_mdelta
{txt}
{com}. 
. bootstrap, size(1000) reps(49): logit Y_dum X1 X2 X3
{txt}(running logit on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}     77.59
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-653.74994{txt}{col 49}Pseudo R2{col 67}= {res}    0.0568

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0752562{col 26}{space 2} .1034631{col 37}{space 1}    0.73{col 46}{space 3}0.467{col 54}{space 4}-.1275278{col 67}{space 3} .2780401
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1736359{col 26}{space 2} .0197254{col 37}{space 1}   -8.80{col 46}{space 3}0.000{col 54}{space 4}-.2122969{col 67}{space 3}-.1349749
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2007914{col 26}{space 2} .1427979{col 37}{space 1}    1.41{col 46}{space 3}0.160{col 54}{space 4}-.0790872{col 67}{space 3} .4806701
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7787889{col 26}{space 2} .2554871{col 37}{space 1}    3.05{col 46}{space 3}0.002{col 54}{space 4} .2780434{col 67}{space 3} 1.279534
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto logit_mboot
{txt}
{com}. 
. 
. ********
. * HW 3 *
. ********
. * merge two data set
. insheet using "demos.csv",clear
{txt}(9 vars, 516 obs)

{com}. sort hhid
{txt}
{com}. preserve
{txt}
{com}. 
. tempfile tmp
{txt}
{com}. insheet using "choicePrice.csv",clear
{txt}(13 vars, 4,470 obs)

{com}. sort hhid
{txt}
{com}. save `tmp'
{txt}file C:\Users\jiere\AppData\Local\Temp\ST_4870_000002.tmp saved

{com}. 
. restore
{txt}
{com}. merge hhid using `tmp'
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} hhid
does not uniquely identify observations in
C:\Users\jiere\AppData\Local\Temp\ST_4870_000002.tmp
{p_end}

{com}. drop hhid v1 _merge
{txt}
{com}. gen id = _n
{txt}
{com}. 
. * Exercise 1
. su ppk_stk  pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub /*
> */ppk_tub pfl_tub phse_tub

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}ppk_stk {c |}{res}      4,470    .5184362    .1505174        .19        .67
{txt}{space 5}pbb_stk {c |}{res}      4,470    .5432103    .1203319        .19       1.01
{txt}{space 5}pfl_stk {c |}{res}      4,470     1.01502    .0428952        .95       1.16
{txt}{space 4}phse_stk {c |}{res}      4,470    .4371476    .1188312        .19        .64
{txt}{space 4}pgen_stk {c |}{res}      4,470    .3452819    .0351661        .25        .55
{txt}{hline 13}{c +}{hline 57}
{space 4}pimp_stk {c |}{res}      4,470    .7807785    .1146461        .33        2.3
{txt}{space 5}pss_tub {c |}{res}      4,470    .8250895    .0612116         .5        .98
{txt}{space 5}ppk_tub {c |}{res}      4,470    1.077409    .0297261        .98       1.24
{txt}{space 5}pfl_tub {c |}{res}      4,470    1.189376    .0140545        .69       1.47
{txt}{space 4}phse_tub {c |}{res}      4,470    .5686734     .072455        .33       1.27
{txt}
{com}. tab choice

     {txt}choice {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,766       39.51       39.51
{txt}          2 {c |}{res}        699       15.64       55.15
{txt}          3 {c |}{res}        243        5.44       60.58
{txt}          4 {c |}{res}        593       13.27       73.85
{txt}          5 {c |}{res}        315        7.05       80.89
{txt}          6 {c |}{res}         74        1.66       82.55
{txt}          7 {c |}{res}        319        7.14       89.69
{txt}          8 {c |}{res}        203        4.54       94.23
{txt}          9 {c |}{res}        225        5.03       99.26
{txt}         10 {c |}{res}         33        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. gen choice_type = cond(choice == 1|choice == 2|choice == 3|choice == 4|choice ///
> == 5|choice == 6,"stk","tub")
{txt}
{com}. tab choice_type

{txt}choice_type {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        stk {c |}{res}      3,690       82.55       82.55
{txt}        tub {c |}{res}        780       17.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. gen choice_brand = cond(choice == 1|choice == 8,"ppk", /*
> */cond(choice == 2,"pbb",cond(choice == 3|choice == 9,"pfl",cond(choice == 4|choice == 10,"phse",/*
> */cond(choice == 5,"pgen",cond(choice == 6,"pimp",cond(choice == 7,"pss","")))))))
{txt}
{com}. tab choice_brand

{txt}choice_bran {c |}
          d {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        pbb {c |}{res}        699       15.64       15.64
{txt}        pfl {c |}{res}        468       10.47       26.11
{txt}       pgen {c |}{res}        315        7.05       33.15
{txt}       phse {c |}{res}        626       14.00       47.16
{txt}       pimp {c |}{res}         74        1.66       48.81
{txt}        ppk {c |}{res}      1,969       44.05       92.86
{txt}        pss {c |}{res}        319        7.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * Exercise 2&4
. * conditional logit
. * reshape from wide to long
. rename (ppk_stk  pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub /*
> */ppk_tub pfl_tub phse_tub)(Price1 Price2 Price3 Price4 Price5 Price6 Price7 /*
> */Price8 Price9 Price10)
{res}{txt}
{com}. 
. reshape long Price, i(id)
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    4470   {txt}->{res}   44700
{txt}Number of variables            {res}      21   {txt}->{res}      13
{txt}j variable (10 values)                    ->   {res}_j
{txt}xij variables:
              {res}Price1 Price2 ... Price10   {txt}->   {res}Price
{txt}{hline 77}

{com}. rename (_j)(alt)
{res}{txt}
{com}. gen d = cond(choice == alt,1,0)
{txt}
{com}. 
. asclogit d Price, case(id) alternatives(alt)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7559.2014}  
Iteration 1:{space 3}log likelihood = {res:-7465.2594}  
Iteration 2:{space 3}log likelihood = {res:-7464.9321}  
Iteration 3:{space 3}log likelihood = {res:-7464.9321}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}1{txt}){col 67}= {res}   1458.85
{txt}Log likelihood = {res}-7464.9321{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}alt          {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.656579{col 26}{space 2} .1742793{col 37}{space 1}  -38.19{col 46}{space 3}0.000{col 54}{space 4} -6.99816{col 67}{space 3}-6.314998
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9543068{col 26}{space 2} .0500462{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-1.052396{col 67}{space 3} -.856218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.296968{col 26}{space 2} .1086515{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} 1.084015{col 67}{space 3} 1.509921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.717332{col 26}{space 2} .0541582{col 37}{space 1}  -31.71{col 46}{space 3}0.000{col 54}{space 4} -1.82348{col 67}{space 3}-1.611184
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.904005{col 26}{space 2} .0714605{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-3.044065{col 67}{space 3}-2.763945
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.515311{col 26}{space 2} .1262303{col 37}{space 1}  -12.00{col 46}{space 3}0.000{col 54}{space 4}-1.762718{col 67}{space 3}-1.267904
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2517684{col 26}{space 2}  .079164{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0966098{col 67}{space 3}  .406927
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.464868{col 26}{space 2} .1180467{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 1.233501{col 67}{space 3} 1.696236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.357505{col 26}{space 2}  .133774{col 37}{space 1}   17.62{col 46}{space 3}0.000{col 54}{space 4} 2.095313{col 67}{space 3} 2.619697
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.896594{col 26}{space 2}  .177419{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4}-4.244328{col 67}{space 3}-3.548859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto c_logit
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .41862592
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62007}}}{space 1}{space 1}{ralign 8:{res:{sf: .045076}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.70841}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53172}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13669617
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.785545}}}{space 1}{space 1}{ralign 8:{res:{sf: .030158}}}{space 1}{space 1}{ralign 6:{res:{sf:-26.05}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.844654}}}{space 1}{space 1}{ralign 8:{res:{sf:-.726436}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05617075
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.352903}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02284}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.45}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.397668}}}{space 1}{space 1}{ralign 8:{res:{sf:-.308137}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .12912093
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.748524}}}{space 1}{space 1}{ralign 8:{res:{sf: .031316}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.809901}}}{space 1}{space 1}{ralign 8:{res:{sf:-.687146}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07264529
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -.44844}}}{space 1}{space 1}{ralign 8:{res:{sf: .025561}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.498539}}}{space 1}{space 1}{ralign 8:{res:{sf:-.398341}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01604447
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.105088}}}{space 1}{space 1}{ralign 8:{res:{sf: .012245}}}{space 1}{space 1}{ralign 6:{res:{sf: -8.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.129087}}}{space 1}{space 1}{ralign 8:{res:{sf:-.081089}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06992927
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.432938}}}{space 1}{space 1}{ralign 8:{res:{sf: .024519}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.66}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.480995}}}{space 1}{space 1}{ralign 8:{res:{sf:-.384882}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04385975
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.279151}}}{space 1}{space 1}{ralign 8:{res:{sf: .019602}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.31757}}}{space 1}{space 1}{ralign 8:{res:{sf:-.240731}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .05082152
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.321105}}}{space 1}{space 1}{ralign 8:{res:{sf: .021545}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.363332}}}{space 1}{space 1}{ralign 8:{res:{sf:-.278878}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00608591
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040265}}}{space 1}{space 1}{ralign 8:{res:{sf: .007011}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.74}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054006}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. * Exercise 3&4
. * Multinomial logit 
. asclogit d, case(id) alternatives(alt) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-8328.1129}  
Iteration 1:{space 3}log likelihood = {res:-8236.9407}  
Iteration 2:{space 3}log likelihood = {res: -8236.757}  
Iteration 3:{space 3}log likelihood = {res: -8236.757}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    101.55
{txt}Log likelihood = {res} -8236.757{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0030887{col 26}{space 2}  .003114{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4} -.009192{col 67}{space 3} .0030145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8453241{col 26}{space 2} .0931354{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4}-1.027866{col 67}{space 3} -.662782
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0145862{col 26}{space 2} .0038255{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0070885{col 67}{space 3}  .022084
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.399858{col 26}{space 2} .1335802{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4} -2.66167{col 67}{space 3}-2.138045
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040504{col 26}{space 2} .0030926{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0020109{col 67}{space 3} .0101118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.201326{col 26}{space 2} .0971021{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-1.391643{col 67}{space 3} -1.01101
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012536{col 26}{space 2} .0042024{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.0094901{col 67}{space 3} .0069829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.690582{col 26}{space 2} .1269952{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-1.939488{col 67}{space 3}-1.441676
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .030612{col 26}{space 2}  .004674{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} .0214512{col 67}{space 3} .0397729
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.139767{col 26}{space 2}  .210989{col 37}{space 1}  -19.62{col 46}{space 3}0.000{col 54}{space 4}-4.553298{col 67}{space 3}-3.726236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0069326{col 26}{space 2} .0044161{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} -.015588{col 67}{space 3} .0017228
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.531042{col 26}{space 2} .1280434{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-1.782002{col 67}{space 3}-1.280081
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0228862{col 26}{space 2} .0036217{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .0157878{col 67}{space 3} .0299845
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.848352{col 26}{space 2} .1393848{col 37}{space 1}  -20.44{col 46}{space 3}0.000{col 54}{space 4}-3.121541{col 67}{space 3}-2.575163
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .017743{col 26}{space 2} .0037623{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4}  .010369{col 67}{space 3} .0251169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.575597{col 26}{space 2}   .13614{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-2.842427{col 67}{space 3}-2.308768
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0107909{col 26}{space 2}   .01013{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.0090636{col 67}{space 3} .0306454
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.28227{col 26}{space 2}  .345792{col 37}{space 1}  -12.38{col 46}{space 3}0.000{col 54}{space 4} -4.96001{col 67}{space 3} -3.60453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto m_logit
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .39801715
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.001062}}}{space 1}{space 1}{ralign 8:{res:{sf: .000487}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.029}}}{space 1}{space 1}{ralign 8:{res:{sf:-.002016}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000108}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .15691817
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000904}}}{space 1}{space 1}{ralign 8:{res:{sf: .000378}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.017}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001645}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000162}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05406295
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000644}}}{space 1}{space 1}{ralign 8:{res:{sf: .000183}}}{space 1}{space 1}{ralign 6:{res:{sf:  3.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000286}}}{space 1}{space 1}{ralign 8:{res:{sf: .001002}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .13391688
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000185}}}{space 1}{space 1}{ralign 8:{res:{sf: .000329}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.574}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00046}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00083}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07089742
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000278}}}{space 1}{space 1}{ralign 8:{res:{sf: .000264}}}{space 1}{space 1}{ralign 6:{res:{sf: -1.06}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.291}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000795}}}{space 1}{space 1}{ralign 8:{res:{sf: .000238}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01478443
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000413}}}{space 1}{space 1}{ralign 8:{res:{sf: .000066}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000283}}}{space 1}{space 1}{ralign 8:{res:{sf: .000543}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .07107045
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000682}}}{space 1}{space 1}{ralign 8:{res:{sf: .000277}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.014}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001224}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00014}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04343487
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000878}}}{space 1}{space 1}{ralign 8:{res:{sf: .000138}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.38}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000608}}}{space 1}{space 1}{ralign 8:{res:{sf: .001148}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .04948833
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000746}}}{space 1}{space 1}{ralign 8:{res:{sf: .000164}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.55}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000425}}}{space 1}{space 1}{ralign 8:{res:{sf: .001067}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00740936
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00006}}}{space 1}{space 1}{ralign 8:{res:{sf: .000074}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.413}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000084}}}{space 1}{space 1}{ralign 8:{res:{sf: .000204}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. * Exercise 5
. * Mixed logit
. asclogit d Price, case(id) alternatives(alt) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7513.4717}  
Iteration 1:{space 3}log likelihood = {res:-7418.3161}  
Iteration 2:{space 3}log likelihood = {res:-7417.9325}  
Iteration 3:{space 3}log likelihood = {res:-7417.9325}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}10{txt}){col 67}= {res}   1538.10
{txt}Log likelihood = {res}-7417.9325{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}alt          {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.659669{col 26}{space 2} .1747698{col 37}{space 1}  -38.11{col 46}{space 3}0.000{col 54}{space 4}-7.002212{col 67}{space 3}-6.317127
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0042599{col 26}{space 2} .0034392{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0110007{col 67}{space 3} .0024808
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8406734{col 26}{space 2} .1038446{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-1.044205{col 67}{space 3}-.6371417
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .014344{col 26}{space 2} .0039221{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .0066568{col 67}{space 3} .0220311
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8886069{col 26}{space 2} .1594585{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .5760739{col 67}{space 3}  1.20114
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040998{col 26}{space 2} .0032042{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0021803{col 67}{space 3}   .01038
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.828492{col 26}{space 2}  .103218{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-2.030795{col 67}{space 3}-1.626188
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0011829{col 26}{space 2} .0042971{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4} -.009605{col 67}{space 3} .0072393
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -2.87341{col 26}{space 2} .1347573{col 37}{space 1}  -21.32{col 46}{space 3}0.000{col 54}{space 4} -3.13753{col 67}{space 3}-2.609291
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0298089{col 26}{space 2} .0047267{col 37}{space 1}    6.31{col 46}{space 3}0.000{col 54}{space 4} .0205448{col 67}{space 3} .0390731
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.457119{col 26}{space 2}  .215426{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-2.879346{col 67}{space 3}-2.034891
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0092456{col 26}{space 2} .0045935{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4}-.0182487{col 67}{space 3}-.0002425
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4968692{col 26}{space 2} .1424824{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .2176089{col 67}{space 3} .7761295
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0219965{col 26}{space 2} .0038203{col 37}{space 1}    5.76{col 46}{space 3}0.000{col 54}{space 4} .0145088{col 67}{space 3} .0294841
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   .80306{col 26}{space 2} .1709199{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} .4680631{col 67}{space 3} 1.138057
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0169911{col 26}{space 2} .0039155{col 37}{space 1}    4.34{col 46}{space 3}0.000{col 54}{space 4} .0093169{col 67}{space 3} .0246653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.864125{col 26}{space 2} .1799469{col 37}{space 1}   10.36{col 46}{space 3}0.000{col 54}{space 4} 1.511436{col 67}{space 3} 2.216815
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0087596{col 26}{space 2} .0103007{col 37}{space 1}    0.85{col 46}{space 3}0.395{col 54}{space 4}-.0114295{col 67}{space 3} .0289487
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.142386{col 26}{space 2} .3506563{col 37}{space 1}  -11.81{col 46}{space 3}0.000{col 54}{space 4}-4.829659{col 67}{space 3}-3.455112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto mix_logit
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .42172362
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62411}}}{space 1}{space 1}{ralign 8:{res:{sf: .045171}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.71264}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53558}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .385102}}}{space 1}{space 1}{ralign 8:{res:{sf: .016615}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .352538}}}{space 1}{space 1}{ralign 8:{res:{sf: .417666}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156859}}}{space 1}{space 1}{ralign 8:{res:{sf: .010841}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135611}}}{space 1}{space 1}{ralign 8:{res:{sf: .178107}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .366243}}}{space 1}{space 1}{ralign 8:{res:{sf: .017247}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .33244}}}{space 1}{space 1}{ralign 8:{res:{sf: .400045}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .20521}}}{space 1}{space 1}{ralign 8:{res:{sf: .012577}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .18056}}}{space 1}{space 1}{ralign 8:{res:{sf: .229859}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .040343}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00515}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030249}}}{space 1}{space 1}{ralign 8:{res:{sf: .050437}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .195568}}}{space 1}{space 1}{ralign 8:{res:{sf: .011974}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .172099}}}{space 1}{space 1}{ralign 8:{res:{sf: .219036}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117449}}}{space 1}{space 1}{ralign 8:{res:{sf: .008947}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.13}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .099913}}}{space 1}{space 1}{ralign 8:{res:{sf: .134986}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .140182}}}{space 1}{space 1}{ralign 8:{res:{sf: .010078}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .12043}}}{space 1}{space 1}{ralign 8:{res:{sf: .159935}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .017157}}}{space 1}{space 1}{ralign 8:{res:{sf: .003023}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.68}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011232}}}{space 1}{space 1}{ralign 8:{res:{sf: .023082}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000958}}}{space 1}{space 1}{ralign 8:{res:{sf: .000546}}}{space 1}{space 1}{ralign 6:{res:{sf: -1.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.079}}}{space 1}{space 1}{ralign 8:{res:{sf:-.002028}}}{space 1}{space 1}{ralign 8:{res:{sf: .000113}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13711827
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .385102}}}{space 1}{space 1}{ralign 8:{res:{sf: .016615}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .352538}}}{space 1}{space 1}{ralign 8:{res:{sf: .417666}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.787951}}}{space 1}{space 1}{ralign 8:{res:{sf: .030373}}}{space 1}{space 1}{ralign 6:{res:{sf:-25.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.847481}}}{space 1}{space 1}{ralign 8:{res:{sf:-.728421}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051001}}}{space 1}{space 1}{ralign 8:{res:{sf: .003796}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043561}}}{space 1}{space 1}{ralign 8:{res:{sf:  .05844}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .119079}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00655}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .106241}}}{space 1}{space 1}{ralign 8:{res:{sf: .131918}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066721}}}{space 1}{space 1}{ralign 8:{res:{sf: .004491}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.86}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057919}}}{space 1}{space 1}{ralign 8:{res:{sf: .075523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013117}}}{space 1}{space 1}{ralign 8:{res:{sf: .001716}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .009754}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01648}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063586}}}{space 1}{space 1}{ralign 8:{res:{sf: .004295}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.81}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055169}}}{space 1}{space 1}{ralign 8:{res:{sf: .072004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .038187}}}{space 1}{space 1}{ralign 8:{res:{sf: .003113}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .032086}}}{space 1}{space 1}{ralign 8:{res:{sf: .044288}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .045579}}}{space 1}{space 1}{ralign 8:{res:{sf: .003517}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .038685}}}{space 1}{space 1}{ralign 8:{res:{sf: .052472}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005578}}}{space 1}{space 1}{ralign 8:{res:{sf: .000999}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.59}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003621}}}{space 1}{space 1}{ralign 8:{res:{sf: .007536}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000896}}}{space 1}{space 1}{ralign 8:{res:{sf: .000368}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.015}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001617}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000174}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05585072
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156859}}}{space 1}{space 1}{ralign 8:{res:{sf: .010841}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135611}}}{space 1}{space 1}{ralign 8:{res:{sf: .178107}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051001}}}{space 1}{space 1}{ralign 8:{res:{sf: .003796}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043561}}}{space 1}{space 1}{ralign 8:{res:{sf:  .05844}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.351174}}}{space 1}{space 1}{ralign 8:{res:{sf: .022984}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.28}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.396222}}}{space 1}{space 1}{ralign 8:{res:{sf:-.306125}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048503}}}{space 1}{space 1}{ralign 8:{res:{sf: .003699}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.11}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041254}}}{space 1}{space 1}{ralign 8:{res:{sf: .055753}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027177}}}{space 1}{space 1}{ralign 8:{res:{sf: .002338}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022594}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03176}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005343}}}{space 1}{space 1}{ralign 8:{res:{sf: .000755}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003863}}}{space 1}{space 1}{ralign 8:{res:{sf: .006822}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .0259}}}{space 1}{space 1}{ralign 8:{res:{sf: .002229}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .021531}}}{space 1}{space 1}{ralign 8:{res:{sf: .030268}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .015554}}}{space 1}{space 1}{ralign 8:{res:{sf: .001515}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012584}}}{space 1}{space 1}{ralign 8:{res:{sf: .018525}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .018565}}}{space 1}{space 1}{ralign 8:{res:{sf: .001745}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015145}}}{space 1}{space 1}{ralign 8:{res:{sf: .021984}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002272}}}{space 1}{space 1}{ralign 8:{res:{sf: .000424}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001442}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000674}}}{space 1}{space 1}{ralign 8:{res:{sf: .000189}}}{space 1}{space 1}{ralign 6:{res:{sf:  3.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000303}}}{space 1}{space 1}{ralign 8:{res:{sf: .001045}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .13040323
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .366243}}}{space 1}{space 1}{ralign 8:{res:{sf: .017247}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .33244}}}{space 1}{space 1}{ralign 8:{res:{sf: .400045}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .119079}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00655}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .106241}}}{space 1}{space 1}{ralign 8:{res:{sf: .131918}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048503}}}{space 1}{space 1}{ralign 8:{res:{sf: .003699}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.11}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041254}}}{space 1}{space 1}{ralign 8:{res:{sf: .055753}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.755195}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03158}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.817091}}}{space 1}{space 1}{ralign 8:{res:{sf:-.693299}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063454}}}{space 1}{space 1}{ralign 8:{res:{sf: .004389}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .054851}}}{space 1}{space 1}{ralign 8:{res:{sf: .072057}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .012475}}}{space 1}{space 1}{ralign 8:{res:{sf: .001645}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00925}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0157}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060472}}}{space 1}{space 1}{ralign 8:{res:{sf: .004196}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.41}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .052248}}}{space 1}{space 1}{ralign 8:{res:{sf: .068696}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .036317}}}{space 1}{space 1}{ralign 8:{res:{sf: .003007}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030423}}}{space 1}{space 1}{ralign 8:{res:{sf: .042211}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043346}}}{space 1}{space 1}{ralign 8:{res:{sf: .003412}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03666}}}{space 1}{space 1}{ralign 8:{res:{sf: .050033}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005305}}}{space 1}{space 1}{ralign 8:{res:{sf: .000951}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00717}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000238}}}{space 1}{space 1}{ralign 8:{res:{sf: .000326}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.73}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.464}}}{space 1}{space 1}{ralign 8:{res:{sf:  -.0004}}}{space 1}{space 1}{ralign 8:{res:{sf: .000876}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07306635
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .20521}}}{space 1}{space 1}{ralign 8:{res:{sf: .012577}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .18056}}}{space 1}{space 1}{ralign 8:{res:{sf: .229859}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066721}}}{space 1}{space 1}{ralign 8:{res:{sf: .004491}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.86}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057919}}}{space 1}{space 1}{ralign 8:{res:{sf: .075523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027177}}}{space 1}{space 1}{ralign 8:{res:{sf: .002338}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022594}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03176}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063454}}}{space 1}{space 1}{ralign 8:{res:{sf: .004389}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .054851}}}{space 1}{space 1}{ralign 8:{res:{sf: .072057}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.451044}}}{space 1}{space 1}{ralign 8:{res:{sf: .025776}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.501565}}}{space 1}{space 1}{ralign 8:{res:{sf:-.400523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00699}}}{space 1}{space 1}{ralign 8:{res:{sf: .000961}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005106}}}{space 1}{space 1}{ralign 8:{res:{sf: .008873}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033883}}}{space 1}{space 1}{ralign 8:{res:{sf: .002708}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028576}}}{space 1}{space 1}{ralign 8:{res:{sf: .039191}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020349}}}{space 1}{space 1}{ralign 8:{res:{sf: .001872}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.87}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01668}}}{space 1}{space 1}{ralign 8:{res:{sf: .024018}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024287}}}{space 1}{space 1}{ralign 8:{res:{sf: .002147}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.31}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020079}}}{space 1}{space 1}{ralign 8:{res:{sf: .028496}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 8:{res:{sf: .000547}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001901}}}{space 1}{space 1}{ralign 8:{res:{sf: .004044}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000252}}}{space 1}{space 1}{ralign 8:{res:{sf: .000272}}}{space 1}{space 1}{ralign 6:{res:{sf: -0.93}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.354}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000786}}}{space 1}{space 1}{ralign 8:{res:{sf: .000282}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01436436
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .040343}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00515}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030249}}}{space 1}{space 1}{ralign 8:{res:{sf: .050437}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013117}}}{space 1}{space 1}{ralign 8:{res:{sf: .001716}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .009754}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01648}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005343}}}{space 1}{space 1}{ralign 8:{res:{sf: .000755}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003863}}}{space 1}{space 1}{ralign 8:{res:{sf: .006822}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .012475}}}{space 1}{space 1}{ralign 8:{res:{sf: .001645}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00925}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0157}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00699}}}{space 1}{space 1}{ralign 8:{res:{sf: .000961}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005106}}}{space 1}{space 1}{ralign 8:{res:{sf: .008873}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.094288}}}{space 1}{space 1}{ralign 8:{res:{sf: .011858}}}{space 1}{space 1}{ralign 6:{res:{sf: -7.95}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.117528}}}{space 1}{space 1}{ralign 8:{res:{sf:-.071047}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .006661}}}{space 1}{space 1}{ralign 8:{res:{sf: .000917}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004865}}}{space 1}{space 1}{ralign 8:{res:{sf: .008458}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:    .004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00058}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .002864}}}{space 1}{space 1}{ralign 8:{res:{sf: .005137}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004775}}}{space 1}{space 1}{ralign 8:{res:{sf: .000681}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.01}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf: .006109}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000584}}}{space 1}{space 1}{ralign 8:{res:{sf: .000126}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.65}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000338}}}{space 1}{space 1}{ralign 8:{res:{sf: .000831}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000396}}}{space 1}{space 1}{ralign 8:{res:{sf: .000065}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.13}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000269}}}{space 1}{space 1}{ralign 8:{res:{sf: .000522}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06963319
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .195568}}}{space 1}{space 1}{ralign 8:{res:{sf: .011974}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .172099}}}{space 1}{space 1}{ralign 8:{res:{sf: .219036}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063586}}}{space 1}{space 1}{ralign 8:{res:{sf: .004295}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.81}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055169}}}{space 1}{space 1}{ralign 8:{res:{sf: .072004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .0259}}}{space 1}{space 1}{ralign 8:{res:{sf: .002229}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .021531}}}{space 1}{space 1}{ralign 8:{res:{sf: .030268}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060472}}}{space 1}{space 1}{ralign 8:{res:{sf: .004196}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.41}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .052248}}}{space 1}{space 1}{ralign 8:{res:{sf: .068696}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033883}}}{space 1}{space 1}{ralign 8:{res:{sf: .002708}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028576}}}{space 1}{space 1}{ralign 8:{res:{sf: .039191}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .006661}}}{space 1}{space 1}{ralign 8:{res:{sf: .000917}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004865}}}{space 1}{space 1}{ralign 8:{res:{sf: .008458}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.431443}}}{space 1}{space 1}{ralign 8:{res:{sf: .024732}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.479916}}}{space 1}{space 1}{ralign 8:{res:{sf: -.38297}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019393}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00179}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015885}}}{space 1}{space 1}{ralign 8:{res:{sf: .022901}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023146}}}{space 1}{space 1}{ralign 8:{res:{sf: .002048}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.30}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019131}}}{space 1}{space 1}{ralign 8:{res:{sf: .027161}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000521}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001811}}}{space 1}{space 1}{ralign 8:{res:{sf: .003855}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000802}}}{space 1}{space 1}{ralign 8:{res:{sf: .000279}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.88}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.004}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001348}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000256}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res}  .0418186
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117449}}}{space 1}{space 1}{ralign 8:{res:{sf: .008947}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.13}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .099913}}}{space 1}{space 1}{ralign 8:{res:{sf: .134986}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .038187}}}{space 1}{space 1}{ralign 8:{res:{sf: .003113}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .032086}}}{space 1}{space 1}{ralign 8:{res:{sf: .044288}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .015554}}}{space 1}{space 1}{ralign 8:{res:{sf: .001515}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012584}}}{space 1}{space 1}{ralign 8:{res:{sf: .018525}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .036317}}}{space 1}{space 1}{ralign 8:{res:{sf: .003007}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030423}}}{space 1}{space 1}{ralign 8:{res:{sf: .042211}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020349}}}{space 1}{space 1}{ralign 8:{res:{sf: .001872}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.87}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01668}}}{space 1}{space 1}{ralign 8:{res:{sf: .024018}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:    .004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00058}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .002864}}}{space 1}{space 1}{ralign 8:{res:{sf: .005137}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019393}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00179}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015885}}}{space 1}{space 1}{ralign 8:{res:{sf: .022901}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.266852}}}{space 1}{space 1}{ralign 8:{res:{sf: .019513}}}{space 1}{space 1}{ralign 6:{res:{sf:-13.68}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.305096}}}{space 1}{space 1}{ralign 8:{res:{sf:-.228608}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013901}}}{space 1}{space 1}{ralign 8:{res:{sf: .001387}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.02}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011182}}}{space 1}{space 1}{ralign 8:{res:{sf: .016619}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001701}}}{space 1}{space 1}{ralign 8:{res:{sf: .000323}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001069}}}{space 1}{space 1}{ralign 8:{res:{sf: .002334}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000825}}}{space 1}{space 1}{ralign 8:{res:{sf: .000137}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.02}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000556}}}{space 1}{space 1}{ralign 8:{res:{sf: .001094}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .04991288
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .140182}}}{space 1}{space 1}{ralign 8:{res:{sf: .010078}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .12043}}}{space 1}{space 1}{ralign 8:{res:{sf: .159935}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .045579}}}{space 1}{space 1}{ralign 8:{res:{sf: .003517}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .038685}}}{space 1}{space 1}{ralign 8:{res:{sf: .052472}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .018565}}}{space 1}{space 1}{ralign 8:{res:{sf: .001745}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015145}}}{space 1}{space 1}{ralign 8:{res:{sf: .021984}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043346}}}{space 1}{space 1}{ralign 8:{res:{sf: .003412}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03666}}}{space 1}{space 1}{ralign 8:{res:{sf: .050033}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024287}}}{space 1}{space 1}{ralign 8:{res:{sf: .002147}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.31}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020079}}}{space 1}{space 1}{ralign 8:{res:{sf: .028496}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004775}}}{space 1}{space 1}{ralign 8:{res:{sf: .000681}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.01}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf: .006109}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023146}}}{space 1}{space 1}{ralign 8:{res:{sf: .002048}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.30}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019131}}}{space 1}{space 1}{ralign 8:{res:{sf: .027161}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013901}}}{space 1}{space 1}{ralign 8:{res:{sf: .001387}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.02}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011182}}}{space 1}{space 1}{ralign 8:{res:{sf: .016619}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.315812}}}{space 1}{space 1}{ralign 8:{res:{sf: .021622}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.35819}}}{space 1}{space 1}{ralign 8:{res:{sf:-.273434}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002031}}}{space 1}{space 1}{ralign 8:{res:{sf: .000381}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001283}}}{space 1}{space 1}{ralign 8:{res:{sf: .002778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000735}}}{space 1}{space 1}{ralign 8:{res:{sf: .000169}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000404}}}{space 1}{space 1}{ralign 8:{res:{sf: .001065}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00610877
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .017157}}}{space 1}{space 1}{ralign 8:{res:{sf: .003023}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.68}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011232}}}{space 1}{space 1}{ralign 8:{res:{sf: .023082}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005578}}}{space 1}{space 1}{ralign 8:{res:{sf: .000999}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.59}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003621}}}{space 1}{space 1}{ralign 8:{res:{sf: .007536}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002272}}}{space 1}{space 1}{ralign 8:{res:{sf: .000424}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001442}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005305}}}{space 1}{space 1}{ralign 8:{res:{sf: .000951}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00717}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 8:{res:{sf: .000547}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001901}}}{space 1}{space 1}{ralign 8:{res:{sf: .004044}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000584}}}{space 1}{space 1}{ralign 8:{res:{sf: .000126}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.65}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000338}}}{space 1}{space 1}{ralign 8:{res:{sf: .000831}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000521}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001811}}}{space 1}{space 1}{ralign 8:{res:{sf: .003855}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001701}}}{space 1}{space 1}{ralign 8:{res:{sf: .000323}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001069}}}{space 1}{space 1}{ralign 8:{res:{sf: .002334}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002031}}}{space 1}{space 1}{ralign 8:{res:{sf: .000381}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001283}}}{space 1}{space 1}{ralign 8:{res:{sf: .002778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040434}}}{space 1}{space 1}{ralign 8:{res:{sf: .007078}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054306}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026561}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00004}}}{space 1}{space 1}{ralign 8:{res:{sf: .000062}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.520}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000081}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00016}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. gen ll = e(ll)
{txt}
{com}. 
. asclogit d Price if alt != 10, case(id) alternatives(alt) casevar(income)
{txt}{p 0 6 2}note: 33 cases{txt} (297 obs) dropped due to no positive outcome  per case{p_end}
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7338.0067}  
Iteration 1:{space 3}log likelihood = {res:-7240.5947}  
Iteration 2:{space 3}log likelihood = {res:-7240.2035}  
Iteration 3:{space 3}log likelihood = {res:-7240.2035}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    39,933
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4437

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}         9
{col 63}{txt}avg = {res}       9.0
{col 63}{txt}max = {res}         9

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   1496.86
{txt}Log likelihood = {res}-7240.2035{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}alt          {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.662263{col 26}{space 2} .1773451{col 37}{space 1}  -37.57{col 46}{space 3}0.000{col 54}{space 4}-7.009853{col 67}{space 3}-6.314673
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0041388{col 26}{space 2} .0034332{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-.0108678{col 67}{space 3} .0025901
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8456784{col 26}{space 2} .1037222{col 37}{space 1}   -8.15{col 46}{space 3}0.000{col 54}{space 4} -1.04897{col 67}{space 3}-.6423866
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0142684{col 26}{space 2} .0039131{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .0065989{col 67}{space 3} .0219379
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8902285{col 26}{space 2} .1598555{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .5769175{col 67}{space 3} 1.203539
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040389{col 26}{space 2} .0031968{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0022266{col 67}{space 3} .0103045
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.827246{col 26}{space 2} .1030859{col 37}{space 1}  -17.73{col 46}{space 3}0.000{col 54}{space 4}-2.029291{col 67}{space 3}-1.625201
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012321{col 26}{space 2} .0042866{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-.0096337{col 67}{space 3} .0071695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.873897{col 26}{space 2} .1346734{col 37}{space 1}  -21.34{col 46}{space 3}0.000{col 54}{space 4}-3.137852{col 67}{space 3}-2.609942
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0297055{col 26}{space 2} .0047194{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0204558{col 67}{space 3} .0389553
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.455586{col 26}{space 2} .2153077{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-2.877582{col 67}{space 3}-2.033591
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0092135{col 26}{space 2} .0045835{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4} -.018197{col 67}{space 3}  -.00023
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4953166{col 26}{space 2} .1424907{col 37}{space 1}    3.48{col 46}{space 3}0.001{col 54}{space 4} .2160399{col 67}{space 3} .7745933
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0218706{col 26}{space 2}  .003812{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} .0143992{col 67}{space 3} .0293419
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8065785{col 26}{space 2} .1713693{col 37}{space 1}    4.71{col 46}{space 3}0.000{col 54}{space 4} .4707009{col 67}{space 3} 1.142456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0168581{col 26}{space 2} .0039069{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0092007{col 67}{space 3} .0245155
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.868468{col 26}{space 2} .1807678{col 37}{space 1}   10.34{col 46}{space 3}0.000{col 54}{space 4}  1.51417{col 67}{space 3} 2.222767
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto mix_logit_alt
{txt}
{com}. gen ll2 = e(ll)
{txt}
{com}. 
. gen MTT = 2*(ll - ll2)
{txt}
{com}. di MTT
{res}-355.45801
{txt}
{com}. hausman mix_logit mix_logit_alt

{txt}{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17} mix_logit  {col 30}mix_logit_~t{col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 7}Price {c |}{res}{col 18}-6.659669{col 31}-6.662263{col 47} .0025942{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from asclogit}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from asclogit}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:1})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}={res}    -0.01{txt}{col 41}chi2<0 ==> model fitted on these
{col 41}data fails to meet the asymptotic
{col 41}assumptions of the Hausman test;
{col 41}see {help suest##|_new:suest} for a generalized test

{com}. di r(p)
{res}1
{txt}
{com}. * we reject the null hypothese and state that IIA is hold.
. 
. ********
. * HW 4 *
. ********
. insheet using "Koop-Tobias.csv", clear
{txt}(10 vars, 17,919 obs)

{com}. 
. * Exercise 1
. xtset personid timetrnd
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}timetrnd, 0 to 14, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtdes

{txt}personid:  {res}1{txt}, {res}2{txt}, ..., {res}2178                                   {txt}n ={res}       2178
{txt}timetrnd:  {res}0, 1, ..., 14                                     {txt}T ={res}         15
           {txt}Delta(timetrnd) = {res}1 unit
           {txt}Span(timetrnd)  = {res}15 periods
           {txt}(personid*timetrnd uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     1       2       5         8        11      14      15

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}       93      4.27    4.27{txt} {c |}  {res}111111111111111
       46      2.11    6.38{txt} {c |}  {res}........1111111
       45      2.07    8.45{txt} {c |}  {res}......111111111
       44      2.02   10.47{txt} {c |}  {res}.......11111111
       43      1.97   12.44{txt} {c |}  {res}.11111111111111
       42      1.93   14.37{txt} {c |}  {res}..1111111111111
       36      1.65   16.02{txt} {c |}  {res}....11111111111
       35      1.61   17.63{txt} {c |}  {res}...111111111111
       30      1.38   19.01{txt} {c |}  {res}..........11111
     1764     80.99  100.00{txt} {c |} (other patterns)
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}     2178    100.00        {txt} {c |}  {res}XXXXXXXXXXXXXXX
{txt}
{com}. global yvar logwage
{txt}
{com}. global xvar "educ potexper"
{txt}
{com}. 
. * Exercise 2
. xtreg $yvar $xvar, re
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1961                                         {txt}min = {res}         1
{txt}     between = {res}0.1533                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1578                                         {txt}max = {res}        15

                                                {txt}Wald chi2({res}2{txt})      =  {res}  4209.96
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .107938{col 26}{space 2} .0033832{col 37}{space 1}   31.90{col 46}{space 3}0.000{col 54}{space 4} .1013071{col 67}{space 3}  .114569
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0387645{col 26}{space 2} .0007178{col 37}{space 1}   54.00{col 46}{space 3}0.000{col 54}{space 4} .0373576{col 67}{space 3} .0401714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5635206{col 26}{space 2} .0438846{col 37}{space 1}   12.84{col 46}{space 3}0.000{col 54}{space 4} .4775083{col 67}{space 3} .6495328
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37207276
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res}  .5516129{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est sto re
{txt}
{com}. 
. * Exercise 3
. xtreg $yvar $xvar, be

{txt}Between regression (regression on group means)  Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1962                                         {txt}min = {res}         1
{txt}     between = {res}0.1553                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1518                                         {txt}max = {res}        15

                                                {txt}F({res}2{txt},{res}2175{txt})         =  {res}   200.01
{txt}sd(u_i + avg(e_i.))= {res} .3991313                  {txt}Prob > F          =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0930999{col 26}{space 2} .0046685{col 37}{space 1}   19.94{col 46}{space 3}0.000{col 54}{space 4} .0839447{col 67}{space 3} .1022551
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0259987{col 26}{space 2} .0036049{col 37}{space 1}    7.21{col 46}{space 3}0.000{col 54}{space 4} .0189294{col 67}{space 3} .0330681
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8455688{col 26}{space 2} .0770179{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .6945324{col 67}{space 3} .9966052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto be
{txt}
{com}. 
. xtreg $yvar $xvar, fe
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,919
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,178

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1964{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1550{col 63}{txt}avg{col 67}={col 69}{res}       8.2
{txt}     overall = {res}0.1551{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}15739{txt}){col 67}={col 70}{res}  1923.47
{txt}corr(u_i, Xb){col 16}= {res}-0.1273{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .123662{col 26}{space 2} .0057619{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .1123681{col 67}{space 3} .1349559
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0385611{col 26}{space 2} .0007585{col 37}{space 1}   50.84{col 46}{space 3}0.000{col 54}{space 4} .0370744{col 67}{space 3} .0400478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4068016{col 26}{space 2} .0717348{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .2661931{col 67}{space 3}   .54741
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40290853
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res} .59059603{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}2177{txt}, {res}15739{txt}) = {res}9.95{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. est sto fe
{txt}
{com}. 
. * first difference
. gen educ_D = educ - L.educ
{txt}(4,235 missing values generated)

{com}. gen educ_L = L.educ
{txt}(4,235 missing values generated)

{com}. gen potexper_D = potexper - L.potexper
{txt}(4,235 missing values generated)

{com}. gen logwage_D = logwage - L.logwage
{txt}(4,235 missing values generated)

{com}. reg logwage_D educ_D potexper_D, noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    13,684
{txt}{hline 13}{c +}{hline 34}   F(2, 13682)     = {res}   171.87
{txt}       Model {c |} {res} 38.7282937         2  19.3641469   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1541.54171    13,682  .112669326   {txt}R-squared       ={res}    0.0245
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0244
{txt}       Total {c |} {res} 1580.27001    13,684  .115483046   {txt}Root MSE        =   {res} .33566

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   logwage_D{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}educ_D {c |}{col 14}{res}{space 2} .0431084{col 26}{space 2} .0151792{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} .0133551{col 67}{space 3} .0728617
{txt}{space 2}potexper_D {c |}{col 14}{res}{space 2} .0535369{col 26}{space 2} .0029221{col 37}{space 1}   18.32{col 46}{space 3}0.000{col 54}{space 4} .0478092{col 67}{space 3} .0592647
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto fd
{txt}
{com}. 
. * Exercise 4
. * draw 100 person sample
. preserve
{txt}
{com}. 
. tempfile tmp
{txt}
{com}. bysort personid: keep if _n == 1
{txt}(15,741 observations deleted)

{com}. sample 100,count
{txt}(2,078 observations deleted)

{com}. sort personid
{txt}
{com}. save `tmp'
{txt}file C:\Users\jiere\AppData\Local\Temp\ST_4870_000004.tmp saved

{com}. 
. restore
{txt}
{com}. merge m:1 personid using `tmp'
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          17,207
{txt}{col 9}from master{col 30}{res}          17,207{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             712{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge == 3
{txt}(17,207 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. global yvar_ logwage
{txt}
{com}. global xvar_ "educ potexper"
{txt}
{com}. global xvar_timinv "ability mothered fathered brknhome siblings"
{txt}
{com}. 
. reg $yvar_ $xvar_ i.personid, vce(robust)

{txt}Linear regression                               Number of obs     = {res}       712
                                                {txt}{help j_robustsingular:F(95, 610) }       =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.6954
                                                {txt}Root MSE          =    {res} .32916

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .1663024{col 26}{space 2} .0231062{col 37}{space 1}    7.20{col 46}{space 3}0.000{col 54}{space 4}  .120925{col 67}{space 3} .2116797
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0411721{col 26}{space 2} .0040243{col 37}{space 1}   10.23{col 46}{space 3}0.000{col 54}{space 4} .0332689{col 67}{space 3} .0490753
{txt}{space 12} {c |}
{space 4}personid {c |}
{space 9}48  {c |}{col 14}{res}{space 2}-.5152879{col 26}{space 2} .1495895{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.8090608{col 67}{space 3} -.221515
{txt}{space 9}50  {c |}{col 14}{res}{space 2}-.2613866{col 26}{space 2} .1942094{col 37}{space 1}   -1.35{col 46}{space 3}0.179{col 54}{space 4}-.6427868{col 67}{space 3} .1200136
{txt}{space 9}93  {c |}{col 14}{res}{space 2} .2158558{col 26}{space 2}  .184385{col 37}{space 1}    1.17{col 46}{space 3}0.242{col 54}{space 4}-.1462507{col 67}{space 3} .5779623
{txt}{space 8}120  {c |}{col 14}{res}{space 2} .0999611{col 26}{space 2} .1368473{col 37}{space 1}    0.73{col 46}{space 3}0.465{col 54}{space 4}-.1687879{col 67}{space 3} .3687101
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .2625724{col 26}{space 2} .1492734{col 37}{space 1}    1.76{col 46}{space 3}0.079{col 54}{space 4}-.0305798{col 67}{space 3} .5557247
{txt}{space 8}146  {c |}{col 14}{res}{space 2}-.4464182{col 26}{space 2} .1504432{col 37}{space 1}   -2.97{col 46}{space 3}0.003{col 54}{space 4}-.7418676{col 67}{space 3}-.1509688
{txt}{space 8}164  {c |}{col 14}{res}{space 2}-.3272568{col 26}{space 2} .1461511{col 37}{space 1}   -2.24{col 46}{space 3}0.026{col 54}{space 4}-.6142773{col 67}{space 3}-.0402364
{txt}{space 8}168  {c |}{col 14}{res}{space 2} .2386949{col 26}{space 2} .1450832{col 37}{space 1}    1.65{col 46}{space 3}0.100{col 54}{space 4}-.0462283{col 67}{space 3} .5236181
{txt}{space 8}188  {c |}{col 14}{res}{space 2} -.911015{col 26}{space 2} .2015027{col 37}{space 1}   -4.52{col 46}{space 3}0.000{col 54}{space 4}-1.306738{col 67}{space 3}-.5152919
{txt}{space 8}236  {c |}{col 14}{res}{space 2}-.4323337{col 26}{space 2} .1349671{col 37}{space 1}   -3.20{col 46}{space 3}0.001{col 54}{space 4}-.6973903{col 67}{space 3} -.167277
{txt}{space 8}241  {c |}{col 14}{res}{space 2}-1.231324{col 26}{space 2} .2218857{col 37}{space 1}   -5.55{col 46}{space 3}0.000{col 54}{space 4}-1.667077{col 67}{space 3}-.7955719
{txt}{space 8}356  {c |}{col 14}{res}{space 2}-.0497933{col 26}{space 2} .1344966{col 37}{space 1}   -0.37{col 46}{space 3}0.711{col 54}{space 4}-.3139259{col 67}{space 3} .2143394
{txt}{space 8}390  {c |}{col 14}{res}{space 2}  .253655{col 26}{space 2} .1742162{col 37}{space 1}    1.46{col 46}{space 3}0.146{col 54}{space 4}-.0884814{col 67}{space 3} .5957914
{txt}{space 8}402  {c |}{col 14}{res}{space 2} -.291547{col 26}{space 2} .1520788{col 37}{space 1}   -1.92{col 46}{space 3}0.056{col 54}{space 4}-.5902086{col 67}{space 3} .0071146
{txt}{space 8}500  {c |}{col 14}{res}{space 2}-.1805769{col 26}{space 2} .1688686{col 37}{space 1}   -1.07{col 46}{space 3}0.285{col 54}{space 4}-.5122114{col 67}{space 3} .1510576
{txt}{space 8}526  {c |}{col 14}{res}{space 2} .1667834{col 26}{space 2}  .130921{col 37}{space 1}    1.27{col 46}{space 3}0.203{col 54}{space 4}-.0903272{col 67}{space 3}  .423894
{txt}{space 8}534  {c |}{col 14}{res}{space 2}-.7572409{col 26}{space 2} .1941764{col 37}{space 1}   -3.90{col 46}{space 3}0.000{col 54}{space 4}-1.138576{col 67}{space 3}-.3759056
{txt}{space 8}543  {c |}{col 14}{res}{space 2}-.3530352{col 26}{space 2} .1297267{col 37}{space 1}   -2.72{col 46}{space 3}0.007{col 54}{space 4}-.6078004{col 67}{space 3}  -.09827
{txt}{space 8}556  {c |}{col 14}{res}{space 2}-1.999654{col 26}{space 2} .1253698{col 37}{space 1}  -15.95{col 46}{space 3}0.000{col 54}{space 4}-2.245862{col 67}{space 3}-1.753445
{txt}{space 8}581  {c |}{col 14}{res}{space 2}-.5051732{col 26}{space 2} .2359035{col 37}{space 1}   -2.14{col 46}{space 3}0.033{col 54}{space 4}-.9684548{col 67}{space 3}-.0418916
{txt}{space 8}589  {c |}{col 14}{res}{space 2} -.873663{col 26}{space 2} .2513037{col 37}{space 1}   -3.48{col 46}{space 3}0.001{col 54}{space 4}-1.367188{col 67}{space 3}-.3801376
{txt}{space 8}606  {c |}{col 14}{res}{space 2} .0558439{col 26}{space 2} .1352557{col 37}{space 1}    0.41{col 46}{space 3}0.680{col 54}{space 4}-.2097794{col 67}{space 3} .3214671
{txt}{space 8}637  {c |}{col 14}{res}{space 2}-.4286889{col 26}{space 2} .1921194{col 37}{space 1}   -2.23{col 46}{space 3}0.026{col 54}{space 4}-.8059846{col 67}{space 3}-.0513932
{txt}{space 8}692  {c |}{col 14}{res}{space 2}-.6775516{col 26}{space 2} .1657045{col 37}{space 1}   -4.09{col 46}{space 3}0.000{col 54}{space 4}-1.002972{col 67}{space 3}-.3521311
{txt}{space 8}704  {c |}{col 14}{res}{space 2}-.2154074{col 26}{space 2} .1935206{col 37}{space 1}   -1.11{col 46}{space 3}0.266{col 54}{space 4}-.5954549{col 67}{space 3} .1646401
{txt}{space 8}727  {c |}{col 14}{res}{space 2}-.4662274{col 26}{space 2} .2376552{col 37}{space 1}   -1.96{col 46}{space 3}0.050{col 54}{space 4}-.9329491{col 67}{space 3} .0004943
{txt}{space 8}730  {c |}{col 14}{res}{space 2}-1.671579{col 26}{space 2} .2190015{col 37}{space 1}   -7.63{col 46}{space 3}0.000{col 54}{space 4}-2.101668{col 67}{space 3}-1.241491
{txt}{space 8}740  {c |}{col 14}{res}{space 2}-.2378501{col 26}{space 2} .1418808{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-.5164841{col 67}{space 3}  .040784
{txt}{space 8}763  {c |}{col 14}{res}{space 2}-.2805889{col 26}{space 2} .2049124{col 37}{space 1}   -1.37{col 46}{space 3}0.171{col 54}{space 4}-.6830082{col 67}{space 3} .1218305
{txt}{space 8}785  {c |}{col 14}{res}{space 2}-1.037836{col 26}{space 2} .1814119{col 37}{space 1}   -5.72{col 46}{space 3}0.000{col 54}{space 4}-1.394104{col 67}{space 3}-.6815687
{txt}{space 8}792  {c |}{col 14}{res}{space 2} -.413154{col 26}{space 2} .2150912{col 37}{space 1}   -1.92{col 46}{space 3}0.055{col 54}{space 4}-.8355632{col 67}{space 3} .0092552
{txt}{space 8}800  {c |}{col 14}{res}{space 2}-.1521331{col 26}{space 2} .1585128{col 37}{space 1}   -0.96{col 46}{space 3}0.338{col 54}{space 4}-.4634301{col 67}{space 3} .1591639
{txt}{space 8}811  {c |}{col 14}{res}{space 2}-1.144719{col 26}{space 2} .2928138{col 37}{space 1}   -3.91{col 46}{space 3}0.000{col 54}{space 4}-1.719764{col 67}{space 3}-.5696736
{txt}{space 8}815  {c |}{col 14}{res}{space 2}-1.117049{col 26}{space 2} .1341948{col 37}{space 1}   -8.32{col 46}{space 3}0.000{col 54}{space 4}-1.380589{col 67}{space 3}-.8535091
{txt}{space 8}822  {c |}{col 14}{res}{space 2}-.6511561{col 26}{space 2} .4375148{col 37}{space 1}   -1.49{col 46}{space 3}0.137{col 54}{space 4}-1.510374{col 67}{space 3} .2080621
{txt}{space 8}824  {c |}{col 14}{res}{space 2}-.5433239{col 26}{space 2} .2466975{col 37}{space 1}   -2.20{col 46}{space 3}0.028{col 54}{space 4}-1.027803{col 67}{space 3}-.0588444
{txt}{space 8}850  {c |}{col 14}{res}{space 2}-.3017422{col 26}{space 2} .1584431{col 37}{space 1}   -1.90{col 46}{space 3}0.057{col 54}{space 4}-.6129022{col 67}{space 3} .0094179
{txt}{space 8}989  {c |}{col 14}{res}{space 2}-.4432073{col 26}{space 2} .1856786{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.8078542{col 67}{space 3}-.0785603
{txt}{space 7}1014  {c |}{col 14}{res}{space 2}-.1881532{col 26}{space 2}  .189344{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4}-.5599984{col 67}{space 3}  .183692
{txt}{space 7}1019  {c |}{col 14}{res}{space 2}-.8618663{col 26}{space 2}  .300119{col 37}{space 1}   -2.87{col 46}{space 3}0.004{col 54}{space 4}-1.451258{col 67}{space 3}-.2724745
{txt}{space 7}1028  {c |}{col 14}{res}{space 2}-.2055587{col 26}{space 2} .1567585{col 37}{space 1}   -1.31{col 46}{space 3}0.190{col 54}{space 4}-.5134106{col 67}{space 3} .1022932
{txt}{space 7}1041  {c |}{col 14}{res}{space 2} .1029784{col 26}{space 2} .1432923{col 37}{space 1}    0.72{col 46}{space 3}0.473{col 54}{space 4}-.1784278{col 67}{space 3} .3843846
{txt}{space 7}1071  {c |}{col 14}{res}{space 2} .4211167{col 26}{space 2} .2677594{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4}-.1047254{col 67}{space 3} .9469588
{txt}{space 7}1109  {c |}{col 14}{res}{space 2} .2253953{col 26}{space 2} .1419452{col 37}{space 1}    1.59{col 46}{space 3}0.113{col 54}{space 4}-.0533654{col 67}{space 3} .5041559
{txt}{space 7}1114  {c |}{col 14}{res}{space 2}-1.268793{col 26}{space 2} .2106887{col 37}{space 1}   -6.02{col 46}{space 3}0.000{col 54}{space 4}-1.682556{col 67}{space 3}-.8550301
{txt}{space 7}1128  {c |}{col 14}{res}{space 2} .7725659{col 26}{space 2}  .244817{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .2917794{col 67}{space 3} 1.253352
{txt}{space 7}1142  {c |}{col 14}{res}{space 2} .2215117{col 26}{space 2} .1445427{col 37}{space 1}    1.53{col 46}{space 3}0.126{col 54}{space 4}-.0623499{col 67}{space 3} .5053733
{txt}{space 7}1150  {c |}{col 14}{res}{space 2}-.3041051{col 26}{space 2} .1825009{col 37}{space 1}   -1.67{col 46}{space 3}0.096{col 54}{space 4}-.6625114{col 67}{space 3} .0543013
{txt}{space 7}1151  {c |}{col 14}{res}{space 2}-.9837671{col 26}{space 2} .2498752{col 37}{space 1}   -3.94{col 46}{space 3}0.000{col 54}{space 4}-1.474487{col 67}{space 3}-.4930471
{txt}{space 7}1192  {c |}{col 14}{res}{space 2}-.2389947{col 26}{space 2}  .192697{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.6174247{col 67}{space 3} .1394354
{txt}{space 7}1220  {c |}{col 14}{res}{space 2}-.3832377{col 26}{space 2} .1706925{col 37}{space 1}   -2.25{col 46}{space 3}0.025{col 54}{space 4}-.7184541{col 67}{space 3}-.0480214
{txt}{space 7}1224  {c |}{col 14}{res}{space 2}-.7602874{col 26}{space 2} .1686986{col 37}{space 1}   -4.51{col 46}{space 3}0.000{col 54}{space 4}-1.091588{col 67}{space 3}-.4289869
{txt}{space 7}1225  {c |}{col 14}{res}{space 2}-1.135851{col 26}{space 2} .2961551{col 37}{space 1}   -3.84{col 46}{space 3}0.000{col 54}{space 4}-1.717458{col 67}{space 3}-.5542435
{txt}{space 7}1263  {c |}{col 14}{res}{space 2}-.2821304{col 26}{space 2} .1962259{col 37}{space 1}   -1.44{col 46}{space 3}0.151{col 54}{space 4}-.6674907{col 67}{space 3} .1032299
{txt}{space 7}1273  {c |}{col 14}{res}{space 2}-.4340106{col 26}{space 2} .1507859{col 37}{space 1}   -2.88{col 46}{space 3}0.004{col 54}{space 4}-.7301332{col 67}{space 3} -.137888
{txt}{space 7}1309  {c |}{col 14}{res}{space 2} .4000403{col 26}{space 2}  .170323{col 37}{space 1}    2.35{col 46}{space 3}0.019{col 54}{space 4} .0655497{col 67}{space 3} .7345308
{txt}{space 7}1314  {c |}{col 14}{res}{space 2}-.2385045{col 26}{space 2} .1547253{col 37}{space 1}   -1.54{col 46}{space 3}0.124{col 54}{space 4}-.5423634{col 67}{space 3} .0653544
{txt}{space 7}1315  {c |}{col 14}{res}{space 2}-.1122702{col 26}{space 2} .1476957{col 37}{space 1}   -0.76{col 46}{space 3}0.447{col 54}{space 4}-.4023241{col 67}{space 3} .1777836
{txt}{space 7}1328  {c |}{col 14}{res}{space 2}-.0944218{col 26}{space 2} .1394656{col 37}{space 1}   -0.68{col 46}{space 3}0.499{col 54}{space 4}-.3683128{col 67}{space 3} .1794692
{txt}{space 7}1370  {c |}{col 14}{res}{space 2} .1242927{col 26}{space 2}  .130168{col 37}{space 1}    0.95{col 46}{space 3}0.340{col 54}{space 4}-.1313391{col 67}{space 3} .3799246
{txt}{space 7}1396  {c |}{col 14}{res}{space 2}-.5595471{col 26}{space 2} .1374572{col 37}{space 1}   -4.07{col 46}{space 3}0.000{col 54}{space 4}-.8294938{col 67}{space 3}-.2896003
{txt}{space 7}1417  {c |}{col 14}{res}{space 2} .4071599{col 26}{space 2} .1756247{col 37}{space 1}    2.32{col 46}{space 3}0.021{col 54}{space 4} .0622574{col 67}{space 3} .7520624
{txt}{space 7}1448  {c |}{col 14}{res}{space 2} .3912067{col 26}{space 2} .2087766{col 37}{space 1}    1.87{col 46}{space 3}0.061{col 54}{space 4}-.0188013{col 67}{space 3} .8012148
{txt}{space 7}1476  {c |}{col 14}{res}{space 2} .2527043{col 26}{space 2} .2571784{col 37}{space 1}    0.98{col 46}{space 3}0.326{col 54}{space 4}-.2523582{col 67}{space 3} .7577667
{txt}{space 7}1480  {c |}{col 14}{res}{space 2}-.2319872{col 26}{space 2} .1572106{col 37}{space 1}   -1.48{col 46}{space 3}0.141{col 54}{space 4}-.5407269{col 67}{space 3} .0767525
{txt}{space 7}1513  {c |}{col 14}{res}{space 2}-.1713135{col 26}{space 2} .1318168{col 37}{space 1}   -1.30{col 46}{space 3}0.194{col 54}{space 4}-.4301834{col 67}{space 3} .0875564
{txt}{space 7}1528  {c |}{col 14}{res}{space 2}-.8647639{col 26}{space 2} .2103268{col 37}{space 1}   -4.11{col 46}{space 3}0.000{col 54}{space 4}-1.277816{col 67}{space 3}-.4517114
{txt}{space 7}1532  {c |}{col 14}{res}{space 2}-.5579776{col 26}{space 2} .1482316{col 37}{space 1}   -3.76{col 46}{space 3}0.000{col 54}{space 4}-.8490838{col 67}{space 3}-.2668714
{txt}{space 7}1583  {c |}{col 14}{res}{space 2} .5692779{col 26}{space 2} .1361614{col 37}{space 1}    4.18{col 46}{space 3}0.000{col 54}{space 4} .3018759{col 67}{space 3} .8366798
{txt}{space 7}1634  {c |}{col 14}{res}{space 2}-.6320261{col 26}{space 2} .2108354{col 37}{space 1}   -3.00{col 46}{space 3}0.003{col 54}{space 4}-1.046077{col 67}{space 3}-.2179747
{txt}{space 7}1651  {c |}{col 14}{res}{space 2} .3154331{col 26}{space 2} .1396798{col 37}{space 1}    2.26{col 46}{space 3}0.024{col 54}{space 4} .0411215{col 67}{space 3} .5897447
{txt}{space 7}1681  {c |}{col 14}{res}{space 2} -.456079{col 26}{space 2} .4440013{col 37}{space 1}   -1.03{col 46}{space 3}0.305{col 54}{space 4}-1.328036{col 67}{space 3} .4158776
{txt}{space 7}1698  {c |}{col 14}{res}{space 2}-.9789236{col 26}{space 2} .1286955{col 37}{space 1}   -7.61{col 46}{space 3}0.000{col 54}{space 4}-1.231664{col 67}{space 3}-.7261836
{txt}{space 7}1707  {c |}{col 14}{res}{space 2} .1844362{col 26}{space 2} .1481699{col 37}{space 1}    1.24{col 46}{space 3}0.214{col 54}{space 4}-.1065488{col 67}{space 3} .4754211
{txt}{space 7}1733  {c |}{col 14}{res}{space 2}-.6130044{col 26}{space 2} .1782506{col 37}{space 1}   -3.44{col 46}{space 3}0.001{col 54}{space 4}-.9630637{col 67}{space 3} -.262945
{txt}{space 7}1760  {c |}{col 14}{res}{space 2} .3073788{col 26}{space 2} .1396689{col 37}{space 1}    2.20{col 46}{space 3}0.028{col 54}{space 4} .0330885{col 67}{space 3}  .581669
{txt}{space 7}1765  {c |}{col 14}{res}{space 2} -.073284{col 26}{space 2} .1491653{col 37}{space 1}   -0.49{col 46}{space 3}0.623{col 54}{space 4}-.3662238{col 67}{space 3} .2196558
{txt}{space 7}1787  {c |}{col 14}{res}{space 2}-.7467098{col 26}{space 2} .3380093{col 37}{space 1}   -2.21{col 46}{space 3}0.028{col 54}{space 4}-1.410513{col 67}{space 3}-.0829067
{txt}{space 7}1801  {c |}{col 14}{res}{space 2} .1080428{col 26}{space 2} .1387054{col 37}{space 1}    0.78{col 46}{space 3}0.436{col 54}{space 4}-.1643554{col 67}{space 3} .3804409
{txt}{space 7}1825  {c |}{col 14}{res}{space 2}-.0587595{col 26}{space 2} .1340595{col 37}{space 1}   -0.44{col 46}{space 3}0.661{col 54}{space 4}-.3220336{col 67}{space 3} .2045146
{txt}{space 7}1834  {c |}{col 14}{res}{space 2}-.0150173{col 26}{space 2} .1448364{col 37}{space 1}   -0.10{col 46}{space 3}0.917{col 54}{space 4}-.2994557{col 67}{space 3} .2694211
{txt}{space 7}1851  {c |}{col 14}{res}{space 2}-.3407073{col 26}{space 2} .1325348{col 37}{space 1}   -2.57{col 46}{space 3}0.010{col 54}{space 4} -.600987{col 67}{space 3}-.0804275
{txt}{space 7}1862  {c |}{col 14}{res}{space 2}-.3417871{col 26}{space 2} .1620953{col 37}{space 1}   -2.11{col 46}{space 3}0.035{col 54}{space 4}-.6601196{col 67}{space 3}-.0234546
{txt}{space 7}1882  {c |}{col 14}{res}{space 2} -.264153{col 26}{space 2} .1452163{col 37}{space 1}   -1.82{col 46}{space 3}0.069{col 54}{space 4}-.5493376{col 67}{space 3} .0210317
{txt}{space 7}1896  {c |}{col 14}{res}{space 2}-1.004124{col 26}{space 2} .1882896{col 37}{space 1}   -5.33{col 46}{space 3}0.000{col 54}{space 4}-1.373898{col 67}{space 3}-.6343492
{txt}{space 7}1899  {c |}{col 14}{res}{space 2}-.8030647{col 26}{space 2} .1725671{col 37}{space 1}   -4.65{col 46}{space 3}0.000{col 54}{space 4}-1.141962{col 67}{space 3}-.4641669
{txt}{space 7}1924  {c |}{col 14}{res}{space 2}-1.460382{col 26}{space 2} .3521311{col 37}{space 1}   -4.15{col 46}{space 3}0.000{col 54}{space 4}-2.151918{col 67}{space 3}-.7688454
{txt}{space 7}1925  {c |}{col 14}{res}{space 2} -.374566{col 26}{space 2} .1876026{col 37}{space 1}   -2.00{col 46}{space 3}0.046{col 54}{space 4}-.7429914{col 67}{space 3}-.0061407
{txt}{space 7}1931  {c |}{col 14}{res}{space 2} -.225173{col 26}{space 2} .1486021{col 37}{space 1}   -1.52{col 46}{space 3}0.130{col 54}{space 4}-.5170068{col 67}{space 3} .0666608
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}-.1084223{col 26}{space 2} .1722794{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4}-.4467551{col 67}{space 3} .2299105
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-.8735534{col 26}{space 2} .1484994{col 37}{space 1}   -5.88{col 46}{space 3}0.000{col 54}{space 4}-1.165185{col 67}{space 3}-.5819213
{txt}{space 7}2028  {c |}{col 14}{res}{space 2}-.5199196{col 26}{space 2} .1919876{col 37}{space 1}   -2.71{col 46}{space 3}0.007{col 54}{space 4}-.8969565{col 67}{space 3}-.1428828
{txt}{space 7}2088  {c |}{col 14}{res}{space 2}-.0019522{col 26}{space 2} .1892743{col 37}{space 1}   -0.01{col 46}{space 3}0.992{col 54}{space 4}-.3736606{col 67}{space 3} .3697562
{txt}{space 7}2110  {c |}{col 14}{res}{space 2} -.267933{col 26}{space 2} .1871125{col 37}{space 1}   -1.43{col 46}{space 3}0.153{col 54}{space 4} -.635396{col 67}{space 3} .0995299
{txt}{space 7}2112  {c |}{col 14}{res}{space 2}-.3488307{col 26}{space 2} .2176969{col 37}{space 1}   -1.60{col 46}{space 3}0.110{col 54}{space 4}-.7763571{col 67}{space 3} .0786956
{txt}{space 7}2125  {c |}{col 14}{res}{space 2}-.9945907{col 26}{space 2} .1693937{col 37}{space 1}   -5.87{col 46}{space 3}0.000{col 54}{space 4}-1.327256{col 67}{space 3}-.6619251
{txt}{space 7}2158  {c |}{col 14}{res}{space 2}-.3384302{col 26}{space 2} .1423217{col 37}{space 1}   -2.38{col 46}{space 3}0.018{col 54}{space 4}-.6179301{col 67}{space 3}-.0589303
{txt}{space 7}2160  {c |}{col 14}{res}{space 2} .1681767{col 26}{space 2} .1506758{col 37}{space 1}    1.12{col 46}{space 3}0.265{col 54}{space 4}-.1277295{col 67}{space 3} .4640829
{txt}{space 7}2170  {c |}{col 14}{res}{space 2}-.4636652{col 26}{space 2} .1937949{col 37}{space 1}   -2.39{col 46}{space 3}0.017{col 54}{space 4}-.8442513{col 67}{space 3} -.083079
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .0864443{col 26}{space 2}  .298166{col 37}{space 1}    0.29{col 46}{space 3}0.772{col 54}{space 4}-.4991122{col 67}{space 3} .6720008
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto idfix
{txt}
{com}. reg $yvar_ $xvar_timinv i.personid, vce(robust)
{p 0 6 2}{txt}note: 2112.personid omitted because of collinearity{p_end}
{p 0 6 2}note: 2125.personid omitted because of collinearity{p_end}
{p 0 6 2}note: 2158.personid omitted because of collinearity{p_end}
{p 0 6 2}note: 2160.personid omitted because of collinearity{p_end}
{p 0 6 2}note: 2170.personid omitted because of collinearity{p_end}

Linear regression                               Number of obs     = {res}       712
                                                {txt}{help j_robustsingular:F(93, 612) }       =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.5869
                                                {txt}Root MSE          =    {res} .38267

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ability {c |}{col 14}{res}{space 2} 1.100249{col 26}{space 2}  .787322{col 37}{space 1}    1.40{col 46}{space 3}0.163{col 54}{space 4}-.4459315{col 67}{space 3}  2.64643
{txt}{space 4}mothered {c |}{col 14}{res}{space 2}-.1965905{col 26}{space 2} .0332558{col 37}{space 1}   -5.91{col 46}{space 3}0.000{col 54}{space 4}-.2618998{col 67}{space 3}-.1312811
{txt}{space 4}fathered {c |}{col 14}{res}{space 2} .0278626{col 26}{space 2} .0327124{col 37}{space 1}    0.85{col 46}{space 3}0.395{col 54}{space 4}-.0363796{col 67}{space 3} .0921048
{txt}{space 4}brknhome {c |}{col 14}{res}{space 2} .2019523{col 26}{space 2} .3633724{col 37}{space 1}    0.56{col 46}{space 3}0.579{col 54}{space 4}-.5116559{col 67}{space 3} .9155604
{txt}{space 4}siblings {c |}{col 14}{res}{space 2}-.0842966{col 26}{space 2}  .120871{col 37}{space 1}   -0.70{col 46}{space 3}0.486{col 54}{space 4}-.3216689{col 67}{space 3} .1530757
{txt}{space 12} {c |}
{space 4}personid {c |}
{space 9}48  {c |}{col 14}{res}{space 2} .7975206{col 26}{space 2} .8540498{col 37}{space 1}    0.93{col 46}{space 3}0.351{col 54}{space 4}-.8797032{col 67}{space 3} 2.474745
{txt}{space 9}50  {c |}{col 14}{res}{space 2} .3631778{col 26}{space 2} .5669173{col 37}{space 1}    0.64{col 46}{space 3}0.522{col 54}{space 4}-.7501615{col 67}{space 3} 1.476517
{txt}{space 9}93  {c |}{col 14}{res}{space 2} 1.151682{col 26}{space 2} .6313836{col 37}{space 1}    1.82{col 46}{space 3}0.069{col 54}{space 4}-.0882594{col 67}{space 3} 2.391623
{txt}{space 8}120  {c |}{col 14}{res}{space 2}-.1895299{col 26}{space 2} .5188849{col 37}{space 1}   -0.37{col 46}{space 3}0.715{col 54}{space 4}-1.208541{col 67}{space 3}  .829481
{txt}{space 8}121  {c |}{col 14}{res}{space 2} .1330225{col 26}{space 2} .9231248{col 37}{space 1}    0.14{col 46}{space 3}0.885{col 54}{space 4}-1.679854{col 67}{space 3} 1.945899
{txt}{space 8}146  {c |}{col 14}{res}{space 2}-.0272582{col 26}{space 2} .3302218{col 37}{space 1}   -0.08{col 46}{space 3}0.934{col 54}{space 4}-.6757635{col 67}{space 3}  .621247
{txt}{space 8}164  {c |}{col 14}{res}{space 2} 1.761916{col 26}{space 2} .9614338{col 37}{space 1}    1.83{col 46}{space 3}0.067{col 54}{space 4}-.1261941{col 67}{space 3} 3.650025
{txt}{space 8}168  {c |}{col 14}{res}{space 2} .4131927{col 26}{space 2} .4140561{col 37}{space 1}    1.00{col 46}{space 3}0.319{col 54}{space 4}-.3999504{col 67}{space 3} 1.226336
{txt}{space 8}188  {c |}{col 14}{res}{space 2} .9447424{col 26}{space 2} .6861667{col 37}{space 1}    1.38{col 46}{space 3}0.169{col 54}{space 4}-.4027846{col 67}{space 3} 2.292269
{txt}{space 8}236  {c |}{col 14}{res}{space 2} .3612586{col 26}{space 2} .3486662{col 37}{space 1}    1.04{col 46}{space 3}0.301{col 54}{space 4}-.3234687{col 67}{space 3} 1.045986
{txt}{space 8}241  {c |}{col 14}{res}{space 2} .6855108{col 26}{space 2} .6388105{col 37}{space 1}    1.07{col 46}{space 3}0.284{col 54}{space 4}-.5690157{col 67}{space 3} 1.940037
{txt}{space 8}356  {c |}{col 14}{res}{space 2} 1.439961{col 26}{space 2} .5825111{col 37}{space 1}    2.47{col 46}{space 3}0.014{col 54}{space 4} .2959982{col 67}{space 3} 2.583924
{txt}{space 8}390  {c |}{col 14}{res}{space 2} 2.400056{col 26}{space 2} 1.272185{col 37}{space 1}    1.89{col 46}{space 3}0.060{col 54}{space 4}-.0983211{col 67}{space 3} 4.898433
{txt}{space 8}402  {c |}{col 14}{res}{space 2} .8187752{col 26}{space 2} .3944032{col 37}{space 1}    2.08{col 46}{space 3}0.038{col 54}{space 4} .0442273{col 67}{space 3} 1.593323
{txt}{space 8}500  {c |}{col 14}{res}{space 2} 1.732438{col 26}{space 2} 1.295954{col 37}{space 1}    1.34{col 46}{space 3}0.182{col 54}{space 4}-.8126183{col 67}{space 3} 4.277495
{txt}{space 8}526  {c |}{col 14}{res}{space 2} .3353402{col 26}{space 2} .1367424{col 37}{space 1}    2.45{col 46}{space 3}0.014{col 54}{space 4}  .066799{col 67}{space 3} .6038814
{txt}{space 8}534  {c |}{col 14}{res}{space 2} -1.18715{col 26}{space 2} .7346642{col 37}{space 1}   -1.62{col 46}{space 3}0.107{col 54}{space 4}-2.629919{col 67}{space 3} .2556186
{txt}{space 8}543  {c |}{col 14}{res}{space 2} .6502962{col 26}{space 2} .4102159{col 37}{space 1}    1.59{col 46}{space 3}0.113{col 54}{space 4}-.1553054{col 67}{space 3} 1.455898
{txt}{space 8}556  {c |}{col 14}{res}{space 2}-1.451145{col 26}{space 2} .1228524{col 37}{space 1}  -11.81{col 46}{space 3}0.000{col 54}{space 4}-1.692408{col 67}{space 3}-1.209881
{txt}{space 8}581  {c |}{col 14}{res}{space 2} .7516326{col 26}{space 2} .4491367{col 37}{space 1}    1.67{col 46}{space 3}0.095{col 54}{space 4}-.1304036{col 67}{space 3} 1.633669
{txt}{space 8}589  {c |}{col 14}{res}{space 2} 3.304417{col 26}{space 2} 1.899444{col 37}{space 1}    1.74{col 46}{space 3}0.082{col 54}{space 4}-.4258025{col 67}{space 3} 7.034636
{txt}{space 8}606  {c |}{col 14}{res}{space 2} .7106351{col 26}{space 2} .3558964{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} .0117088{col 67}{space 3} 1.409561
{txt}{space 8}637  {c |}{col 14}{res}{space 2}-1.186256{col 26}{space 2} .8839474{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-2.922194{col 67}{space 3} .5496824
{txt}{space 8}692  {c |}{col 14}{res}{space 2} .7613585{col 26}{space 2} .6084849{col 37}{space 1}    1.25{col 46}{space 3}0.211{col 54}{space 4}-.4336133{col 67}{space 3}  1.95633
{txt}{space 8}704  {c |}{col 14}{res}{space 2} .1115159{col 26}{space 2}  1.56106{col 37}{space 1}    0.07{col 46}{space 3}0.943{col 54}{space 4}-2.954168{col 67}{space 3}   3.1772
{txt}{space 8}727  {c |}{col 14}{res}{space 2} 1.908803{col 26}{space 2} 2.053583{col 37}{space 1}    0.93{col 46}{space 3}0.353{col 54}{space 4}-2.124121{col 67}{space 3} 5.941727
{txt}{space 8}730  {c |}{col 14}{res}{space 2}-.4192559{col 26}{space 2}  .771887{col 37}{space 1}   -0.54{col 46}{space 3}0.587{col 54}{space 4}-1.935125{col 67}{space 3} 1.096613
{txt}{space 8}740  {c |}{col 14}{res}{space 2} 1.519244{col 26}{space 2} .8123584{col 37}{space 1}    1.87{col 46}{space 3}0.062{col 54}{space 4}-.0761042{col 67}{space 3} 3.114592
{txt}{space 8}763  {c |}{col 14}{res}{space 2}-.0614426{col 26}{space 2}  .897677{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-1.824344{col 67}{space 3} 1.701459
{txt}{space 8}785  {c |}{col 14}{res}{space 2}-1.554092{col 26}{space 2} .6097037{col 37}{space 1}   -2.55{col 46}{space 3}0.011{col 54}{space 4}-2.751457{col 67}{space 3}-.3567263
{txt}{space 8}792  {c |}{col 14}{res}{space 2} 1.964503{col 26}{space 2} 1.530593{col 37}{space 1}    1.28{col 46}{space 3}0.200{col 54}{space 4}-1.041349{col 67}{space 3} 4.970355
{txt}{space 8}800  {c |}{col 14}{res}{space 2} 1.303705{col 26}{space 2} .5717917{col 37}{space 1}    2.28{col 46}{space 3}0.023{col 54}{space 4} .1807932{col 67}{space 3} 2.426617
{txt}{space 8}811  {c |}{col 14}{res}{space 2}-1.535632{col 26}{space 2} 1.174615{col 37}{space 1}   -1.31{col 46}{space 3}0.192{col 54}{space 4}-3.842398{col 67}{space 3} .7711337
{txt}{space 8}815  {c |}{col 14}{res}{space 2} 1.679605{col 26}{space 2} 1.029931{col 37}{space 1}    1.63{col 46}{space 3}0.103{col 54}{space 4}-.3430234{col 67}{space 3} 3.702233
{txt}{space 8}822  {c |}{col 14}{res}{space 2}    .7244{col 26}{space 2} .4871838{col 37}{space 1}    1.49{col 46}{space 3}0.138{col 54}{space 4} -.232355{col 67}{space 3} 1.681155
{txt}{space 8}824  {c |}{col 14}{res}{space 2}-.3568663{col 26}{space 2} 1.013801{col 37}{space 1}   -0.35{col 46}{space 3}0.725{col 54}{space 4}-2.347816{col 67}{space 3} 1.634084
{txt}{space 8}850  {c |}{col 14}{res}{space 2} 1.328626{col 26}{space 2} .9477139{col 37}{space 1}    1.40{col 46}{space 3}0.161{col 54}{space 4}-.5325396{col 67}{space 3} 3.189792
{txt}{space 8}989  {c |}{col 14}{res}{space 2} .3714854{col 26}{space 2} .2482655{col 37}{space 1}    1.50{col 46}{space 3}0.135{col 54}{space 4}-.1160703{col 67}{space 3} .8590411
{txt}{space 7}1014  {c |}{col 14}{res}{space 2} .7983275{col 26}{space 2} .5541624{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4}-.2899632{col 67}{space 3} 1.886618
{txt}{space 7}1019  {c |}{col 14}{res}{space 2} .4903177{col 26}{space 2} .3393701{col 37}{space 1}    1.44{col 46}{space 3}0.149{col 54}{space 4}-.1761535{col 67}{space 3} 1.156789
{txt}{space 7}1028  {c |}{col 14}{res}{space 2}  .423807{col 26}{space 2} 1.076538{col 37}{space 1}    0.39{col 46}{space 3}0.694{col 54}{space 4} -1.69035{col 67}{space 3} 2.537964
{txt}{space 7}1041  {c |}{col 14}{res}{space 2} 2.537062{col 26}{space 2} .7731727{col 37}{space 1}    3.28{col 46}{space 3}0.001{col 54}{space 4} 1.018669{col 67}{space 3} 4.055456
{txt}{space 7}1071  {c |}{col 14}{res}{space 2}  2.21704{col 26}{space 2} .8007377{col 37}{space 1}    2.77{col 46}{space 3}0.006{col 54}{space 4} .6445134{col 67}{space 3} 3.789568
{txt}{space 7}1109  {c |}{col 14}{res}{space 2} .9058753{col 26}{space 2} .4423617{col 37}{space 1}    2.05{col 46}{space 3}0.041{col 54}{space 4} .0371442{col 67}{space 3} 1.774606
{txt}{space 7}1114  {c |}{col 14}{res}{space 2} .3609791{col 26}{space 2} .5445317{col 37}{space 1}    0.66{col 46}{space 3}0.508{col 54}{space 4}-.7083982{col 67}{space 3} 1.430356
{txt}{space 7}1128  {c |}{col 14}{res}{space 2} 2.181649{col 26}{space 2} .4159982{col 37}{space 1}    5.24{col 46}{space 3}0.000{col 54}{space 4} 1.364692{col 67}{space 3} 2.998606
{txt}{space 7}1142  {c |}{col 14}{res}{space 2}  1.12964{col 26}{space 2} .3668795{col 37}{space 1}    3.08{col 46}{space 3}0.002{col 54}{space 4} .4091441{col 67}{space 3} 1.850135
{txt}{space 7}1150  {c |}{col 14}{res}{space 2}  .526598{col 26}{space 2} .5009814{col 37}{space 1}    1.05{col 46}{space 3}0.294{col 54}{space 4}-.4572532{col 67}{space 3} 1.510449
{txt}{space 7}1151  {c |}{col 14}{res}{space 2}-.7871042{col 26}{space 2} .2690065{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-1.315392{col 67}{space 3}-.2588165
{txt}{space 7}1192  {c |}{col 14}{res}{space 2}-.0735738{col 26}{space 2} 1.059292{col 37}{space 1}   -0.07{col 46}{space 3}0.945{col 54}{space 4}-2.153863{col 67}{space 3} 2.006715
{txt}{space 7}1220  {c |}{col 14}{res}{space 2}-1.116028{col 26}{space 2} 1.132026{col 37}{space 1}   -0.99{col 46}{space 3}0.325{col 54}{space 4}-3.339154{col 67}{space 3} 1.107098
{txt}{space 7}1224  {c |}{col 14}{res}{space 2}-.6822071{col 26}{space 2} .1928838{col 37}{space 1}   -3.54{col 46}{space 3}0.000{col 54}{space 4}-1.061002{col 67}{space 3}-.3034127
{txt}{space 7}1225  {c |}{col 14}{res}{space 2} 1.082287{col 26}{space 2}  .824039{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.5360006{col 67}{space 3} 2.700574
{txt}{space 7}1263  {c |}{col 14}{res}{space 2} 1.342349{col 26}{space 2} .5873578{col 37}{space 1}    2.29{col 46}{space 3}0.023{col 54}{space 4} .1888672{col 67}{space 3}  2.49583
{txt}{space 7}1273  {c |}{col 14}{res}{space 2} 1.735557{col 26}{space 2} .6594232{col 37}{space 1}    2.63{col 46}{space 3}0.009{col 54}{space 4}   .44055{col 67}{space 3} 3.030564
{txt}{space 7}1309  {c |}{col 14}{res}{space 2} .2718752{col 26}{space 2} .8662814{col 37}{space 1}    0.31{col 46}{space 3}0.754{col 54}{space 4} -1.42937{col 67}{space 3}  1.97312
{txt}{space 7}1314  {c |}{col 14}{res}{space 2}-.2664738{col 26}{space 2} 1.173896{col 37}{space 1}   -0.23{col 46}{space 3}0.820{col 54}{space 4}-2.571827{col 67}{space 3}  2.03888
{txt}{space 7}1315  {c |}{col 14}{res}{space 2} .9340732{col 26}{space 2} .2952838{col 37}{space 1}    3.16{col 46}{space 3}0.002{col 54}{space 4} .3541807{col 67}{space 3} 1.513966
{txt}{space 7}1328  {c |}{col 14}{res}{space 2} 1.731527{col 26}{space 2} 1.138022{col 37}{space 1}    1.52{col 46}{space 3}0.129{col 54}{space 4}-.5033752{col 67}{space 3} 3.966429
{txt}{space 7}1370  {c |}{col 14}{res}{space 2} 1.047585{col 26}{space 2} .3175455{col 37}{space 1}    3.30{col 46}{space 3}0.001{col 54}{space 4} .4239737{col 67}{space 3} 1.671196
{txt}{space 7}1396  {c |}{col 14}{res}{space 2} .4911816{col 26}{space 2} .3122419{col 37}{space 1}    1.57{col 46}{space 3}0.116{col 54}{space 4} -.122014{col 67}{space 3} 1.104377
{txt}{space 7}1417  {c |}{col 14}{res}{space 2} 1.709357{col 26}{space 2} .6973214{col 37}{space 1}    2.45{col 46}{space 3}0.015{col 54}{space 4}  .339924{col 67}{space 3}  3.07879
{txt}{space 7}1448  {c |}{col 14}{res}{space 2} 1.850613{col 26}{space 2} .3465201{col 37}{space 1}    5.34{col 46}{space 3}0.000{col 54}{space 4}   1.1701{col 67}{space 3} 2.531125
{txt}{space 7}1476  {c |}{col 14}{res}{space 2} 1.458563{col 26}{space 2} .3159158{col 37}{space 1}    4.62{col 46}{space 3}0.000{col 54}{space 4} .8381523{col 67}{space 3} 2.078974
{txt}{space 7}1480  {c |}{col 14}{res}{space 2} 1.319906{col 26}{space 2} .6572368{col 37}{space 1}    2.01{col 46}{space 3}0.045{col 54}{space 4} .0291929{col 67}{space 3} 2.610619
{txt}{space 7}1513  {c |}{col 14}{res}{space 2} 1.914988{col 26}{space 2} 1.073392{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.1929894{col 67}{space 3} 4.022966
{txt}{space 7}1528  {c |}{col 14}{res}{space 2} .8818928{col 26}{space 2} .2896214{col 37}{space 1}    3.04{col 46}{space 3}0.002{col 54}{space 4} .3131205{col 67}{space 3} 1.450665
{txt}{space 7}1532  {c |}{col 14}{res}{space 2} 1.659096{col 26}{space 2} 1.766196{col 37}{space 1}    0.94{col 46}{space 3}0.348{col 54}{space 4}-1.809444{col 67}{space 3} 5.127637
{txt}{space 7}1583  {c |}{col 14}{res}{space 2} 1.931763{col 26}{space 2} .4449382{col 37}{space 1}    4.34{col 46}{space 3}0.000{col 54}{space 4} 1.057972{col 67}{space 3} 2.805554
{txt}{space 7}1634  {c |}{col 14}{res}{space 2}-.7849936{col 26}{space 2} 1.010378{col 37}{space 1}   -0.78{col 46}{space 3}0.438{col 54}{space 4}-2.769223{col 67}{space 3} 1.199236
{txt}{space 7}1651  {c |}{col 14}{res}{space 2} 1.192025{col 26}{space 2} .1743397{col 37}{space 1}    6.84{col 46}{space 3}0.000{col 54}{space 4} .8496482{col 67}{space 3} 1.534402
{txt}{space 7}1681  {c |}{col 14}{res}{space 2} .6482256{col 26}{space 2} .4589459{col 37}{space 1}    1.41{col 46}{space 3}0.158{col 54}{space 4}-.2530743{col 67}{space 3} 1.549526
{txt}{space 7}1698  {c |}{col 14}{res}{space 2} .7812585{col 26}{space 2} .7690032{col 37}{space 1}    1.02{col 46}{space 3}0.310{col 54}{space 4}-.7289467{col 67}{space 3} 2.291464
{txt}{space 7}1707  {c |}{col 14}{res}{space 2} 1.198353{col 26}{space 2} .5828854{col 37}{space 1}    2.06{col 46}{space 3}0.040{col 54}{space 4} .0536547{col 67}{space 3} 2.343051
{txt}{space 7}1733  {c |}{col 14}{res}{space 2} .8772761{col 26}{space 2} .9023602{col 37}{space 1}    0.97{col 46}{space 3}0.331{col 54}{space 4} -.894822{col 67}{space 3} 2.649374
{txt}{space 7}1760  {c |}{col 14}{res}{space 2} 1.252857{col 26}{space 2} .4821798{col 37}{space 1}    2.60{col 46}{space 3}0.010{col 54}{space 4} .3059296{col 67}{space 3} 2.199785
{txt}{space 7}1765  {c |}{col 14}{res}{space 2}-1.122879{col 26}{space 2} .9370044{col 37}{space 1}   -1.20{col 46}{space 3}0.231{col 54}{space 4}-2.963013{col 67}{space 3} .7172553
{txt}{space 7}1787  {c |}{col 14}{res}{space 2} .4006141{col 26}{space 2} .3950229{col 37}{space 1}    1.01{col 46}{space 3}0.311{col 54}{space 4}-.3751508{col 67}{space 3} 1.176379
{txt}{space 7}1801  {c |}{col 14}{res}{space 2} 1.223397{col 26}{space 2} .5675897{col 37}{space 1}    2.16{col 46}{space 3}0.032{col 54}{space 4} .1087368{col 67}{space 3} 2.338056
{txt}{space 7}1825  {c |}{col 14}{res}{space 2} 1.361668{col 26}{space 2} .3336103{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4}  .706508{col 67}{space 3} 2.016828
{txt}{space 7}1834  {c |}{col 14}{res}{space 2} .9742128{col 26}{space 2} 1.040574{col 37}{space 1}    0.94{col 46}{space 3}0.350{col 54}{space 4}-1.069317{col 67}{space 3} 3.017742
{txt}{space 7}1851  {c |}{col 14}{res}{space 2}-1.139452{col 26}{space 2} .3437869{col 37}{space 1}   -3.31{col 46}{space 3}0.001{col 54}{space 4}-1.814597{col 67}{space 3}-.4643067
{txt}{space 7}1862  {c |}{col 14}{res}{space 2} .5708676{col 26}{space 2} .2562907{col 37}{space 1}    2.23{col 46}{space 3}0.026{col 54}{space 4} .0675517{col 67}{space 3} 1.074184
{txt}{space 7}1882  {c |}{col 14}{res}{space 2} .4142414{col 26}{space 2} .2874543{col 37}{space 1}    1.44{col 46}{space 3}0.150{col 54}{space 4} -.150275{col 67}{space 3} .9787579
{txt}{space 7}1896  {c |}{col 14}{res}{space 2} 1.062775{col 26}{space 2} .7929698{col 37}{space 1}    1.34{col 46}{space 3}0.181{col 54}{space 4}-.4944965{col 67}{space 3} 2.620048
{txt}{space 7}1899  {c |}{col 14}{res}{space 2} .0700955{col 26}{space 2} .7530017{col 37}{space 1}    0.09{col 46}{space 3}0.926{col 54}{space 4}-1.408685{col 67}{space 3} 1.548876
{txt}{space 7}1924  {c |}{col 14}{res}{space 2} -1.87321{col 26}{space 2} 1.056131{col 37}{space 1}   -1.77{col 46}{space 3}0.077{col 54}{space 4}-3.947291{col 67}{space 3} .2008709
{txt}{space 7}1925  {c |}{col 14}{res}{space 2} .5802016{col 26}{space 2} .2904331{col 37}{space 1}    2.00{col 46}{space 3}0.046{col 54}{space 4} .0098352{col 67}{space 3} 1.150568
{txt}{space 7}1931  {c |}{col 14}{res}{space 2} 1.609915{col 26}{space 2}  1.15493{col 37}{space 1}    1.39{col 46}{space 3}0.164{col 54}{space 4}-.6581907{col 67}{space 3} 3.878022
{txt}{space 7}1997  {c |}{col 14}{res}{space 2}  .407786{col 26}{space 2} .4243249{col 37}{space 1}    0.96{col 46}{space 3}0.337{col 54}{space 4}-.4255236{col 67}{space 3} 1.241096
{txt}{space 7}2014  {c |}{col 14}{res}{space 2}-1.013406{col 26}{space 2} .3461486{col 37}{space 1}   -2.93{col 46}{space 3}0.004{col 54}{space 4}-1.693189{col 67}{space 3}-.3336229
{txt}{space 7}2028  {c |}{col 14}{res}{space 2} 1.684829{col 26}{space 2} .5779203{col 37}{space 1}    2.92{col 46}{space 3}0.004{col 54}{space 4} .5498811{col 67}{space 3} 2.819776
{txt}{space 7}2088  {c |}{col 14}{res}{space 2} .5320516{col 26}{space 2} .3991369{col 37}{space 1}    1.33{col 46}{space 3}0.183{col 54}{space 4}-.2517925{col 67}{space 3} 1.315896
{txt}{space 7}2110  {c |}{col 14}{res}{space 2}-.1175195{col 26}{space 2}  .362882{col 37}{space 1}   -0.32{col 46}{space 3}0.746{col 54}{space 4}-.8301646{col 67}{space 3} .5951255
{txt}{space 7}2112  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}2125  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}2158  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}2160  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 7}2170  {c |}{col 14}{res}{space 2}        0{col 26}{txt}  (omitted)
{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 3.556016{col 26}{space 2} .5050207{col 37}{space 1}    7.04{col 46}{space 3}0.000{col 54}{space 4} 2.564232{col 67}{space 3}   4.5478
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto idfix_timinv
{txt}
{com}. 
. * HW2 summary
. est tab X_Y boot49 boot499, se title(OLS and bootstrape)
{res}
{txt}{p}OLS and bootstrape

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:X_Y} {space 1} {center 10:boot49} {space 1} {center 10:boot499} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:.43835034}{txt} {space 1}{res} {ralign 10:.43835034}{txt} {space 1}{res} {ralign 10:.43835034}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.54743723}{txt} {space 1}{res} {ralign 10:.58697341}{txt} {space 1}{res} {ralign 10:.56666169}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-1.0103868}{txt} {space 1}{res} {ralign 10:-1.0103868}{txt} {space 1}{res} {ralign 10:-1.0103868}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.08909115}{txt} {space 1}{res} {ralign 10:.10057932}{txt} {space 1}{res} {ralign 10:.09150773}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.37314107}{txt} {space 1}{res} {ralign 10:.37314107}{txt} {space 1}{res} {ralign 10:.37314107}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.67303555}{txt} {space 1}{res} {ralign 10:.74072512}{txt} {space 1}{res} {ralign 10:.62863732}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:22.541928}{txt} {space 1}{res} {ralign 10:22.541928}{txt} {space 1}{res} {ralign 10:22.541928}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:1.2817391}{txt} {space 1}{res} {ralign 10:1.4386829}{txt} {space 1}{res} {ralign 10:1.3610506}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 53:legend: b/se}
{res}{txt}
{com}. est tab linear_ probit_ probit_m /*
> */ probit_mdelta probit_mboot logit_ logit_mdelta /*
> */ logit_mboot, se title(Linear, Probit, Logit)
{res}
{txt}{p}Linear, Probit, Logit

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:linear_} {space 1} {center 10:probit_} {space 1} {center 10:probit_m} {space 1} {center 10:probit_m~a} {space 1} {center 10:probit_m~t} {space 1} {center 10:logit_} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:.01874188}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.02669155}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.03834067}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00434384}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.04659131}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.03281539}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.67081067}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.06249412}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Y_dum        {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04497207}{txt} {space 1}{res} {ralign 10:.04497207}{txt} {space 1}{res} {ralign 10:.04497207}{txt} {space 1}{res} {ralign 10:.07525617}{txt} {space 1}{res} {ralign 10:.07525617}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.07120618}{txt} {space 1}{res} {ralign 10:.07120618}{txt} {space 1}{res} {ralign 10:.07120618}{txt} {space 1}{res} {ralign 10:.09060722}{txt} {space 1}{res} {ralign 10:.11528701}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.10744515}{txt} {space 1}{res} {ralign 10:-.10744515}{txt} {space 1}{res} {ralign 10:-.10744515}{txt} {space 1}{res} {ralign 10:-.17363591}{txt} {space 1}{res} {ralign 10:-.17363591}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01280879}{txt} {space 1}{res} {ralign 10:.01280879}{txt} {space 1}{res} {ralign 10:.01280879}{txt} {space 1}{res} {ralign 10:.02168994}{txt} {space 1}{res} {ralign 10:.02137843}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.12439279}{txt} {space 1}{res} {ralign 10:.12439279}{txt} {space 1}{res} {ralign 10:.12439279}{txt} {space 1}{res} {ralign 10:.20079145}{txt} {space 1}{res} {ralign 10:.20079145}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.08770008}{txt} {space 1}{res} {ralign 10:.08770008}{txt} {space 1}{res} {ralign 10:.08770008}{txt} {space 1}{res} {ralign 10:.156628}{txt} {space 1}{res} {ralign 10:.14189878}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.48680797}{txt} {space 1}{res} {ralign 10:.48680797}{txt} {space 1}{res} {ralign 10:.48680797}{txt} {space 1}{res} {ralign 10:.77878889}{txt} {space 1}{res} {ralign 10:.77878889}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.1690792}{txt} {space 1}{res} {ralign 10:.1690792}{txt} {space 1}{res} {ralign 10:.1690792}{txt} {space 1}{res} {ralign 10:.24338472}{txt} {space 1}{res} {ralign 10:.27359913}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 92:legend: b/se}

{res}
{txt}{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:logit_md~a} {space 1} {center 10:logit_mb~t} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Y_dum        {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:.07525617}{txt} {space 1}{res} {ralign 10:.07525617}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11528701}{txt} {space 1}{res} {ralign 10:.10346309}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.17363591}{txt} {space 1}{res} {ralign 10:-.17363591}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.02137843}{txt} {space 1}{res} {ralign 10:.01972537}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.20079145}{txt} {space 1}{res} {ralign 10:.20079145}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14189878}{txt} {space 1}{res} {ralign 10:.14279787}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.77878889}{txt} {space 1}{res} {ralign 10:.77878889}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.27359913}{txt} {space 1}{res} {ralign 10:.25548708}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 40:legend: b/se}
{res}{txt}
{com}. 
. * HW 3summary
. est tab c_logit m_logit mix_logit, se title(Conditional Logit)
{res}
{txt}{p}Conditional Logit

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:c_logit} {space 1} {center 10:m_logit} {space 1} {center 10:mix_logit} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}alt          {txt}{c |}{res}
{txt}{space 7}Price {c |}{res} {ralign 10:-6.6565793}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-6.6596692}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17427926}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.17476978}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00308874}{txt} {space 1}{res} {ralign 10:-.00425993}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00311397}{txt} {space 1}{res} {ralign 10:.00343921}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.95430683}{txt} {space 1}{res} {ralign 10:-.84532415}{txt} {space 1}{res} {ralign 10:-.84067337}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.05004624}{txt} {space 1}{res} {ralign 10:.09313545}{txt} {space 1}{res} {ralign 10:.10384458}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01458623}{txt} {space 1}{res} {ralign 10:.01434397}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00382546}{txt} {space 1}{res} {ralign 10:.00392209}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.2969683}{txt} {space 1}{res} {ralign 10:-2.3998576}{txt} {space 1}{res} {ralign 10:.88860693}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10865147}{txt} {space 1}{res} {ralign 10:.13358016}{txt} {space 1}{res} {ralign 10:.15945855}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00405043}{txt} {space 1}{res} {ralign 10:.00409985}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00309258}{txt} {space 1}{res} {ralign 10:.00320421}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.7173324}{txt} {space 1}{res} {ralign 10:-1.2013265}{txt} {space 1}{res} {ralign 10:-1.8284916}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.05415816}{txt} {space 1}{res} {ralign 10:.0971021}{txt} {space 1}{res} {ralign 10:.10321797}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00125359}{txt} {space 1}{res} {ralign 10:-.00118286}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00420238}{txt} {space 1}{res} {ralign 10:.00429708}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.9040048}{txt} {space 1}{res} {ralign 10:-1.6905817}{txt} {space 1}{res} {ralign 10:-2.8734104}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.07146052}{txt} {space 1}{res} {ralign 10:.12699518}{txt} {space 1}{res} {ralign 10:.13475726}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.03061202}{txt} {space 1}{res} {ralign 10:.02980895}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00467399}{txt} {space 1}{res} {ralign 10:.00472672}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.5153112}{txt} {space 1}{res} {ralign 10:-4.1397672}{txt} {space 1}{res} {ralign 10:-2.4571185}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12623034}{txt} {space 1}{res} {ralign 10:.21098899}{txt} {space 1}{res} {ralign 10:.21542599}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00693258}{txt} {space 1}{res} {ralign 10:-.00924559}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0044161}{txt} {space 1}{res} {ralign 10:.00459348}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.25176838}{txt} {space 1}{res} {ralign 10:-1.5310415}{txt} {space 1}{res} {ralign 10:.49686917}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.07916402}{txt} {space 1}{res} {ralign 10:.12804344}{txt} {space 1}{res} {ralign 10:.14248236}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02288616}{txt} {space 1}{res} {ralign 10:.02199646}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00362167}{txt} {space 1}{res} {ralign 10:.00382029}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.4648684}{txt} {space 1}{res} {ralign 10:-2.8483523}{txt} {space 1}{res} {ralign 10:.80306}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1180467}{txt} {space 1}{res} {ralign 10:.13938482}{txt} {space 1}{res} {ralign 10:.17091994}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01774297}{txt} {space 1}{res} {ralign 10:.01699109}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0037623}{txt} {space 1}{res} {ralign 10:.0039155}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.3575051}{txt} {space 1}{res} {ralign 10:-2.5755973}{txt} {space 1}{res} {ralign 10:1.8641255}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13377396}{txt} {space 1}{res} {ralign 10:.13614002}{txt} {space 1}{res} {ralign 10:.1799469}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}10           {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01079092}{txt} {space 1}{res} {ralign 10:.00875958}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01013005}{txt} {space 1}{res} {ralign 10:.01030074}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-3.8965935}{txt} {space 1}{res} {ralign 10:-4.2822699}{txt} {space 1}{res} {ralign 10:-4.1423856}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17741899}{txt} {space 1}{res} {ralign 10:.34579197}{txt} {space 1}{res} {ralign 10:.35065634}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 53:legend: b/se}
{res}{txt}
{com}. 
. * HW4 Summary
. est tab re be fe fd, se title(Panel Methods)
{res}
{txt}{p}Panel Methods

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:re} {space 1} {center 10:be} {space 1} {center 10:fe} {space 1} {center 10:fd} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.10793802}{txt} {space 1}{res} {ralign 10:.09309987}{txt} {space 1}{res} {ralign 10:.12366202}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00338321}{txt} {space 1}{res} {ralign 10:.00466849}{txt} {space 1}{res} {ralign 10:.00576187}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.03876449}{txt} {space 1}{res} {ralign 10:.02599874}{txt} {space 1}{res} {ralign 10:.03856107}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00071784}{txt} {space 1}{res} {ralign 10:.00360489}{txt} {space 1}{res} {ralign 10:.00075848}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 6}educ_D {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04310838}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01517918}{txt} {space 1}
{res}{txt}{space 2}potexper_D {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.05353695}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00292212}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.56352057}{txt} {space 1}{res} {ralign 10:.84556882}{txt} {space 1}{res} {ralign 10:.40680158}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.0438846}{txt} {space 1}{res} {ralign 10:.07701791}{txt} {space 1}{res} {ralign 10:.0717348}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 66:legend: b/se}
{res}{txt}
{com}. est tab idfix idfix_timinv, se title(Individual Fixed effect w/ robust se)
{res}
{txt}{p}Individual Fixed effect w/ robust se

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:idfix} {space 1} {center 10:idfix_ti~v} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.16630236}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.0231062}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.04117206}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00402431}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 4}personid {c |}
{space 9}48  {c |}{res} {ralign 10:-.51528792}{txt} {space 1}{res} {ralign 10:.79752064}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14958948}{txt} {space 1}{res} {ralign 10:.85404982}{txt} {space 1}
{res}{txt}{space 9}50  {c |}{res} {ralign 10:-.26138661}{txt} {space 1}{res} {ralign 10:.36317776}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19420939}{txt} {space 1}{res} {ralign 10:.5669173}{txt} {space 1}
{res}{txt}{space 9}93  {c |}{res} {ralign 10:.21585578}{txt} {space 1}{res} {ralign 10:1.1516819}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18438503}{txt} {space 1}{res} {ralign 10:.63138361}{txt} {space 1}
{res}{txt}{space 8}120  {c |}{res} {ralign 10:.09996109}{txt} {space 1}{res} {ralign 10:-.18952993}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13684731}{txt} {space 1}{res} {ralign 10:.51888487}{txt} {space 1}
{res}{txt}{space 8}121  {c |}{res} {ralign 10:.26257245}{txt} {space 1}{res} {ralign 10:.13302252}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14927345}{txt} {space 1}{res} {ralign 10:.92312475}{txt} {space 1}
{res}{txt}{space 8}146  {c |}{res} {ralign 10:-.4464182}{txt} {space 1}{res} {ralign 10:-.02725822}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15044317}{txt} {space 1}{res} {ralign 10:.33022175}{txt} {space 1}
{res}{txt}{space 8}164  {c |}{res} {ralign 10:-.32725685}{txt} {space 1}{res} {ralign 10:1.7619156}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14615113}{txt} {space 1}{res} {ralign 10:.96143383}{txt} {space 1}
{res}{txt}{space 8}168  {c |}{res} {ralign 10:.23869492}{txt} {space 1}{res} {ralign 10:.41319268}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1450832}{txt} {space 1}{res} {ralign 10:.41405607}{txt} {space 1}
{res}{txt}{space 8}188  {c |}{res} {ralign 10:-.91101497}{txt} {space 1}{res} {ralign 10:.94474242}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20150266}{txt} {space 1}{res} {ralign 10:.68616671}{txt} {space 1}
{res}{txt}{space 8}236  {c |}{res} {ralign 10:-.43233367}{txt} {space 1}{res} {ralign 10:.36125863}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13496714}{txt} {space 1}{res} {ralign 10:.34866618}{txt} {space 1}
{res}{txt}{space 8}241  {c |}{res} {ralign 10:-1.2313245}{txt} {space 1}{res} {ralign 10:.68551085}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.22188571}{txt} {space 1}{res} {ralign 10:.63881049}{txt} {space 1}
{res}{txt}{space 8}356  {c |}{res} {ralign 10:-.04979329}{txt} {space 1}{res} {ralign 10:1.4399613}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13449664}{txt} {space 1}{res} {ralign 10:.58251108}{txt} {space 1}
{res}{txt}{space 8}390  {c |}{res} {ralign 10:.25365498}{txt} {space 1}{res} {ralign 10:2.4000559}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17421623}{txt} {space 1}{res} {ralign 10:1.2721847}{txt} {space 1}
{res}{txt}{space 8}402  {c |}{res} {ralign 10:-.29154702}{txt} {space 1}{res} {ralign 10:.81877517}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15207882}{txt} {space 1}{res} {ralign 10:.3944032}{txt} {space 1}
{res}{txt}{space 8}500  {c |}{res} {ralign 10:-.1805769}{txt} {space 1}{res} {ralign 10:1.7324385}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16886864}{txt} {space 1}{res} {ralign 10:1.2959542}{txt} {space 1}
{res}{txt}{space 8}526  {c |}{res} {ralign 10:.16678339}{txt} {space 1}{res} {ralign 10:.33534022}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13092102}{txt} {space 1}{res} {ralign 10:.13674236}{txt} {space 1}
{res}{txt}{space 8}534  {c |}{res} {ralign 10:-.75724094}{txt} {space 1}{res} {ralign 10:-1.18715}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1941764}{txt} {space 1}{res} {ralign 10:.73466416}{txt} {space 1}
{res}{txt}{space 8}543  {c |}{res} {ralign 10:-.35303518}{txt} {space 1}{res} {ralign 10:.65029621}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12972673}{txt} {space 1}{res} {ralign 10:.41021589}{txt} {space 1}
{res}{txt}{space 8}556  {c |}{res} {ralign 10:-1.9996536}{txt} {space 1}{res} {ralign 10:-1.4511449}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12536979}{txt} {space 1}{res} {ralign 10:.12285242}{txt} {space 1}
{res}{txt}{space 8}581  {c |}{res} {ralign 10:-.5051732}{txt} {space 1}{res} {ralign 10:.75163262}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.23590352}{txt} {space 1}{res} {ralign 10:.44913673}{txt} {space 1}
{res}{txt}{space 8}589  {c |}{res} {ralign 10:-.87366298}{txt} {space 1}{res} {ralign 10:3.3044168}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.25130367}{txt} {space 1}{res} {ralign 10:1.8994442}{txt} {space 1}
{res}{txt}{space 8}606  {c |}{res} {ralign 10:.05584385}{txt} {space 1}{res} {ralign 10:.71063511}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13525565}{txt} {space 1}{res} {ralign 10:.35589639}{txt} {space 1}
{res}{txt}{space 8}637  {c |}{res} {ralign 10:-.42868889}{txt} {space 1}{res} {ralign 10:-1.1862558}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19211939}{txt} {space 1}{res} {ralign 10:.88394742}{txt} {space 1}
{res}{txt}{space 8}692  {c |}{res} {ralign 10:-.67755161}{txt} {space 1}{res} {ralign 10:.76135847}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16570447}{txt} {space 1}{res} {ralign 10:.6084849}{txt} {space 1}
{res}{txt}{space 8}704  {c |}{res} {ralign 10:-.21540742}{txt} {space 1}{res} {ralign 10:.11151594}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19352061}{txt} {space 1}{res} {ralign 10:1.5610601}{txt} {space 1}
{res}{txt}{space 8}727  {c |}{res} {ralign 10:-.4662274}{txt} {space 1}{res} {ralign 10:1.9088032}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.23765519}{txt} {space 1}{res} {ralign 10:2.0535828}{txt} {space 1}
{res}{txt}{space 8}730  {c |}{res} {ralign 10:-1.6715792}{txt} {space 1}{res} {ralign 10:-.41925589}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21900149}{txt} {space 1}{res} {ralign 10:.77188704}{txt} {space 1}
{res}{txt}{space 8}740  {c |}{res} {ralign 10:-.23785006}{txt} {space 1}{res} {ralign 10:1.5192441}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14188078}{txt} {space 1}{res} {ralign 10:.81235843}{txt} {space 1}
{res}{txt}{space 8}763  {c |}{res} {ralign 10:-.28058889}{txt} {space 1}{res} {ralign 10:-.06144256}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20491239}{txt} {space 1}{res} {ralign 10:.89767705}{txt} {space 1}
{res}{txt}{space 8}785  {c |}{res} {ralign 10:-1.0378363}{txt} {space 1}{res} {ralign 10:-1.5540916}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18141187}{txt} {space 1}{res} {ralign 10:.60970369}{txt} {space 1}
{res}{txt}{space 8}792  {c |}{res} {ralign 10:-.41315397}{txt} {space 1}{res} {ralign 10:1.9645028}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21509124}{txt} {space 1}{res} {ralign 10:1.5305932}{txt} {space 1}
{res}{txt}{space 8}800  {c |}{res} {ralign 10:-.15213309}{txt} {space 1}{res} {ralign 10:1.303705}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15851279}{txt} {space 1}{res} {ralign 10:.5717917}{txt} {space 1}
{res}{txt}{space 8}811  {c |}{res} {ralign 10:-1.144719}{txt} {space 1}{res} {ralign 10:-1.5356322}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.29281377}{txt} {space 1}{res} {ralign 10:1.1746155}{txt} {space 1}
{res}{txt}{space 8}815  {c |}{res} {ralign 10:-1.1170489}{txt} {space 1}{res} {ralign 10:1.6796046}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13419476}{txt} {space 1}{res} {ralign 10:1.0299311}{txt} {space 1}
{res}{txt}{space 8}822  {c |}{res} {ralign 10:-.6511561}{txt} {space 1}{res} {ralign 10:.72439996}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.43751485}{txt} {space 1}{res} {ralign 10:.48718385}{txt} {space 1}
{res}{txt}{space 8}824  {c |}{res} {ralign 10:-.54332392}{txt} {space 1}{res} {ralign 10:-.35686631}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.24669752}{txt} {space 1}{res} {ralign 10:1.0138006}{txt} {space 1}
{res}{txt}{space 8}850  {c |}{res} {ralign 10:-.30174215}{txt} {space 1}{res} {ralign 10:1.3286261}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15844307}{txt} {space 1}{res} {ralign 10:.94771386}{txt} {space 1}
{res}{txt}{space 8}989  {c |}{res} {ralign 10:-.44320727}{txt} {space 1}{res} {ralign 10:.37148543}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18567864}{txt} {space 1}{res} {ralign 10:.24826552}{txt} {space 1}
{res}{txt}{space 7}1014  {c |}{res} {ralign 10:-.18815324}{txt} {space 1}{res} {ralign 10:.79832747}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.189344}{txt} {space 1}{res} {ralign 10:.55416243}{txt} {space 1}
{res}{txt}{space 7}1019  {c |}{res} {ralign 10:-.86186626}{txt} {space 1}{res} {ralign 10:.49031774}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.30011896}{txt} {space 1}{res} {ralign 10:.33937011}{txt} {space 1}
{res}{txt}{space 7}1028  {c |}{res} {ralign 10:-.20555871}{txt} {space 1}{res} {ralign 10:.42380696}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15675852}{txt} {space 1}{res} {ralign 10:1.076538}{txt} {space 1}
{res}{txt}{space 7}1041  {c |}{res} {ralign 10:.1029784}{txt} {space 1}{res} {ralign 10:2.5370625}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14329235}{txt} {space 1}{res} {ralign 10:.77317269}{txt} {space 1}
{res}{txt}{space 7}1071  {c |}{res} {ralign 10:.42111668}{txt} {space 1}{res} {ralign 10:2.2170405}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.26775938}{txt} {space 1}{res} {ralign 10:.80073774}{txt} {space 1}
{res}{txt}{space 7}1109  {c |}{res} {ralign 10:.22539527}{txt} {space 1}{res} {ralign 10:.90587532}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14194524}{txt} {space 1}{res} {ralign 10:.44236173}{txt} {space 1}
{res}{txt}{space 7}1114  {c |}{res} {ralign 10:-1.2687933}{txt} {space 1}{res} {ralign 10:.36097909}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21068866}{txt} {space 1}{res} {ralign 10:.54453165}{txt} {space 1}
{res}{txt}{space 7}1128  {c |}{res} {ralign 10:.77256585}{txt} {space 1}{res} {ralign 10:2.1816492}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.24481698}{txt} {space 1}{res} {ralign 10:.41599818}{txt} {space 1}
{res}{txt}{space 7}1142  {c |}{res} {ralign 10:.22151169}{txt} {space 1}{res} {ralign 10:1.1296396}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14454266}{txt} {space 1}{res} {ralign 10:.36687951}{txt} {space 1}
{res}{txt}{space 7}1150  {c |}{res} {ralign 10:-.30410505}{txt} {space 1}{res} {ralign 10:.52659805}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18250094}{txt} {space 1}{res} {ralign 10:.50098143}{txt} {space 1}
{res}{txt}{space 7}1151  {c |}{res} {ralign 10:-.9837671}{txt} {space 1}{res} {ralign 10:-.78710423}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.24987517}{txt} {space 1}{res} {ralign 10:.26900647}{txt} {space 1}
{res}{txt}{space 7}1192  {c |}{res} {ralign 10:-.23899467}{txt} {space 1}{res} {ralign 10:-.07357375}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19269701}{txt} {space 1}{res} {ralign 10:1.0592923}{txt} {space 1}
{res}{txt}{space 7}1220  {c |}{res} {ralign 10:-.38323771}{txt} {space 1}{res} {ralign 10:-1.1160279}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17069254}{txt} {space 1}{res} {ralign 10:1.1320256}{txt} {space 1}
{res}{txt}{space 7}1224  {c |}{res} {ralign 10:-.76028744}{txt} {space 1}{res} {ralign 10:-.6822071}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16869861}{txt} {space 1}{res} {ralign 10:.19288379}{txt} {space 1}
{res}{txt}{space 7}1225  {c |}{res} {ralign 10:-1.1358509}{txt} {space 1}{res} {ralign 10:1.0822865}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.29615515}{txt} {space 1}{res} {ralign 10:.82403896}{txt} {space 1}
{res}{txt}{space 7}1263  {c |}{res} {ralign 10:-.2821304}{txt} {space 1}{res} {ralign 10:1.3423485}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1962259}{txt} {space 1}{res} {ralign 10:.58735779}{txt} {space 1}
{res}{txt}{space 7}1273  {c |}{res} {ralign 10:-.43401058}{txt} {space 1}{res} {ralign 10:1.7355568}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15078595}{txt} {space 1}{res} {ralign 10:.65942319}{txt} {space 1}
{res}{txt}{space 7}1309  {c |}{res} {ralign 10:.40004026}{txt} {space 1}{res} {ralign 10:.27187515}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17032297}{txt} {space 1}{res} {ralign 10:.8662814}{txt} {space 1}
{res}{txt}{space 7}1314  {c |}{res} {ralign 10:-.23850449}{txt} {space 1}{res} {ralign 10:-.26647379}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1547253}{txt} {space 1}{res} {ralign 10:1.1738962}{txt} {space 1}
{res}{txt}{space 7}1315  {c |}{res} {ralign 10:-.11227024}{txt} {space 1}{res} {ralign 10:.93407324}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14769574}{txt} {space 1}{res} {ralign 10:.29528383}{txt} {space 1}
{res}{txt}{space 7}1328  {c |}{res} {ralign 10:-.09442181}{txt} {space 1}{res} {ralign 10:1.7315268}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1394656}{txt} {space 1}{res} {ralign 10:1.138022}{txt} {space 1}
{res}{txt}{space 7}1370  {c |}{res} {ralign 10:.12429275}{txt} {space 1}{res} {ralign 10:1.0475847}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13016801}{txt} {space 1}{res} {ralign 10:.31754547}{txt} {space 1}
{res}{txt}{space 7}1396  {c |}{res} {ralign 10:-.55954706}{txt} {space 1}{res} {ralign 10:.49118156}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13745719}{txt} {space 1}{res} {ralign 10:.31224192}{txt} {space 1}
{res}{txt}{space 7}1417  {c |}{res} {ralign 10:.40715991}{txt} {space 1}{res} {ralign 10:1.709357}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17562475}{txt} {space 1}{res} {ralign 10:.69732137}{txt} {space 1}
{res}{txt}{space 7}1448  {c |}{res} {ralign 10:.39120675}{txt} {space 1}{res} {ralign 10:1.8506128}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20877657}{txt} {space 1}{res} {ralign 10:.34652009}{txt} {space 1}
{res}{txt}{space 7}1476  {c |}{res} {ralign 10:.25270428}{txt} {space 1}{res} {ralign 10:1.458563}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.25717836}{txt} {space 1}{res} {ralign 10:.31591583}{txt} {space 1}
{res}{txt}{space 7}1480  {c |}{res} {ralign 10:-.2319872}{txt} {space 1}{res} {ralign 10:1.3199059}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15721059}{txt} {space 1}{res} {ralign 10:.65723676}{txt} {space 1}
{res}{txt}{space 7}1513  {c |}{res} {ralign 10:-.17131349}{txt} {space 1}{res} {ralign 10:1.9149884}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13181685}{txt} {space 1}{res} {ralign 10:1.0733916}{txt} {space 1}
{res}{txt}{space 7}1528  {c |}{res} {ralign 10:-.86476394}{txt} {space 1}{res} {ralign 10:.88189279}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.2103268}{txt} {space 1}{res} {ralign 10:.28962136}{txt} {space 1}
{res}{txt}{space 7}1532  {c |}{res} {ralign 10:-.55797759}{txt} {space 1}{res} {ralign 10:1.6590965}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14823161}{txt} {space 1}{res} {ralign 10:1.7661961}{txt} {space 1}
{res}{txt}{space 7}1583  {c |}{res} {ralign 10:.56927785}{txt} {space 1}{res} {ralign 10:1.9317633}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13616136}{txt} {space 1}{res} {ralign 10:.44493823}{txt} {space 1}
{res}{txt}{space 7}1634  {c |}{res} {ralign 10:-.63202605}{txt} {space 1}{res} {ralign 10:-.78499356}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21083541}{txt} {space 1}{res} {ralign 10:1.0103784}{txt} {space 1}
{res}{txt}{space 7}1651  {c |}{res} {ralign 10:.31543309}{txt} {space 1}{res} {ralign 10:1.192025}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13967978}{txt} {space 1}{res} {ralign 10:.17433974}{txt} {space 1}
{res}{txt}{space 7}1681  {c |}{res} {ralign 10:-.45607899}{txt} {space 1}{res} {ralign 10:.6482256}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.4440013}{txt} {space 1}{res} {ralign 10:.45894591}{txt} {space 1}
{res}{txt}{space 7}1698  {c |}{res} {ralign 10:-.9789236}{txt} {space 1}{res} {ralign 10:.78125852}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12869548}{txt} {space 1}{res} {ralign 10:.76900319}{txt} {space 1}
{res}{txt}{space 7}1707  {c |}{res} {ralign 10:.18443615}{txt} {space 1}{res} {ralign 10:1.1983529}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14816988}{txt} {space 1}{res} {ralign 10:.58288538}{txt} {space 1}
{res}{txt}{space 7}1733  {c |}{res} {ralign 10:-.61300438}{txt} {space 1}{res} {ralign 10:.8772761}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17825061}{txt} {space 1}{res} {ralign 10:.90236019}{txt} {space 1}
{res}{txt}{space 7}1760  {c |}{res} {ralign 10:.30737877}{txt} {space 1}{res} {ralign 10:1.2528573}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13966891}{txt} {space 1}{res} {ralign 10:.48217978}{txt} {space 1}
{res}{txt}{space 7}1765  {c |}{res} {ralign 10:-.07328397}{txt} {space 1}{res} {ralign 10:-1.1228787}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14916527}{txt} {space 1}{res} {ralign 10:.93700439}{txt} {space 1}
{res}{txt}{space 7}1787  {c |}{res} {ralign 10:-.74670979}{txt} {space 1}{res} {ralign 10:.40061408}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.33800927}{txt} {space 1}{res} {ralign 10:.39502291}{txt} {space 1}
{res}{txt}{space 7}1801  {c |}{res} {ralign 10:.10804276}{txt} {space 1}{res} {ralign 10:1.2233965}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13870543}{txt} {space 1}{res} {ralign 10:.56758967}{txt} {space 1}
{res}{txt}{space 7}1825  {c |}{res} {ralign 10:-.05875945}{txt} {space 1}{res} {ralign 10:1.361668}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13405947}{txt} {space 1}{res} {ralign 10:.33361035}{txt} {space 1}
{res}{txt}{space 7}1834  {c |}{res} {ralign 10:-.01501732}{txt} {space 1}{res} {ralign 10:.97421285}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14483636}{txt} {space 1}{res} {ralign 10:1.0405743}{txt} {space 1}
{res}{txt}{space 7}1851  {c |}{res} {ralign 10:-.34070726}{txt} {space 1}{res} {ralign 10:-1.1394518}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13253475}{txt} {space 1}{res} {ralign 10:.3437869}{txt} {space 1}
{res}{txt}{space 7}1862  {c |}{res} {ralign 10:-.34178708}{txt} {space 1}{res} {ralign 10:.5708676}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16209526}{txt} {space 1}{res} {ralign 10:.2562907}{txt} {space 1}
{res}{txt}{space 7}1882  {c |}{res} {ralign 10:-.26415299}{txt} {space 1}{res} {ralign 10:.41424144}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14521634}{txt} {space 1}{res} {ralign 10:.28745427}{txt} {space 1}
{res}{txt}{space 7}1896  {c |}{res} {ralign 10:-1.0041237}{txt} {space 1}{res} {ralign 10:1.0627755}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18828959}{txt} {space 1}{res} {ralign 10:.79296982}{txt} {space 1}
{res}{txt}{space 7}1899  {c |}{res} {ralign 10:-.8030647}{txt} {space 1}{res} {ralign 10:.07009554}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17256712}{txt} {space 1}{res} {ralign 10:.75300167}{txt} {space 1}
{res}{txt}{space 7}1924  {c |}{res} {ralign 10:-1.4603818}{txt} {space 1}{res} {ralign 10:-1.8732101}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.35213111}{txt} {space 1}{res} {ralign 10:1.0561312}{txt} {space 1}
{res}{txt}{space 7}1925  {c |}{res} {ralign 10:-.37456601}{txt} {space 1}{res} {ralign 10:.58020164}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1876026}{txt} {space 1}{res} {ralign 10:.29043313}{txt} {space 1}
{res}{txt}{space 7}1931  {c |}{res} {ralign 10:-.22517297}{txt} {space 1}{res} {ralign 10:1.6099155}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1486021}{txt} {space 1}{res} {ralign 10:1.1549297}{txt} {space 1}
{res}{txt}{space 7}1997  {c |}{res} {ralign 10:-.10842229}{txt} {space 1}{res} {ralign 10:.40778597}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17227944}{txt} {space 1}{res} {ralign 10:.42432495}{txt} {space 1}
{res}{txt}{space 7}2014  {c |}{res} {ralign 10:-.87355338}{txt} {space 1}{res} {ralign 10:-1.013406}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14849939}{txt} {space 1}{res} {ralign 10:.34614855}{txt} {space 1}
{res}{txt}{space 7}2028  {c |}{res} {ralign 10:-.51991963}{txt} {space 1}{res} {ralign 10:1.6848286}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1919876}{txt} {space 1}{res} {ralign 10:.57792029}{txt} {space 1}
{res}{txt}{space 7}2088  {c |}{res} {ralign 10:-.0019522}{txt} {space 1}{res} {ralign 10:.5320516}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18927435}{txt} {space 1}{res} {ralign 10:.39913691}{txt} {space 1}
{res}{txt}{space 7}2110  {c |}{res} {ralign 10:-.26793301}{txt} {space 1}{res} {ralign 10:-.11751951}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18711254}{txt} {space 1}{res} {ralign 10:.36288202}{txt} {space 1}
{res}{txt}{space 7}2112  {c |}{res} {ralign 10:-.34883073}{txt} {space 1}{res} {ralign 10:(omitted)}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.2176969}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2125  {c |}{res} {ralign 10:-.99459068}{txt} {space 1}{res} {ralign 10:(omitted)}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1693937}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2158  {c |}{res} {ralign 10:-.33843023}{txt} {space 1}{res} {ralign 10:(omitted)}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14232167}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2160  {c |}{res} {ralign 10:.16817673}{txt} {space 1}{res} {ralign 10:(omitted)}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15067577}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2170  {c |}{res} {ralign 10:-.46366515}{txt} {space 1}{res} {ralign 10:(omitted)}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1937949}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 5}ability {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:1.1002491}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.787322}{txt} {space 1}
{res}{txt}{space 4}mothered {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.19659046}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0332558}{txt} {space 1}
{res}{txt}{space 4}fathered {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02786264}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.03271241}{txt} {space 1}
{res}{txt}{space 4}brknhome {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.20195226}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.36337244}{txt} {space 1}
{res}{txt}{space 4}siblings {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.08429659}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.12087101}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.0864443}{txt} {space 1}{res} {ralign 10:3.5560158}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.29816604}{txt} {space 1}{res} {ralign 10:.5050207}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 40:legend: b/se}
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output\HW5.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}11 Apr 2019, 23:24:08
{txt}{.-}
{smcl}
{txt}{sf}{ul off}