{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output\HW5.smcl
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Apr 2019, 13:26:58

{com}. do "C:\Users\jiere\AppData\Local\Temp\STD2b4c_000000.tmp"
{txt}
{com}. clear all
{res}{txt}
{com}. set more off, perm
{txt}({cmd:set more} preference recorded)

{com}. set scrollbufsize 2000000
{txt}({cmd:set scrollbufsize} will take effect the next time you launch Stata)

{com}. cd "C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output"
{res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output
{txt}
{com}. pwd
{res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output
{txt}
{com}. 
. ********
. * HW 2 *
. ********
. * Exercise 1: Data generation
. set seed 613
{txt}
{com}. set obs 1000 
{txt}{p}
number of observations (_N)  was 0,
now 1,000
{p_end}

{com}. gen X1 = runiform(1,3)
{txt}
{com}. gen X2 = rgamma(3,2)
{txt}
{com}. gen X3 = rbinomial(1,0.3)
{txt}
{com}. gen eps = rnormal(2,1)
{txt}
{com}. gen Y = 0.5 + 1.2*X1 - 0.9*X2 + 0.1*100*eps
{txt}
{com}. egen Y_mean = mean(Y)
{txt}
{com}. gen Y_dum = (Y>Y_mean)
{txt}
{com}. 
. * Exercise 2
. cor Y X1
{txt}(obs=1,000)

             {c |}        Y       X1
{hline 13}{c +}{hline 18}
           Y {c |}{res}   1.0000
          {txt}X1 {c |}{res}   0.0227   1.0000

{txt}
{com}. 
. reg Y X1 X2 X3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,000
{txt}{hline 13}{c +}{hline 34}   F(3, 996)       = {res}    43.08
{txt}       Model {c |} {res} 12634.4282         3  4211.47608   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 97377.2777       996  97.7683511   {txt}R-squared       ={res}    0.1148
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.1122
{txt}       Total {c |} {res} 110011.706       999  110.121828   {txt}Root MSE        =   {res} 9.8878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4383503{col 26}{space 2} .5474372{col 37}{space 1}    0.80{col 46}{space 3}0.423{col 54}{space 4}-.6359123{col 67}{space 3} 1.512613
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.010387{col 26}{space 2} .0890912{col 37}{space 1}  -11.34{col 46}{space 3}0.000{col 54}{space 4}-1.185215{col 67}{space 3}-.8355589
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .3731411{col 26}{space 2} .6730355{col 37}{space 1}    0.55{col 46}{space 3}0.579{col 54}{space 4}-.9475893{col 67}{space 3} 1.693871
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.54193{col 26}{space 2} 1.281739{col 37}{space 1}   17.59{col 46}{space 3}0.000{col 54}{space 4} 20.02671{col 67}{space 3} 25.05715
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto X_Y
{txt}
{com}. 
. * bootstraping
. bootstrap, size(1000) reps(49): reg Y X1 X2 X3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}49{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}Replications{col 67}= {res}        49
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}    114.36
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.1148
{txt}{col 49}Adj R-squared{col 67}= {res}    0.1122
{txt}{col 49}Root MSE{col 67}= {res}    9.8878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4383503{col 26}{space 2} .5869734{col 37}{space 1}    0.75{col 46}{space 3}0.455{col 54}{space 4}-.7120964{col 67}{space 3} 1.588797
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.010387{col 26}{space 2} .1005793{col 37}{space 1}  -10.05{col 46}{space 3}0.000{col 54}{space 4}-1.207519{col 67}{space 3}-.8132549
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .3731411{col 26}{space 2} .7407251{col 37}{space 1}    0.50{col 46}{space 3}0.614{col 54}{space 4}-1.078653{col 67}{space 3} 1.824936
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.54193{col 26}{space 2} 1.438683{col 37}{space 1}   15.67{col 46}{space 3}0.000{col 54}{space 4} 19.72216{col 67}{space 3} 25.36169
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto boot49
{txt}
{com}. 
. bootstrap, size(1000) reps(499): reg Y X1 X2 X3
{txt}(running regress on estimation sample)
{res}
{txt}Bootstrap replications ({res}499{txt})
{hline 4}{c +}{hline 3} 1 {hline 3}{c +}{hline 3} 2 {hline 3}{c +}{hline 3} 3 {hline 3}{c +}{hline 3} 4 {hline 3}{c +}{hline 3} 5 
..................................................    50
..................................................   100
..................................................   150
..................................................   200
..................................................   250
..................................................   300
..................................................   350
..................................................   400
..................................................   450
.................................................
{res}
{txt}Linear regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}Replications{col 67}= {res}       499
{txt}{col 49}Wald chi2({res}3{txt}){col 67}= {res}    124.16
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}{col 49}R-squared{col 67}= {res}    0.1148
{txt}{col 49}Adj R-squared{col 67}= {res}    0.1122
{txt}{col 49}Root MSE{col 67}= {res}    9.8878

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}   Observed{col 26}   Bootstrap{col 54}         Norm{col 67}al-based
{col 1}           Y{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .4383503{col 26}{space 2} .5666617{col 37}{space 1}    0.77{col 46}{space 3}0.439{col 54}{space 4}-.6722862{col 67}{space 3} 1.548987
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-1.010387{col 26}{space 2} .0915077{col 37}{space 1}  -11.04{col 46}{space 3}0.000{col 54}{space 4}-1.189739{col 67}{space 3}-.8310349
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .3731411{col 26}{space 2} .6286373{col 37}{space 1}    0.59{col 46}{space 3}0.553{col 54}{space 4}-.8589654{col 67}{space 3} 1.605248
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 22.54193{col 26}{space 2} 1.361051{col 37}{space 1}   16.56{col 46}{space 3}0.000{col 54}{space 4} 19.87432{col 67}{space 3} 25.20954
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto boot499
{txt}
{com}. 
. * Exercise 3
. * probit model
. probit Y_dum X1 X2 X3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-693.14718}  
Iteration 1:{space 3}log likelihood = {res:-653.59547}  
Iteration 2:{space 3}log likelihood = {res:-653.55831}  
Iteration 3:{space 3}log likelihood = {res:-653.55831}  
{res}
{txt}Probit regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}     79.18
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-653.55831{txt}{col 49}Pseudo R2{col 67}= {res}    0.0571

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0449721{col 26}{space 2} .0712062{col 37}{space 1}    0.63{col 46}{space 3}0.528{col 54}{space 4}-.0945895{col 67}{space 3} .1845336
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1074452{col 26}{space 2} .0128088{col 37}{space 1}   -8.39{col 46}{space 3}0.000{col 54}{space 4}-.1325499{col 67}{space 3}-.0823404
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .1243928{col 26}{space 2} .0877001{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0474962{col 67}{space 3} .2962818
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}  .486808{col 26}{space 2} .1690792{col 37}{space 1}    2.88{col 46}{space 3}0.004{col 54}{space 4} .1554188{col 67}{space 3} .8181971
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto probit_
{txt}
{com}. 
. margins, dydx(*)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     1,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(Y_dum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0168296{col 26}{space 2} .0266319{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.0353679{col 67}{space 3} .0690271
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0402084{col 26}{space 2} .0042561{col 37}{space 1}   -9.45{col 46}{space 3}0.000{col 54}{space 4}-.0485503{col 67}{space 3}-.0318666
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0465506{col 26}{space 2} .0327187{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0175768{col 67}{space 3}  .110678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto probit_m
{txt}
{com}. 
. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     1,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(Y_dum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0168296{col 26}{space 2} .0266319{col 37}{space 1}    0.63{col 46}{space 3}0.527{col 54}{space 4}-.0353679{col 67}{space 3} .0690271
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0402084{col 26}{space 2} .0042561{col 37}{space 1}   -9.45{col 46}{space 3}0.000{col 54}{space 4}-.0485503{col 67}{space 3}-.0318666
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0465506{col 26}{space 2} .0327187{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0175768{col 67}{space 3}  .110678
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto probit_mdelta
{txt}
{com}. 
. *Bootstrap se option not included for margin
. 
. * Exercise 4&5
. * logit model
. reg Y_dum X1 X2 X3

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}     1,000
{txt}{hline 13}{c +}{hline 34}   F(3, 996)       = {res}    26.54
{txt}       Model {c |} {res} 18.5076085         3  6.16920282   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 231.492392       996   .23242208   {txt}R-squared       ={res}    0.0740
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0712
{txt}       Total {c |} {res}        250       999   .25025025   {txt}Root MSE        =   {res}  .4821

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0187419{col 26}{space 2} .0266916{col 37}{space 1}    0.70{col 46}{space 3}0.483{col 54}{space 4}-.0336363{col 67}{space 3}   .07112
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0383407{col 26}{space 2} .0043438{col 37}{space 1}   -8.83{col 46}{space 3}0.000{col 54}{space 4}-.0468648{col 67}{space 3}-.0298165
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0465913{col 26}{space 2} .0328154{col 37}{space 1}    1.42{col 46}{space 3}0.156{col 54}{space 4}-.0178039{col 67}{space 3} .1109865
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .6708107{col 26}{space 2} .0624941{col 37}{space 1}   10.73{col 46}{space 3}0.000{col 54}{space 4} .5481754{col 67}{space 3} .7934459
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto linear_
{txt}
{com}. 
. logit Y_dum X1 X2 X3

{res}{txt}Iteration 0:{space 3}log likelihood = {res:-693.14718}  
Iteration 1:{space 3}log likelihood = {res:-653.79128}  
Iteration 2:{space 3}log likelihood = {res:-653.74994}  
Iteration 3:{space 3}log likelihood = {res:-653.74994}  
{res}
{txt}Logistic regression{col 49}Number of obs{col 67}= {res}     1,000
{txt}{col 49}LR chi2({res}3{txt}){col 67}= {res}     78.79
{txt}{col 49}Prob > chi2{col 67}= {res}    0.0000
{txt}Log likelihood = {res}-653.74994{txt}{col 49}Pseudo R2{col 67}= {res}    0.0568

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}       Y_dum{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0752562{col 26}{space 2}  .115287{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.1507022{col 67}{space 3} .3012146
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.1736359{col 26}{space 2} .0213784{col 37}{space 1}   -8.12{col 46}{space 3}0.000{col 54}{space 4}-.2155369{col 67}{space 3} -.131735
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .2007914{col 26}{space 2} .1418988{col 37}{space 1}    1.42{col 46}{space 3}0.157{col 54}{space 4} -.077325{col 67}{space 3} .4789079
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .7787889{col 26}{space 2} .2735991{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .2425444{col 67}{space 3} 1.315033
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto logit_
{txt}
{com}. 
. margins, dydx(*) vce(delta)
{res}
{txt}Average marginal effects{col 49}Number of obs{col 67}= {res}     1,000
{txt}Model VCE{col 14}: {res}OIM

{txt}{p2colset 1 14 16 2}{...}
{p2col:Expression}:{space 1}{res:Pr(Y_dum), predict()}{p_end}
{p2colreset}{...}
{txt}{p2colset 1 14 16 2}{...}
{p2col:dy/dx w.r.t.}:{space 1}{res:X1 X2 X3}{p_end}
{p2colreset}{...}

{res}{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26} Delta-method
{col 14}{c |}      dy/dx{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 10}X1 {c |}{col 14}{res}{space 2} .0173997{col 26}{space 2} .0266328{col 37}{space 1}    0.65{col 46}{space 3}0.514{col 54}{space 4}-.0347996{col 67}{space 3} .0695989
{txt}{space 10}X2 {c |}{col 14}{res}{space 2}-.0401456{col 26}{space 2} .0042956{col 37}{space 1}   -9.35{col 46}{space 3}0.000{col 54}{space 4}-.0485649{col 67}{space 3}-.0317263
{txt}{space 10}X3 {c |}{col 14}{res}{space 2} .0464241{col 26}{space 2} .0326824{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4}-.0176321{col 67}{space 3} .1104803
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto logit_mdelta
{txt}
{com}. 
. *Bootstrap se option not included for margin
. 
. 
. ********
. * HW 3 *
. ********
. * merge two data set (these two data set are exported from R)
. insheet using "demos.csv",clear
{txt}(9 vars, 516 obs)

{com}. sort hhid
{txt}
{com}. preserve
{txt}
{com}. 
. tempfile tmp
{txt}
{com}. insheet using "choicePrice.csv",clear
{txt}(13 vars, 4,470 obs)

{com}. sort hhid
{txt}
{com}. save `tmp'
{txt}file C:\Users\jiere\AppData\Local\Temp\ST_2b4c_000002.tmp saved

{com}. 
. restore
{txt}
{com}. merge hhid using `tmp'
{txt}{p}
(note: you are using old
{bf:merge} syntax; see
{bf:{help merge:[D] merge}} for new syntax)
{p_end}
{p 0 4 2}
variable{txt} hhid
does not uniquely identify observations in
C:\Users\jiere\AppData\Local\Temp\ST_2b4c_000002.tmp
{p_end}

{com}. drop hhid v1 _merge
{txt}
{com}. gen id = _n
{txt}
{com}. 
. * Exercise 1
. * summary statistics
. su ppk_stk  pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub /*
> */ppk_tub pfl_tub phse_tub

{txt}    Variable {c |}        Obs        Mean    Std. Dev.       Min        Max
{hline 13}{c +}{hline 57}
{space 5}ppk_stk {c |}{res}      4,470    .5184362    .1505174        .19        .67
{txt}{space 5}pbb_stk {c |}{res}      4,470    .5432103    .1203319        .19       1.01
{txt}{space 5}pfl_stk {c |}{res}      4,470     1.01502    .0428952        .95       1.16
{txt}{space 4}phse_stk {c |}{res}      4,470    .4371476    .1188312        .19        .64
{txt}{space 4}pgen_stk {c |}{res}      4,470    .3452819    .0351661        .25        .55
{txt}{hline 13}{c +}{hline 57}
{space 4}pimp_stk {c |}{res}      4,470    .7807785    .1146461        .33        2.3
{txt}{space 5}pss_tub {c |}{res}      4,470    .8250895    .0612116         .5        .98
{txt}{space 5}ppk_tub {c |}{res}      4,470    1.077409    .0297261        .98       1.24
{txt}{space 5}pfl_tub {c |}{res}      4,470    1.189376    .0140545        .69       1.47
{txt}{space 4}phse_tub {c |}{res}      4,470    .5686734     .072455        .33       1.27
{txt}
{com}. tab choice

     {txt}choice {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
          1 {c |}{res}      1,766       39.51       39.51
{txt}          2 {c |}{res}        699       15.64       55.15
{txt}          3 {c |}{res}        243        5.44       60.58
{txt}          4 {c |}{res}        593       13.27       73.85
{txt}          5 {c |}{res}        315        7.05       80.89
{txt}          6 {c |}{res}         74        1.66       82.55
{txt}          7 {c |}{res}        319        7.14       89.69
{txt}          8 {c |}{res}        203        4.54       94.23
{txt}          9 {c |}{res}        225        5.03       99.26
{txt}         10 {c |}{res}         33        0.74      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * market share by type
. gen choice_type = cond(choice == 1|choice == 2|choice == 3|choice == 4|choice ///
> == 5|choice == 6,"stk","tub")
{txt}
{com}. tab choice_type

{txt}choice_type {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        stk {c |}{res}      3,690       82.55       82.55
{txt}        tub {c |}{res}        780       17.45      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * market share by brand
. gen choice_brand = cond(choice == 1|choice == 8,"ppk", /*
> */cond(choice == 2,"pbb",cond(choice == 3|choice == 9,"pfl",cond(choice == 4|choice == 10,"phse",/*
> */cond(choice == 5,"pgen",cond(choice == 6,"pimp",cond(choice == 7,"pss","")))))))
{txt}
{com}. tab choice_brand

{txt}choice_bran {c |}
          d {c |}      Freq.     Percent        Cum.
{hline 12}{c +}{hline 35}
        pbb {c |}{res}        699       15.64       15.64
{txt}        pfl {c |}{res}        468       10.47       26.11
{txt}       pgen {c |}{res}        315        7.05       33.15
{txt}       phse {c |}{res}        626       14.00       47.16
{txt}       pimp {c |}{res}         74        1.66       48.81
{txt}        ppk {c |}{res}      1,969       44.05       92.86
{txt}        pss {c |}{res}        319        7.14      100.00
{txt}{hline 12}{c +}{hline 35}
      Total {c |}{res}      4,470      100.00
{txt}
{com}. 
. * Exercise 2&4
. * conditional logit
. * reshape from wide to long
. rename (ppk_stk  pbb_stk pfl_stk phse_stk pgen_stk pimp_stk pss_tub /*
> */ppk_tub pfl_tub phse_tub)(Price1 Price2 Price3 Price4 Price5 Price6 Price7 /*
> */Price8 Price9 Price10) // first need to rename the price
{res}{txt}
{com}. 
. reshape long Price, i(id)
{txt}(note: j = 1 2 3 4 5 6 7 8 9 10)

Data{col 36}wide{col 43}->{col 48}long
{hline 77}
Number of obs.                 {res}    4470   {txt}->{res}   44700
{txt}Number of variables            {res}      21   {txt}->{res}      13
{txt}j variable (10 values)                    ->   {res}_j
{txt}xij variables:
              {res}Price1 Price2 ... Price10   {txt}->   {res}Price
{txt}{hline 77}

{com}. rename (_j)(alt)
{res}{txt}
{com}. gen d = cond(choice == alt,1,0) //one means choosen, zero means not
{txt}
{com}. 
. asclogit d Price, case(id) alternatives(alt)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7559.2014}  
Iteration 1:{space 3}log likelihood = {res:-7465.2594}  
Iteration 2:{space 3}log likelihood = {res:-7464.9321}  
Iteration 3:{space 3}log likelihood = {res:-7464.9321}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}1{txt}){col 67}= {res}   1458.85
{txt}Log likelihood = {res}-7464.9321{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}alt          {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.656579{col 26}{space 2} .1742793{col 37}{space 1}  -38.19{col 46}{space 3}0.000{col 54}{space 4} -6.99816{col 67}{space 3}-6.314998
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.9543068{col 26}{space 2} .0500462{col 37}{space 1}  -19.07{col 46}{space 3}0.000{col 54}{space 4}-1.052396{col 67}{space 3} -.856218
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.296968{col 26}{space 2} .1086515{col 37}{space 1}   11.94{col 46}{space 3}0.000{col 54}{space 4} 1.084015{col 67}{space 3} 1.509921
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.717332{col 26}{space 2} .0541582{col 37}{space 1}  -31.71{col 46}{space 3}0.000{col 54}{space 4} -1.82348{col 67}{space 3}-1.611184
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-2.904005{col 26}{space 2} .0714605{col 37}{space 1}  -40.64{col 46}{space 3}0.000{col 54}{space 4}-3.044065{col 67}{space 3}-2.763945
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-1.515311{col 26}{space 2} .1262303{col 37}{space 1}  -12.00{col 46}{space 3}0.000{col 54}{space 4}-1.762718{col 67}{space 3}-1.267904
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} .2517684{col 26}{space 2}  .079164{col 37}{space 1}    3.18{col 46}{space 3}0.001{col 54}{space 4} .0966098{col 67}{space 3}  .406927
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 1.464868{col 26}{space 2} .1180467{col 37}{space 1}   12.41{col 46}{space 3}0.000{col 54}{space 4} 1.233501{col 67}{space 3} 1.696236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2} 2.357505{col 26}{space 2}  .133774{col 37}{space 1}   17.62{col 46}{space 3}0.000{col 54}{space 4} 2.095313{col 67}{space 3} 2.619697
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-3.896594{col 26}{space 2}  .177419{col 37}{space 1}  -21.96{col 46}{space 3}0.000{col 54}{space 4}-4.244328{col 67}{space 3}-3.548859
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto c_logit
{txt}
{com}. estat mfx // marginal effect estimation
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .41862592
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62007}}}{space 1}{space 1}{ralign 8:{res:{sf: .045076}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.70841}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53172}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13669617
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .38092}}}{space 1}{space 1}{ralign 8:{res:{sf: .016377}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .348821}}}{space 1}{space 1}{ralign 8:{res:{sf: .413019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.785545}}}{space 1}{space 1}{ralign 8:{res:{sf: .030158}}}{space 1}{space 1}{ralign 6:{res:{sf:-26.05}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.844654}}}{space 1}{space 1}{ralign 8:{res:{sf:-.726436}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05617075
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156526}}}{space 1}{space 1}{ralign 8:{res:{sf: .010709}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135537}}}{space 1}{space 1}{ralign 8:{res:{sf: .177515}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051111}}}{space 1}{space 1}{ralign 8:{res:{sf: .003765}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.57}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043731}}}{space 1}{space 1}{ralign 8:{res:{sf: .058492}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.352903}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02284}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.45}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.397668}}}{space 1}{space 1}{ralign 8:{res:{sf:-.308137}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .12912093
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .359811}}}{space 1}{space 1}{ralign 8:{res:{sf: .016943}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .326602}}}{space 1}{space 1}{ralign 8:{res:{sf: .393019}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117491}}}{space 1}{space 1}{ralign 8:{res:{sf: .006448}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104853}}}{space 1}{space 1}{ralign 8:{res:{sf: .130129}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048279}}}{space 1}{space 1}{ralign 8:{res:{sf: .003651}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041124}}}{space 1}{space 1}{ralign 8:{res:{sf: .055434}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.748524}}}{space 1}{space 1}{ralign 8:{res:{sf: .031316}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.809901}}}{space 1}{space 1}{ralign 8:{res:{sf:-.687146}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07264529
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .202435}}}{space 1}{space 1}{ralign 8:{res:{sf: .012376}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .178178}}}{space 1}{space 1}{ralign 8:{res:{sf: .226691}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066102}}}{space 1}{space 1}{ralign 8:{res:{sf: .004433}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057414}}}{space 1}{space 1}{ralign 8:{res:{sf:  .07479}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027162}}}{space 1}{space 1}{ralign 8:{res:{sf: .002319}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022618}}}{space 1}{space 1}{ralign 8:{res:{sf: .031707}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .062439}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00431}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.49}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .053992}}}{space 1}{space 1}{ralign 8:{res:{sf: .070886}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: -.44844}}}{space 1}{space 1}{ralign 8:{res:{sf: .025561}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.498539}}}{space 1}{space 1}{ralign 8:{res:{sf:-.398341}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01604447
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .04471}}}{space 1}{space 1}{ralign 8:{res:{sf: .005301}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .034319}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0551}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014599}}}{space 1}{space 1}{ralign 8:{res:{sf: .001779}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.20}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011112}}}{space 1}{space 1}{ralign 8:{res:{sf: .018087}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005999}}}{space 1}{space 1}{ralign 8:{res:{sf: .000796}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004438}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00756}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .01379}}}{space 1}{space 1}{ralign 8:{res:{sf: .001698}}}{space 1}{space 1}{ralign 6:{res:{sf:  8.12}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .010462}}}{space 1}{space 1}{ralign 8:{res:{sf: .017118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007759}}}{space 1}{space 1}{ralign 8:{res:{sf: .001001}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005796}}}{space 1}{space 1}{ralign 8:{res:{sf: .009721}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.105088}}}{space 1}{space 1}{ralign 8:{res:{sf: .012245}}}{space 1}{space 1}{ralign 6:{res:{sf: -8.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.129087}}}{space 1}{space 1}{ralign 8:{res:{sf:-.081089}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06992927
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .194866}}}{space 1}{space 1}{ralign 8:{res:{sf: .011804}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .171731}}}{space 1}{space 1}{ralign 8:{res:{sf: .218001}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063631}}}{space 1}{space 1}{ralign 8:{res:{sf: .004253}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055295}}}{space 1}{space 1}{ralign 8:{res:{sf: .071966}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .026147}}}{space 1}{space 1}{ralign 8:{res:{sf: .002223}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .02179}}}{space 1}{space 1}{ralign 8:{res:{sf: .030504}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060104}}}{space 1}{space 1}{ralign 8:{res:{sf: .004135}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.54}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:    .052}}}{space 1}{space 1}{ralign 8:{res:{sf: .068209}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033816}}}{space 1}{space 1}{ralign 8:{res:{sf: .002681}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028561}}}{space 1}{space 1}{ralign 8:{res:{sf: .039071}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .007469}}}{space 1}{space 1}{ralign 8:{res:{sf: .000963}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.76}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005582}}}{space 1}{space 1}{ralign 8:{res:{sf: .009355}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.432938}}}{space 1}{space 1}{ralign 8:{res:{sf: .024519}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.66}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.480995}}}{space 1}{space 1}{ralign 8:{res:{sf:-.384882}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04385975
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .12222}}}{space 1}{space 1}{ralign 8:{res:{sf: .008972}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .104636}}}{space 1}{space 1}{ralign 8:{res:{sf: .139804}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .039909}}}{space 1}{space 1}{ralign 8:{res:{sf: .003145}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.69}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .033744}}}{space 1}{space 1}{ralign 8:{res:{sf: .046074}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016399}}}{space 1}{space 1}{ralign 8:{res:{sf: .001554}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .013354}}}{space 1}{space 1}{ralign 8:{res:{sf: .019444}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .037698}}}{space 1}{space 1}{ralign 8:{res:{sf: .003025}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .031768}}}{space 1}{space 1}{ralign 8:{res:{sf: .043627}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .021209}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0019}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.16}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .017485}}}{space 1}{space 1}{ralign 8:{res:{sf: .024933}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004684}}}{space 1}{space 1}{ralign 8:{res:{sf: .000634}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003441}}}{space 1}{space 1}{ralign 8:{res:{sf: .005927}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020416}}}{space 1}{space 1}{ralign 8:{res:{sf: .001828}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .016833}}}{space 1}{space 1}{ralign 8:{res:{sf: .023999}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.279151}}}{space 1}{space 1}{ralign 8:{res:{sf: .019602}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.31757}}}{space 1}{space 1}{ralign 8:{res:{sf:-.240731}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .05082152
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .14162}}}{space 1}{space 1}{ralign 8:{res:{sf: .009996}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.17}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .122027}}}{space 1}{space 1}{ralign 8:{res:{sf: .161213}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .046244}}}{space 1}{space 1}{ralign 8:{res:{sf: .003507}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03937}}}{space 1}{space 1}{ralign 8:{res:{sf: .053118}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019002}}}{space 1}{space 1}{ralign 8:{res:{sf: .001757}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015559}}}{space 1}{space 1}{ralign 8:{res:{sf: .022445}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043681}}}{space 1}{space 1}{ralign 8:{res:{sf: .003386}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .037046}}}{space 1}{space 1}{ralign 8:{res:{sf: .050317}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024576}}}{space 1}{space 1}{ralign 8:{res:{sf: .002144}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020374}}}{space 1}{space 1}{ralign 8:{res:{sf: .028778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005428}}}{space 1}{space 1}{ralign 8:{res:{sf: .000726}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004005}}}{space 1}{space 1}{ralign 8:{res:{sf: .006851}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023657}}}{space 1}{space 1}{ralign 8:{res:{sf: .002057}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019625}}}{space 1}{space 1}{ralign 8:{res:{sf: .027689}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .014838}}}{space 1}{space 1}{ralign 8:{res:{sf: .001434}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.35}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012027}}}{space 1}{space 1}{ralign 8:{res:{sf: .017649}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.321105}}}{space 1}{space 1}{ralign 8:{res:{sf: .021545}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.363332}}}{space 1}{space 1}{ralign 8:{res:{sf:-.278878}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00608591
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .016959}}}{space 1}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011133}}}{space 1}{space 1}{ralign 8:{res:{sf: .022785}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005538}}}{space 1}{space 1}{ralign 8:{res:{sf: .000986}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003605}}}{space 1}{space 1}{ralign 8:{res:{sf: .007471}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002276}}}{space 1}{space 1}{ralign 8:{res:{sf: .000422}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.40}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001449}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005231}}}{space 1}{space 1}{ralign 8:{res:{sf: .000933}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.60}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003402}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00706}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002943}}}{space 1}{space 1}{ralign 8:{res:{sf: .000538}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001888}}}{space 1}{space 1}{ralign 8:{res:{sf: .003998}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00065}}}{space 1}{space 1}{ralign 8:{res:{sf: .000136}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.78}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 8:{res:{sf: .000916}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000518}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001817}}}{space 1}{space 1}{ralign 8:{res:{sf: .003849}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001777}}}{space 1}{space 1}{ralign 8:{res:{sf: .000334}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001123}}}{space 1}{space 1}{ralign 8:{res:{sf: .002431}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002059}}}{space 1}{space 1}{ralign 8:{res:{sf: .000384}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001306}}}{space 1}{space 1}{ralign 8:{res:{sf: .002811}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040265}}}{space 1}{space 1}{ralign 8:{res:{sf: .007011}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.74}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054006}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. * Exercise 3&4
. * Multinomial logit 
. asclogit d, case(id) alternatives(alt) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-8328.1129}  
Iteration 1:{space 3}log likelihood = {res:-8236.9407}  
Iteration 2:{space 3}log likelihood = {res: -8236.757}  
Iteration 3:{space 3}log likelihood = {res: -8236.757}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}    101.55
{txt}Log likelihood = {res} -8236.757{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0030887{col 26}{space 2}  .003114{col 37}{space 1}   -0.99{col 46}{space 3}0.321{col 54}{space 4} -.009192{col 67}{space 3} .0030145
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8453241{col 26}{space 2} .0931354{col 37}{space 1}   -9.08{col 46}{space 3}0.000{col 54}{space 4}-1.027866{col 67}{space 3} -.662782
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0145862{col 26}{space 2} .0038255{col 37}{space 1}    3.81{col 46}{space 3}0.000{col 54}{space 4} .0070885{col 67}{space 3}  .022084
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.399858{col 26}{space 2} .1335802{col 37}{space 1}  -17.97{col 46}{space 3}0.000{col 54}{space 4} -2.66167{col 67}{space 3}-2.138045
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040504{col 26}{space 2} .0030926{col 37}{space 1}    1.31{col 46}{space 3}0.190{col 54}{space 4}-.0020109{col 67}{space 3} .0101118
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.201326{col 26}{space 2} .0971021{col 37}{space 1}  -12.37{col 46}{space 3}0.000{col 54}{space 4}-1.391643{col 67}{space 3} -1.01101
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012536{col 26}{space 2} .0042024{col 37}{space 1}   -0.30{col 46}{space 3}0.765{col 54}{space 4}-.0094901{col 67}{space 3} .0069829
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.690582{col 26}{space 2} .1269952{col 37}{space 1}  -13.31{col 46}{space 3}0.000{col 54}{space 4}-1.939488{col 67}{space 3}-1.441676
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .030612{col 26}{space 2}  .004674{col 37}{space 1}    6.55{col 46}{space 3}0.000{col 54}{space 4} .0214512{col 67}{space 3} .0397729
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.139767{col 26}{space 2}  .210989{col 37}{space 1}  -19.62{col 46}{space 3}0.000{col 54}{space 4}-4.553298{col 67}{space 3}-3.726236
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0069326{col 26}{space 2} .0044161{col 37}{space 1}   -1.57{col 46}{space 3}0.116{col 54}{space 4} -.015588{col 67}{space 3} .0017228
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.531042{col 26}{space 2} .1280434{col 37}{space 1}  -11.96{col 46}{space 3}0.000{col 54}{space 4}-1.782002{col 67}{space 3}-1.280081
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0228862{col 26}{space 2} .0036217{col 37}{space 1}    6.32{col 46}{space 3}0.000{col 54}{space 4} .0157878{col 67}{space 3} .0299845
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.848352{col 26}{space 2} .1393848{col 37}{space 1}  -20.44{col 46}{space 3}0.000{col 54}{space 4}-3.121541{col 67}{space 3}-2.575163
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .017743{col 26}{space 2} .0037623{col 37}{space 1}    4.72{col 46}{space 3}0.000{col 54}{space 4}  .010369{col 67}{space 3} .0251169
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.575597{col 26}{space 2}   .13614{col 37}{space 1}  -18.92{col 46}{space 3}0.000{col 54}{space 4}-2.842427{col 67}{space 3}-2.308768
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0107909{col 26}{space 2}   .01013{col 37}{space 1}    1.07{col 46}{space 3}0.287{col 54}{space 4}-.0090636{col 67}{space 3} .0306454
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -4.28227{col 26}{space 2}  .345792{col 37}{space 1}  -12.38{col 46}{space 3}0.000{col 54}{space 4} -4.96001{col 67}{space 3} -3.60453
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto m_logit
{txt}
{com}. estat mfx 
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .39801715
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.001062}}}{space 1}{space 1}{ralign 8:{res:{sf: .000487}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.029}}}{space 1}{space 1}{ralign 8:{res:{sf:-.002016}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000108}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .15691817
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000904}}}{space 1}{space 1}{ralign 8:{res:{sf: .000378}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.39}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.017}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001645}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000162}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05406295
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000644}}}{space 1}{space 1}{ralign 8:{res:{sf: .000183}}}{space 1}{space 1}{ralign 6:{res:{sf:  3.53}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000286}}}{space 1}{space 1}{ralign 8:{res:{sf: .001002}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .13391688
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000185}}}{space 1}{space 1}{ralign 8:{res:{sf: .000329}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.574}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00046}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00083}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07089742
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000278}}}{space 1}{space 1}{ralign 8:{res:{sf: .000264}}}{space 1}{space 1}{ralign 6:{res:{sf: -1.06}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.291}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000795}}}{space 1}{space 1}{ralign 8:{res:{sf: .000238}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01478443
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000413}}}{space 1}{space 1}{ralign 8:{res:{sf: .000066}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.22}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000283}}}{space 1}{space 1}{ralign 8:{res:{sf: .000543}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .07107045
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000682}}}{space 1}{space 1}{ralign 8:{res:{sf: .000277}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.014}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001224}}}{space 1}{space 1}{ralign 8:{res:{sf: -.00014}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res} .04343487
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000878}}}{space 1}{space 1}{ralign 8:{res:{sf: .000138}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.38}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000608}}}{space 1}{space 1}{ralign 8:{res:{sf: .001148}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .04948833
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000746}}}{space 1}{space 1}{ralign 8:{res:{sf: .000164}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.55}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000425}}}{space 1}{space 1}{ralign 8:{res:{sf: .001067}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00740936
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00006}}}{space 1}{space 1}{ralign 8:{res:{sf: .000074}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.82}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.413}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000084}}}{space 1}{space 1}{ralign 8:{res:{sf: .000204}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. 
. * Exercise 5
. * Mixed logit
. asclogit d Price, case(id) alternatives(alt) casevar(income)
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7513.4717}  
Iteration 1:{space 3}log likelihood = {res:-7418.3161}  
Iteration 2:{space 3}log likelihood = {res:-7417.9325}  
Iteration 3:{space 3}log likelihood = {res:-7417.9325}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    44,700
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4470

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}        10
{col 63}{txt}avg = {res}      10.0
{col 63}{txt}max = {res}        10

{txt}{col 51}Wald chi2({res}10{txt}){col 67}= {res}   1538.10
{txt}Log likelihood = {res}-7417.9325{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}alt          {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.659669{col 26}{space 2} .1747698{col 37}{space 1}  -38.11{col 46}{space 3}0.000{col 54}{space 4}-7.002212{col 67}{space 3}-6.317127
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0042599{col 26}{space 2} .0034392{col 37}{space 1}   -1.24{col 46}{space 3}0.215{col 54}{space 4}-.0110007{col 67}{space 3} .0024808
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8406734{col 26}{space 2} .1038446{col 37}{space 1}   -8.10{col 46}{space 3}0.000{col 54}{space 4}-1.044205{col 67}{space 3}-.6371417
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}  .014344{col 26}{space 2} .0039221{col 37}{space 1}    3.66{col 46}{space 3}0.000{col 54}{space 4} .0066568{col 67}{space 3} .0220311
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8886069{col 26}{space 2} .1594585{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .5760739{col 67}{space 3}  1.20114
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040998{col 26}{space 2} .0032042{col 37}{space 1}    1.28{col 46}{space 3}0.201{col 54}{space 4}-.0021803{col 67}{space 3}   .01038
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.828492{col 26}{space 2}  .103218{col 37}{space 1}  -17.71{col 46}{space 3}0.000{col 54}{space 4}-2.030795{col 67}{space 3}-1.626188
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0011829{col 26}{space 2} .0042971{col 37}{space 1}   -0.28{col 46}{space 3}0.783{col 54}{space 4} -.009605{col 67}{space 3} .0072393
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} -2.87341{col 26}{space 2} .1347573{col 37}{space 1}  -21.32{col 46}{space 3}0.000{col 54}{space 4} -3.13753{col 67}{space 3}-2.609291
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0298089{col 26}{space 2} .0047267{col 37}{space 1}    6.31{col 46}{space 3}0.000{col 54}{space 4} .0205448{col 67}{space 3} .0390731
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.457119{col 26}{space 2}  .215426{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-2.879346{col 67}{space 3}-2.034891
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0092456{col 26}{space 2} .0045935{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4}-.0182487{col 67}{space 3}-.0002425
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4968692{col 26}{space 2} .1424824{col 37}{space 1}    3.49{col 46}{space 3}0.000{col 54}{space 4} .2176089{col 67}{space 3} .7761295
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0219965{col 26}{space 2} .0038203{col 37}{space 1}    5.76{col 46}{space 3}0.000{col 54}{space 4} .0145088{col 67}{space 3} .0294841
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}   .80306{col 26}{space 2} .1709199{col 37}{space 1}    4.70{col 46}{space 3}0.000{col 54}{space 4} .4680631{col 67}{space 3} 1.138057
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0169911{col 26}{space 2} .0039155{col 37}{space 1}    4.34{col 46}{space 3}0.000{col 54}{space 4} .0093169{col 67}{space 3} .0246653
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.864125{col 26}{space 2} .1799469{col 37}{space 1}   10.36{col 46}{space 3}0.000{col 54}{space 4} 1.511436{col 67}{space 3} 2.216815
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}10           {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0087596{col 26}{space 2} .0103007{col 37}{space 1}    0.85{col 46}{space 3}0.395{col 54}{space 4}-.0114295{col 67}{space 3} .0289487
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-4.142386{col 26}{space 2} .3506563{col 37}{space 1}  -11.81{col 46}{space 3}0.000{col 54}{space 4}-4.829659{col 67}{space 3}-3.455112
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto mix_logit
{txt}
{com}. estat mfx
{res}
{txt}Pr(choice = 1|1 selected) ={col 10}{res} .42172362
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-1.62411}}}{space 1}{space 1}{ralign 8:{res:{sf: .045171}}}{space 1}{space 1}{ralign 6:{res:{sf:-35.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.71264}}}{space 1}{space 1}{ralign 8:{res:{sf:-1.53558}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .385102}}}{space 1}{space 1}{ralign 8:{res:{sf: .016615}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .352538}}}{space 1}{space 1}{ralign 8:{res:{sf: .417666}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156859}}}{space 1}{space 1}{ralign 8:{res:{sf: .010841}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135611}}}{space 1}{space 1}{ralign 8:{res:{sf: .178107}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .366243}}}{space 1}{space 1}{ralign 8:{res:{sf: .017247}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .33244}}}{space 1}{space 1}{ralign 8:{res:{sf: .400045}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .20521}}}{space 1}{space 1}{ralign 8:{res:{sf: .012577}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .18056}}}{space 1}{space 1}{ralign 8:{res:{sf: .229859}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .040343}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00515}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030249}}}{space 1}{space 1}{ralign 8:{res:{sf: .050437}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .195568}}}{space 1}{space 1}{ralign 8:{res:{sf: .011974}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .172099}}}{space 1}{space 1}{ralign 8:{res:{sf: .219036}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117449}}}{space 1}{space 1}{ralign 8:{res:{sf: .008947}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.13}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .099913}}}{space 1}{space 1}{ralign 8:{res:{sf: .134986}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .140182}}}{space 1}{space 1}{ralign 8:{res:{sf: .010078}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .12043}}}{space 1}{space 1}{ralign 8:{res:{sf: .159935}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .017157}}}{space 1}{space 1}{ralign 8:{res:{sf: .003023}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.68}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011232}}}{space 1}{space 1}{ralign 8:{res:{sf: .023082}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000958}}}{space 1}{space 1}{ralign 8:{res:{sf: .000546}}}{space 1}{space 1}{ralign 6:{res:{sf: -1.75}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.079}}}{space 1}{space 1}{ralign 8:{res:{sf:-.002028}}}{space 1}{space 1}{ralign 8:{res:{sf: .000113}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 2|1 selected) ={col 10}{res} .13711827
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .385102}}}{space 1}{space 1}{ralign 8:{res:{sf: .016615}}}{space 1}{space 1}{ralign 6:{res:{sf: 23.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .352538}}}{space 1}{space 1}{ralign 8:{res:{sf: .417666}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.787951}}}{space 1}{space 1}{ralign 8:{res:{sf: .030373}}}{space 1}{space 1}{ralign 6:{res:{sf:-25.94}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.847481}}}{space 1}{space 1}{ralign 8:{res:{sf:-.728421}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051001}}}{space 1}{space 1}{ralign 8:{res:{sf: .003796}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043561}}}{space 1}{space 1}{ralign 8:{res:{sf:  .05844}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .119079}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00655}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .106241}}}{space 1}{space 1}{ralign 8:{res:{sf: .131918}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066721}}}{space 1}{space 1}{ralign 8:{res:{sf: .004491}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.86}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057919}}}{space 1}{space 1}{ralign 8:{res:{sf: .075523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013117}}}{space 1}{space 1}{ralign 8:{res:{sf: .001716}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .009754}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01648}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063586}}}{space 1}{space 1}{ralign 8:{res:{sf: .004295}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.81}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055169}}}{space 1}{space 1}{ralign 8:{res:{sf: .072004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .038187}}}{space 1}{space 1}{ralign 8:{res:{sf: .003113}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .032086}}}{space 1}{space 1}{ralign 8:{res:{sf: .044288}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .045579}}}{space 1}{space 1}{ralign 8:{res:{sf: .003517}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .038685}}}{space 1}{space 1}{ralign 8:{res:{sf: .052472}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005578}}}{space 1}{space 1}{ralign 8:{res:{sf: .000999}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.59}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003621}}}{space 1}{space 1}{ralign 8:{res:{sf: .007536}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000896}}}{space 1}{space 1}{ralign 8:{res:{sf: .000368}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.015}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001617}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000174}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 3|1 selected) ={col 10}{res} .05585072
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .156859}}}{space 1}{space 1}{ralign 8:{res:{sf: .010841}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.47}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .135611}}}{space 1}{space 1}{ralign 8:{res:{sf: .178107}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .051001}}}{space 1}{space 1}{ralign 8:{res:{sf: .003796}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .043561}}}{space 1}{space 1}{ralign 8:{res:{sf:  .05844}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.351174}}}{space 1}{space 1}{ralign 8:{res:{sf: .022984}}}{space 1}{space 1}{ralign 6:{res:{sf:-15.28}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.396222}}}{space 1}{space 1}{ralign 8:{res:{sf:-.306125}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048503}}}{space 1}{space 1}{ralign 8:{res:{sf: .003699}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.11}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041254}}}{space 1}{space 1}{ralign 8:{res:{sf: .055753}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027177}}}{space 1}{space 1}{ralign 8:{res:{sf: .002338}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022594}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03176}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005343}}}{space 1}{space 1}{ralign 8:{res:{sf: .000755}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003863}}}{space 1}{space 1}{ralign 8:{res:{sf: .006822}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .0259}}}{space 1}{space 1}{ralign 8:{res:{sf: .002229}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .021531}}}{space 1}{space 1}{ralign 8:{res:{sf: .030268}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .015554}}}{space 1}{space 1}{ralign 8:{res:{sf: .001515}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012584}}}{space 1}{space 1}{ralign 8:{res:{sf: .018525}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .018565}}}{space 1}{space 1}{ralign 8:{res:{sf: .001745}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015145}}}{space 1}{space 1}{ralign 8:{res:{sf: .021984}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002272}}}{space 1}{space 1}{ralign 8:{res:{sf: .000424}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001442}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000674}}}{space 1}{space 1}{ralign 8:{res:{sf: .000189}}}{space 1}{space 1}{ralign 6:{res:{sf:  3.56}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000303}}}{space 1}{space 1}{ralign 8:{res:{sf: .001045}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 4|1 selected) ={col 10}{res} .13040323
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .366243}}}{space 1}{space 1}{ralign 8:{res:{sf: .017247}}}{space 1}{space 1}{ralign 6:{res:{sf: 21.24}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .33244}}}{space 1}{space 1}{ralign 8:{res:{sf: .400045}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .119079}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00655}}}{space 1}{space 1}{ralign 6:{res:{sf: 18.18}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .106241}}}{space 1}{space 1}{ralign 8:{res:{sf: .131918}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .048503}}}{space 1}{space 1}{ralign 8:{res:{sf: .003699}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.11}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .041254}}}{space 1}{space 1}{ralign 8:{res:{sf: .055753}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.755195}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03158}}}{space 1}{space 1}{ralign 6:{res:{sf:-23.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.817091}}}{space 1}{space 1}{ralign 8:{res:{sf:-.693299}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063454}}}{space 1}{space 1}{ralign 8:{res:{sf: .004389}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .054851}}}{space 1}{space 1}{ralign 8:{res:{sf: .072057}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .012475}}}{space 1}{space 1}{ralign 8:{res:{sf: .001645}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00925}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0157}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060472}}}{space 1}{space 1}{ralign 8:{res:{sf: .004196}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.41}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .052248}}}{space 1}{space 1}{ralign 8:{res:{sf: .068696}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .036317}}}{space 1}{space 1}{ralign 8:{res:{sf: .003007}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030423}}}{space 1}{space 1}{ralign 8:{res:{sf: .042211}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043346}}}{space 1}{space 1}{ralign 8:{res:{sf: .003412}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03666}}}{space 1}{space 1}{ralign 8:{res:{sf: .050033}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005305}}}{space 1}{space 1}{ralign 8:{res:{sf: .000951}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00717}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000238}}}{space 1}{space 1}{ralign 8:{res:{sf: .000326}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.73}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.464}}}{space 1}{space 1}{ralign 8:{res:{sf:  -.0004}}}{space 1}{space 1}{ralign 8:{res:{sf: .000876}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 5|1 selected) ={col 10}{res} .07306635
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .20521}}}{space 1}{space 1}{ralign 8:{res:{sf: .012577}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .18056}}}{space 1}{space 1}{ralign 8:{res:{sf: .229859}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .066721}}}{space 1}{space 1}{ralign 8:{res:{sf: .004491}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.86}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .057919}}}{space 1}{space 1}{ralign 8:{res:{sf: .075523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .027177}}}{space 1}{space 1}{ralign 8:{res:{sf: .002338}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .022594}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03176}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063454}}}{space 1}{space 1}{ralign 8:{res:{sf: .004389}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.46}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .054851}}}{space 1}{space 1}{ralign 8:{res:{sf: .072057}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.451044}}}{space 1}{space 1}{ralign 8:{res:{sf: .025776}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.50}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.501565}}}{space 1}{space 1}{ralign 8:{res:{sf:-.400523}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00699}}}{space 1}{space 1}{ralign 8:{res:{sf: .000961}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005106}}}{space 1}{space 1}{ralign 8:{res:{sf: .008873}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033883}}}{space 1}{space 1}{ralign 8:{res:{sf: .002708}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028576}}}{space 1}{space 1}{ralign 8:{res:{sf: .039191}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020349}}}{space 1}{space 1}{ralign 8:{res:{sf: .001872}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.87}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01668}}}{space 1}{space 1}{ralign 8:{res:{sf: .024018}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024287}}}{space 1}{space 1}{ralign 8:{res:{sf: .002147}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.31}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020079}}}{space 1}{space 1}{ralign 8:{res:{sf: .028496}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 8:{res:{sf: .000547}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001901}}}{space 1}{space 1}{ralign 8:{res:{sf: .004044}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000252}}}{space 1}{space 1}{ralign 8:{res:{sf: .000272}}}{space 1}{space 1}{ralign 6:{res:{sf: -0.93}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.354}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000786}}}{space 1}{space 1}{ralign 8:{res:{sf: .000282}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 6|1 selected) ={col 10}{res} .01436436
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .040343}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00515}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030249}}}{space 1}{space 1}{ralign 8:{res:{sf: .050437}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013117}}}{space 1}{space 1}{ralign 8:{res:{sf: .001716}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .009754}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01648}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005343}}}{space 1}{space 1}{ralign 8:{res:{sf: .000755}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003863}}}{space 1}{space 1}{ralign 8:{res:{sf: .006822}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .012475}}}{space 1}{space 1}{ralign 8:{res:{sf: .001645}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00925}}}{space 1}{space 1}{ralign 8:{res:{sf:   .0157}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00699}}}{space 1}{space 1}{ralign 8:{res:{sf: .000961}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .005106}}}{space 1}{space 1}{ralign 8:{res:{sf: .008873}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.094288}}}{space 1}{space 1}{ralign 8:{res:{sf: .011858}}}{space 1}{space 1}{ralign 6:{res:{sf: -7.95}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.117528}}}{space 1}{space 1}{ralign 8:{res:{sf:-.071047}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .006661}}}{space 1}{space 1}{ralign 8:{res:{sf: .000917}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004865}}}{space 1}{space 1}{ralign 8:{res:{sf: .008458}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:    .004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00058}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .002864}}}{space 1}{space 1}{ralign 8:{res:{sf: .005137}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004775}}}{space 1}{space 1}{ralign 8:{res:{sf: .000681}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.01}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf: .006109}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000584}}}{space 1}{space 1}{ralign 8:{res:{sf: .000126}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.65}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000338}}}{space 1}{space 1}{ralign 8:{res:{sf: .000831}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000396}}}{space 1}{space 1}{ralign 8:{res:{sf: .000065}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.13}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000269}}}{space 1}{space 1}{ralign 8:{res:{sf: .000522}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 7|1 selected) ={col 10}{res} .06963319
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .195568}}}{space 1}{space 1}{ralign 8:{res:{sf: .011974}}}{space 1}{space 1}{ralign 6:{res:{sf: 16.33}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .172099}}}{space 1}{space 1}{ralign 8:{res:{sf: .219036}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .063586}}}{space 1}{space 1}{ralign 8:{res:{sf: .004295}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.81}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .055169}}}{space 1}{space 1}{ralign 8:{res:{sf: .072004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf:   .0259}}}{space 1}{space 1}{ralign 8:{res:{sf: .002229}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.62}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .021531}}}{space 1}{space 1}{ralign 8:{res:{sf: .030268}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .060472}}}{space 1}{space 1}{ralign 8:{res:{sf: .004196}}}{space 1}{space 1}{ralign 6:{res:{sf: 14.41}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .052248}}}{space 1}{space 1}{ralign 8:{res:{sf: .068696}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .033883}}}{space 1}{space 1}{ralign 8:{res:{sf: .002708}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.51}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .028576}}}{space 1}{space 1}{ralign 8:{res:{sf: .039191}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .006661}}}{space 1}{space 1}{ralign 8:{res:{sf: .000917}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .004865}}}{space 1}{space 1}{ralign 8:{res:{sf: .008458}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.431443}}}{space 1}{space 1}{ralign 8:{res:{sf: .024732}}}{space 1}{space 1}{ralign 6:{res:{sf:-17.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.479916}}}{space 1}{space 1}{ralign 8:{res:{sf: -.38297}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019393}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00179}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015885}}}{space 1}{space 1}{ralign 8:{res:{sf: .022901}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023146}}}{space 1}{space 1}{ralign 8:{res:{sf: .002048}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.30}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019131}}}{space 1}{space 1}{ralign 8:{res:{sf: .027161}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000521}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001811}}}{space 1}{space 1}{ralign 8:{res:{sf: .003855}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.000802}}}{space 1}{space 1}{ralign 8:{res:{sf: .000279}}}{space 1}{space 1}{ralign 6:{res:{sf: -2.88}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.004}}}{space 1}{space 1}{ralign 8:{res:{sf:-.001348}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000256}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 8|1 selected) ={col 10}{res}  .0418186
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .117449}}}{space 1}{space 1}{ralign 8:{res:{sf: .008947}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.13}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .099913}}}{space 1}{space 1}{ralign 8:{res:{sf: .134986}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .038187}}}{space 1}{space 1}{ralign 8:{res:{sf: .003113}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .032086}}}{space 1}{space 1}{ralign 8:{res:{sf: .044288}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .015554}}}{space 1}{space 1}{ralign 8:{res:{sf: .001515}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.26}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .012584}}}{space 1}{space 1}{ralign 8:{res:{sf: .018525}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .036317}}}{space 1}{space 1}{ralign 8:{res:{sf: .003007}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.08}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .030423}}}{space 1}{space 1}{ralign 8:{res:{sf: .042211}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .020349}}}{space 1}{space 1}{ralign 8:{res:{sf: .001872}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.87}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .01668}}}{space 1}{space 1}{ralign 8:{res:{sf: .024018}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf:    .004}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00058}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.90}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .002864}}}{space 1}{space 1}{ralign 8:{res:{sf: .005137}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .019393}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00179}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.83}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015885}}}{space 1}{space 1}{ralign 8:{res:{sf: .022901}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.266852}}}{space 1}{space 1}{ralign 8:{res:{sf: .019513}}}{space 1}{space 1}{ralign 6:{res:{sf:-13.68}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.305096}}}{space 1}{space 1}{ralign 8:{res:{sf:-.228608}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013901}}}{space 1}{space 1}{ralign 8:{res:{sf: .001387}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.02}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011182}}}{space 1}{space 1}{ralign 8:{res:{sf: .016619}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001701}}}{space 1}{space 1}{ralign 8:{res:{sf: .000323}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001069}}}{space 1}{space 1}{ralign 8:{res:{sf: .002334}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000825}}}{space 1}{space 1}{ralign 8:{res:{sf: .000137}}}{space 1}{space 1}{ralign 6:{res:{sf:  6.02}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000556}}}{space 1}{space 1}{ralign 8:{res:{sf: .001094}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 9|1 selected) ={col 10}{res} .04991288
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .140182}}}{space 1}{space 1}{ralign 8:{res:{sf: .010078}}}{space 1}{space 1}{ralign 6:{res:{sf: 13.91}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .12043}}}{space 1}{space 1}{ralign 8:{res:{sf: .159935}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .045579}}}{space 1}{space 1}{ralign 8:{res:{sf: .003517}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.96}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .038685}}}{space 1}{space 1}{ralign 8:{res:{sf: .052472}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .018565}}}{space 1}{space 1}{ralign 8:{res:{sf: .001745}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .015145}}}{space 1}{space 1}{ralign 8:{res:{sf: .021984}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .043346}}}{space 1}{space 1}{ralign 8:{res:{sf: .003412}}}{space 1}{space 1}{ralign 6:{res:{sf: 12.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .03666}}}{space 1}{space 1}{ralign 8:{res:{sf: .050033}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .024287}}}{space 1}{space 1}{ralign 8:{res:{sf: .002147}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.31}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .020079}}}{space 1}{space 1}{ralign 8:{res:{sf: .028496}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .004775}}}{space 1}{space 1}{ralign 8:{res:{sf: .000681}}}{space 1}{space 1}{ralign 6:{res:{sf:  7.01}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf: .006109}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .023146}}}{space 1}{space 1}{ralign 8:{res:{sf: .002048}}}{space 1}{space 1}{ralign 6:{res:{sf: 11.30}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .019131}}}{space 1}{space 1}{ralign 8:{res:{sf: .027161}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .013901}}}{space 1}{space 1}{ralign 8:{res:{sf: .001387}}}{space 1}{space 1}{ralign 6:{res:{sf: 10.02}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011182}}}{space 1}{space 1}{ralign 8:{res:{sf: .016619}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.315812}}}{space 1}{space 1}{ralign 8:{res:{sf: .021622}}}{space 1}{space 1}{ralign 6:{res:{sf:-14.61}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: -.35819}}}{space 1}{space 1}{ralign 8:{res:{sf:-.273434}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002031}}}{space 1}{space 1}{ralign 8:{res:{sf: .000381}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001283}}}{space 1}{space 1}{ralign 8:{res:{sf: .002778}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000735}}}{space 1}{space 1}{ralign 8:{res:{sf: .000169}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000404}}}{space 1}{space 1}{ralign 8:{res:{sf: .001065}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

Pr(choice = 10|1 selected) ={col 10}{res} .00610877
{txt}{hline 13}{c TT}{hline 65}
variable     {c |}{col 18}dp/dx{col 26}Std. Err.{col 39}z{col 45}P>|z|{col 52}[    95% C.I.    ]{col 77}X
{hline 13}{c +}{hline 65}
{res}{txt}{space 0}{res:{lalign 13:Price}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:1}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .017157}}}{space 1}{space 1}{ralign 8:{res:{sf: .003023}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.68}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .011232}}}{space 1}{space 1}{ralign 8:{res:{sf: .023082}}}{space 1}{space 1}{ralign 8:{res:{sf:  .51844}}}{space 0}
{space 0}{space 0}{ralign 12:2}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005578}}}{space 1}{space 1}{ralign 8:{res:{sf: .000999}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.59}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .003621}}}{space 1}{space 1}{ralign 8:{res:{sf: .007536}}}{space 1}{space 1}{ralign 8:{res:{sf:  .54321}}}{space 0}
{space 0}{space 0}{ralign 12:3}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002272}}}{space 1}{space 1}{ralign 8:{res:{sf: .000424}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.36}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001442}}}{space 1}{space 1}{ralign 8:{res:{sf: .003102}}}{space 1}{space 1}{ralign 8:{res:{sf:   1.015}}}{space 0}
{space 0}{space 0}{ralign 12:4}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .005305}}}{space 1}{space 1}{ralign 8:{res:{sf: .000951}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.58}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00344}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00717}}}{space 1}{space 1}{ralign 8:{res:{sf:  .43715}}}{space 0}
{space 0}{space 0}{ralign 12:5}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002973}}}{space 1}{space 1}{ralign 8:{res:{sf: .000547}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.44}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001901}}}{space 1}{space 1}{ralign 8:{res:{sf: .004044}}}{space 1}{space 1}{ralign 8:{res:{sf:  .34528}}}{space 0}
{space 0}{space 0}{ralign 12:6}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .000584}}}{space 1}{space 1}{ralign 8:{res:{sf: .000126}}}{space 1}{space 1}{ralign 6:{res:{sf:  4.65}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .000338}}}{space 1}{space 1}{ralign 8:{res:{sf: .000831}}}{space 1}{space 1}{ralign 8:{res:{sf:  .78078}}}{space 0}
{space 0}{space 0}{ralign 12:7}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002833}}}{space 1}{space 1}{ralign 8:{res:{sf: .000521}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.43}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001811}}}{space 1}{space 1}{ralign 8:{res:{sf: .003855}}}{space 1}{space 1}{ralign 8:{res:{sf:  .82509}}}{space 0}
{space 0}{space 0}{ralign 12:8}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .001701}}}{space 1}{space 1}{ralign 8:{res:{sf: .000323}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.27}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001069}}}{space 1}{space 1}{ralign 8:{res:{sf: .002334}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.0774}}}{space 0}
{space 0}{space 0}{ralign 12:9}{space 1}{c |}{space 1}{ralign 8:{res:{sf: .002031}}}{space 1}{space 1}{ralign 8:{res:{sf: .000381}}}{space 1}{space 1}{ralign 6:{res:{sf:  5.32}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf: .001283}}}{space 1}{space 1}{ralign 8:{res:{sf: .002778}}}{space 1}{space 1}{ralign 8:{res:{sf:  1.1894}}}{space 0}
{space 0}{space 0}{ralign 12:10}{space 1}{c |}{space 1}{ralign 8:{res:{sf:-.040434}}}{space 1}{space 1}{ralign 8:{res:{sf: .007078}}}{space 1}{space 1}{ralign 6:{res:{sf: -5.71}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.000}}}{space 1}{space 1}{ralign 8:{res:{sf:-.054306}}}{space 1}{space 1}{ralign 8:{res:{sf:-.026561}}}{space 1}{space 1}{ralign 8:{res:{sf:  .56867}}}{space 0}
{space 0}{hline 13}{c   +}{hline 10}{hline 10}{hline 8}{hline 8}{hline 10}{hline 10}{hline 9}
{space 0}{res:{lalign 13:casevars}}{c |}{space 10}{space 10}{space 8}{space 8}{space 10}{space 10}{space 9}
{space 0}{space 0}{ralign 12:income}{space 1}{c |}{space 1}{ralign 8:{res:{sf:  .00004}}}{space 1}{space 1}{ralign 8:{res:{sf: .000062}}}{space 1}{space 1}{ralign 6:{res:{sf:  0.64}}}{space 1}{space 1}{ralign 6:{res:{sf: 0.520}}}{space 1}{space 1}{ralign 8:{res:{sf:-.000081}}}{space 1}{space 1}{ralign 8:{res:{sf:  .00016}}}{space 1}{space 1}{ralign 8:{res:{sf:  27.664}}}{space 0}
{hline 13}{c BT}{hline 65}

{com}. gen ll = e(ll)
{txt}
{com}. 
. * Mixed logit of droping one choice
. asclogit d Price if alt != 10, case(id) alternatives(alt) casevar(income)
{txt}{p 0 6 2}note: 33 cases{txt} (297 obs) dropped due to no positive outcome  per case{p_end}
{res}
{txt}Iteration 0:{space 3}log likelihood = {res:-7338.0067}  
Iteration 1:{space 3}log likelihood = {res:-7240.5947}  
Iteration 2:{space 3}log likelihood = {res:-7240.2035}  
Iteration 3:{space 3}log likelihood = {res:-7240.2035}  
{res}
{txt}Alternative-specific conditional logit{col 48}Number of obs{col 67}= {res}    39,933
{txt}Case variable: id{col 48}Number of cases{col 67}= {res}      4437

{txt}Alternative variable: alt{col 48}Alts per case: min = {res}         9
{col 63}{txt}avg = {res}       9.0
{col 63}{txt}max = {res}         9

{txt}{col 51}Wald chi2({res}9{txt}){col 67}= {res}   1496.86
{txt}Log likelihood = {res}-7240.2035{col 51}{txt}Prob > chi2{col 67}= {res}    0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}           d{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}alt          {txt}{c |}
{space 7}Price {c |}{col 14}{res}{space 2}-6.662263{col 26}{space 2} .1773451{col 37}{space 1}  -37.57{col 46}{space 3}0.000{col 54}{space 4}-7.009853{col 67}{space 3}-6.314673
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}{res}1           {col 14}{txt}{c |}  (base alternative)
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}2            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0041388{col 26}{space 2} .0034332{col 37}{space 1}   -1.21{col 46}{space 3}0.228{col 54}{space 4}-.0108678{col 67}{space 3} .0025901
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.8456784{col 26}{space 2} .1037222{col 37}{space 1}   -8.15{col 46}{space 3}0.000{col 54}{space 4} -1.04897{col 67}{space 3}-.6423866
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}3            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0142684{col 26}{space 2} .0039131{col 37}{space 1}    3.65{col 46}{space 3}0.000{col 54}{space 4} .0065989{col 67}{space 3} .0219379
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8902285{col 26}{space 2} .1598555{col 37}{space 1}    5.57{col 46}{space 3}0.000{col 54}{space 4} .5769175{col 67}{space 3} 1.203539
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}4            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0040389{col 26}{space 2} .0031968{col 37}{space 1}    1.26{col 46}{space 3}0.206{col 54}{space 4}-.0022266{col 67}{space 3} .0103045
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-1.827246{col 26}{space 2} .1030859{col 37}{space 1}  -17.73{col 46}{space 3}0.000{col 54}{space 4}-2.029291{col 67}{space 3}-1.625201
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}5            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0012321{col 26}{space 2} .0042866{col 37}{space 1}   -0.29{col 46}{space 3}0.774{col 54}{space 4}-.0096337{col 67}{space 3} .0071695
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.873897{col 26}{space 2} .1346734{col 37}{space 1}  -21.34{col 46}{space 3}0.000{col 54}{space 4}-3.137852{col 67}{space 3}-2.609942
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}6            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0297055{col 26}{space 2} .0047194{col 37}{space 1}    6.29{col 46}{space 3}0.000{col 54}{space 4} .0204558{col 67}{space 3} .0389553
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-2.455586{col 26}{space 2} .2153077{col 37}{space 1}  -11.41{col 46}{space 3}0.000{col 54}{space 4}-2.877582{col 67}{space 3}-2.033591
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}7            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2}-.0092135{col 26}{space 2} .0045835{col 37}{space 1}   -2.01{col 46}{space 3}0.044{col 54}{space 4} -.018197{col 67}{space 3}  -.00023
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4953166{col 26}{space 2} .1424907{col 37}{space 1}    3.48{col 46}{space 3}0.001{col 54}{space 4} .2160399{col 67}{space 3} .7745933
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}8            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0218706{col 26}{space 2}  .003812{col 37}{space 1}    5.74{col 46}{space 3}0.000{col 54}{space 4} .0143992{col 67}{space 3} .0293419
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8065785{col 26}{space 2} .1713693{col 37}{space 1}    4.71{col 46}{space 3}0.000{col 54}{space 4} .4707009{col 67}{space 3} 1.142456
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}9            {txt}{c |}
{space 6}income {c |}{col 14}{res}{space 2} .0168581{col 26}{space 2} .0039069{col 37}{space 1}    4.31{col 46}{space 3}0.000{col 54}{space 4} .0092007{col 67}{space 3} .0245155
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} 1.868468{col 26}{space 2} .1807678{col 37}{space 1}   10.34{col 46}{space 3}0.000{col 54}{space 4}  1.51417{col 67}{space 3} 2.222767
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto mix_logit_alt
{txt}
{com}. gen ll2 = e(ll)
{txt}
{com}. 
. * use the MTT test provide by Prof.Sidibe
. gen MTT = 2*(ll - ll2)
{txt}
{com}. di MTT
{res}-355.45801
{txt}
{com}. hausman mix_logit mix_logit_alt

{txt}{col 18}{hline 4} Coefficients {hline 4}
{col 14}{c |}{col 21}(b){col 34}(B){col 49}(b-B){col 59}sqrt(diag(V_b-V_B))
{col 14}{c |}{col 17} mix_logit  {col 30}mix_logit_~t{col 46}Difference{col 66}S.E.
{hline 13}{c +}{hline 64}
{space 7}Price {c |}{res}{col 18}-6.659669{col 31}-6.662263{col 47} .0025942{col 63}        .
{txt}{hline 13}{c BT}{hline 64}
{ralign 78:b = consistent under Ho and Ha; obtained from asclogit}
{ralign 78:B = inconsistent under Ha, efficient under Ho; obtained from asclogit}

    Test:  Ho:  difference in coefficients not systematic

{ralign 25:chi2({res:1})} = (b-B)'[(V_b-V_B)^(-1)](b-B)
{col 27}={res}    -0.01{txt}{col 41}chi2<0 ==> model fitted on these
{col 41}data fails to meet the asymptotic
{col 41}assumptions of the Hausman test;
{col 41}see {help suest##|_new:suest} for a generalized test

{com}. di r(p)
{res}1
{txt}
{com}. * we reject the null hypothese and state that IIA is hold.
. 
. ********
. * HW 4 *
. ********
. insheet using "Koop-Tobias.csv", clear
{txt}(10 vars, 17,919 obs)

{com}. 
. * Exercise 1
. * panel data setup
. xtset personid timetrnd
{res}{txt}{col 8}panel variable:  {res}personid (unbalanced)
{txt}{col 9}time variable:  {res}{col 25}timetrnd, 0 to 14, but with gaps
{txt}{col 17}delta:  {res}1 unit
{txt}
{com}. xtdes

{txt}personid:  {res}1{txt}, {res}2{txt}, ..., {res}2178                                   {txt}n ={res}       2178
{txt}timetrnd:  {res}0, 1, ..., 14                                     {txt}T ={res}         15
           {txt}Delta(timetrnd) = {res}1 unit
           {txt}Span(timetrnd)  = {res}15 periods
           {txt}(personid*timetrnd uniquely identifies each observation)

Distribution of T_i:   min      5%     25%       50%       75%     95%     max
                    {res}     1       2       5         8        11      14      15

{txt}{col 6}Freq.  Percent    Cum. {c |}  Pattern
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}       93      4.27    4.27{txt} {c |}  {res}111111111111111
       46      2.11    6.38{txt} {c |}  {res}........1111111
       45      2.07    8.45{txt} {c |}  {res}......111111111
       44      2.02   10.47{txt} {c |}  {res}.......11111111
       43      1.97   12.44{txt} {c |}  {res}.11111111111111
       42      1.93   14.37{txt} {c |}  {res}..1111111111111
       36      1.65   16.02{txt} {c |}  {res}....11111111111
       35      1.61   17.63{txt} {c |}  {res}...111111111111
       30      1.38   19.01{txt} {c |}  {res}..........11111
     1764     80.99  100.00{txt} {c |} (other patterns)
 {hline 27}{c +}{c -}{c -}{hline 15}
{res}     2178    100.00        {txt} {c |}  {res}XXXXXXXXXXXXXXX
{txt}
{com}. global yvar logwage
{txt}
{com}. global xvar "educ potexper"
{txt}
{com}. 
. * Exercise 2
. xtreg $yvar $xvar, re // random effect
{res}
{txt}Random-effects GLS regression                   Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1961                                         {txt}min = {res}         1
{txt}     between = {res}0.1533                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1578                                         {txt}max = {res}        15

                                                {txt}Wald chi2({res}2{txt})      =  {res}  4209.96
{txt}corr(u_i, X)   = {res}0{txt} (assumed)                    Prob > chi2       =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      z{col 46}   P>|z|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .107938{col 26}{space 2} .0033832{col 37}{space 1}   31.90{col 46}{space 3}0.000{col 54}{space 4} .1013071{col 67}{space 3}  .114569
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0387645{col 26}{space 2} .0007178{col 37}{space 1}   54.00{col 46}{space 3}0.000{col 54}{space 4} .0373576{col 67}{space 3} .0401714
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .5635206{col 26}{space 2} .0438846{col 37}{space 1}   12.84{col 46}{space 3}0.000{col 54}{space 4} .4775083{col 67}{space 3} .6495328
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .37207276
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res}  .5516129{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}

{com}. est sto re
{txt}
{com}. 
. * Exercise 3
. xtreg $yvar $xvar, be // between estimator

{txt}Between regression (regression on group means)  Number of obs     = {res}    17,919
{txt}Group variable: {res}personid                        {txt}Number of groups  = {res}     2,178

{txt}R-sq:                                           Obs per group:
     within  = {res}0.1962                                         {txt}min = {res}         1
{txt}     between = {res}0.1553                                         {txt}avg = {res}       8.2
{txt}     overall = {res}0.1518                                         {txt}max = {res}        15

                                                {txt}F({res}2{txt},{res}2175{txt})         =  {res}   200.01
{txt}sd(u_i + avg(e_i.))= {res} .3991313                  {txt}Prob > F          =     {res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .0930999{col 26}{space 2} .0046685{col 37}{space 1}   19.94{col 46}{space 3}0.000{col 54}{space 4} .0839447{col 67}{space 3} .1022551
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0259987{col 26}{space 2} .0036049{col 37}{space 1}    7.21{col 46}{space 3}0.000{col 54}{space 4} .0189294{col 67}{space 3} .0330681
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .8455688{col 26}{space 2} .0770179{col 37}{space 1}   10.98{col 46}{space 3}0.000{col 54}{space 4} .6945324{col 67}{space 3} .9966052
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}

{com}. est sto be
{txt}
{com}. 
. xtreg $yvar $xvar, fe // with-in estimator
{res}
{txt}Fixed-effects (within) regression{col 49}Number of obs{col 67}={col 69}{res}    17,919
{txt}Group variable: {res}personid{txt}{col 49}Number of groups{col 67}={col 69}{res}     2,178

{txt}R-sq:{col 49}Obs per group:
     within  = {res}0.1964{col 63}{txt}min{col 67}={col 69}{res}         1
{txt}     between = {res}0.1550{col 63}{txt}avg{col 67}={col 69}{res}       8.2
{txt}     overall = {res}0.1551{col 63}{txt}max{col 67}={col 69}{res}        15

{txt}{col 49}F({res}2{txt},{res}15739{txt}){col 67}={col 70}{res}  1923.47
{txt}corr(u_i, Xb){col 16}= {res}-0.1273{txt}{col 49}Prob > F{col 67}={col 73}{res}0.0000

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2}  .123662{col 26}{space 2} .0057619{col 37}{space 1}   21.46{col 46}{space 3}0.000{col 54}{space 4} .1123681{col 67}{space 3} .1349559
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0385611{col 26}{space 2} .0007585{col 37}{space 1}   50.84{col 46}{space 3}0.000{col 54}{space 4} .0370744{col 67}{space 3} .0400478
{txt}{space 7}_cons {c |}{col 14}{res}{space 2} .4068016{col 26}{space 2} .0717348{col 37}{space 1}    5.67{col 46}{space 3}0.000{col 54}{space 4} .2661931{col 67}{space 3}   .54741
{txt}{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
     sigma_u {c |} {res} .40290853
     {txt}sigma_e {c |} {res} .33545728
         {txt}rho {c |} {res} .59059603{txt}   (fraction of variance due to u_i)
{hline 13}{c BT}{hline 64}
F test that all u_i=0: F({res}2177{txt}, {res}15739{txt}) = {res}9.95{col 62}{txt}Prob > F = {res}0.0000
{txt}
{com}. est sto fe
{txt}
{com}. 
. * first difference
. gen educ_D = educ - L.educ
{txt}(4,235 missing values generated)

{com}. gen educ_L = L.educ
{txt}(4,235 missing values generated)

{com}. gen potexper_D = potexper - L.potexper
{txt}(4,235 missing values generated)

{com}. gen logwage_D = logwage - L.logwage
{txt}(4,235 missing values generated)

{com}. 
. reg logwage_D educ_D potexper_D, noconstant

{txt}      Source {c |}       SS           df       MS      Number of obs   ={res}    13,684
{txt}{hline 13}{c +}{hline 34}   F(2, 13682)     = {res}   171.87
{txt}       Model {c |} {res} 38.7282937         2  19.3641469   {txt}Prob > F        ={res}    0.0000
{txt}    Residual {c |} {res} 1541.54171    13,682  .112669326   {txt}R-squared       ={res}    0.0245
{txt}{hline 13}{c +}{hline 34}   Adj R-squared   ={res}    0.0244
{txt}       Total {c |} {res} 1580.27001    13,684  .115483046   {txt}Root MSE        =   {res} .33566

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 1}   logwage_D{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 6}educ_D {c |}{col 14}{res}{space 2} .0431084{col 26}{space 2} .0151792{col 37}{space 1}    2.84{col 46}{space 3}0.005{col 54}{space 4} .0133551{col 67}{space 3} .0728617
{txt}{space 2}potexper_D {c |}{col 14}{res}{space 2} .0535369{col 26}{space 2} .0029221{col 37}{space 1}   18.32{col 46}{space 3}0.000{col 54}{space 4} .0478092{col 67}{space 3} .0592647
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto fd
{txt}
{com}. *NOTE: this only consider the difference of data in consequtive time periods
. 
. * Exercise 4
. * draw 100 person sample (take unique, select 100 person, then merge their data back)
. preserve
{txt}
{com}. 
. tempfile tmp
{txt}
{com}. bysort personid: keep if _n == 1
{txt}(15,741 observations deleted)

{com}. sample 100,count
{txt}(2,078 observations deleted)

{com}. sort personid
{txt}
{com}. save `tmp'
{txt}file C:\Users\jiere\AppData\Local\Temp\ST_2b4c_000004.tmp saved

{com}. 
. restore
{txt}
{com}. merge m:1 personid using `tmp'
{res}
{txt}{col 5}Result{col 38}# of obs.
{col 5}{hline 41}
{col 5}not matched{col 30}{res}          17,088
{txt}{col 9}from master{col 30}{res}          17,088{txt}  (_merge==1)
{col 9}from using{col 30}{res}               0{txt}  (_merge==2)

{col 5}matched{col 30}{res}             831{txt}  (_merge==3)
{col 5}{hline 41}

{com}. keep if _merge == 3
{txt}(17,088 observations deleted)

{com}. drop _merge
{txt}
{com}. 
. global yvar_ logwage
{txt}
{com}. global xvar_ "educ potexper"
{txt}
{com}. 
. * first get the indiviudal fixed effect
. reg $yvar_ $xvar_ i.personid, vce(robust)

{txt}Linear regression                               Number of obs     = {res}       831
                                                {txt}{help j_robustsingular:F(100, 729) }      =  {res}        .
                                                {txt}Prob > F          = {res}         .
                                                {txt}R-squared         = {res}    0.6186
                                                {txt}Root MSE          =    {res} .33981

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1}     logwage{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 8}educ {c |}{col 14}{res}{space 2} .2122135{col 26}{space 2} .0275415{col 37}{space 1}    7.71{col 46}{space 3}0.000{col 54}{space 4} .1581433{col 67}{space 3} .2662836
{txt}{space 4}potexper {c |}{col 14}{res}{space 2} .0311124{col 26}{space 2} .0036689{col 37}{space 1}    8.48{col 46}{space 3}0.000{col 54}{space 4} .0239095{col 67}{space 3} .0383154
{txt}{space 12} {c |}
{space 4}personid {c |}
{space 9}77  {c |}{col 14}{res}{space 2}-.2008578{col 26}{space 2} .1981254{col 37}{space 1}   -1.01{col 46}{space 3}0.311{col 54}{space 4}-.5898223{col 67}{space 3} .1881067
{txt}{space 9}94  {c |}{col 14}{res}{space 2}-.0684336{col 26}{space 2} .1144297{col 37}{space 1}   -0.60{col 46}{space 3}0.550{col 54}{space 4}-.2930847{col 67}{space 3} .1562176
{txt}{space 8}162  {c |}{col 14}{res}{space 2} .3311602{col 26}{space 2} .1405186{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4} .0552908{col 67}{space 3} .6070296
{txt}{space 8}182  {c |}{col 14}{res}{space 2} -1.09099{col 26}{space 2} .2134577{col 37}{space 1}   -5.11{col 46}{space 3}0.000{col 54}{space 4}-1.510055{col 67}{space 3}-.6719251
{txt}{space 8}200  {c |}{col 14}{res}{space 2} .1928863{col 26}{space 2} .1494667{col 37}{space 1}    1.29{col 46}{space 3}0.197{col 54}{space 4}-.1005503{col 67}{space 3} .4863229
{txt}{space 8}210  {c |}{col 14}{res}{space 2} -.243924{col 26}{space 2}  .116066{col 37}{space 1}   -2.10{col 46}{space 3}0.036{col 54}{space 4}-.4717875{col 67}{space 3}-.0160606
{txt}{space 8}213  {c |}{col 14}{res}{space 2} .6906579{col 26}{space 2} .1014855{col 37}{space 1}    6.81{col 46}{space 3}0.000{col 54}{space 4} .4914192{col 67}{space 3} .8898966
{txt}{space 8}214  {c |}{col 14}{res}{space 2}-1.636434{col 26}{space 2} .1000012{col 37}{space 1}  -16.36{col 46}{space 3}0.000{col 54}{space 4}-1.832758{col 67}{space 3}-1.440109
{txt}{space 8}238  {c |}{col 14}{res}{space 2} .6983771{col 26}{space 2} .1256957{col 37}{space 1}    5.56{col 46}{space 3}0.000{col 54}{space 4} .4516083{col 67}{space 3} .9451458
{txt}{space 8}245  {c |}{col 14}{res}{space 2}-.3011995{col 26}{space 2} .1204805{col 37}{space 1}   -2.50{col 46}{space 3}0.013{col 54}{space 4}-.5377297{col 67}{space 3}-.0646693
{txt}{space 8}248  {c |}{col 14}{res}{space 2} .0115572{col 26}{space 2}  .150261{col 37}{space 1}    0.08{col 46}{space 3}0.939{col 54}{space 4}-.2834386{col 67}{space 3} .3065531
{txt}{space 8}253  {c |}{col 14}{res}{space 2} .2124599{col 26}{space 2} .4546132{col 37}{space 1}    0.47{col 46}{space 3}0.640{col 54}{space 4}-.6800475{col 67}{space 3} 1.104967
{txt}{space 8}273  {c |}{col 14}{res}{space 2}-.7589746{col 26}{space 2} .1081175{col 37}{space 1}   -7.02{col 46}{space 3}0.000{col 54}{space 4}-.9712334{col 67}{space 3}-.5467157
{txt}{space 8}300  {c |}{col 14}{res}{space 2}-.1169883{col 26}{space 2}  .141331{col 37}{space 1}   -0.83{col 46}{space 3}0.408{col 54}{space 4}-.3944526{col 67}{space 3}  .160476
{txt}{space 8}318  {c |}{col 14}{res}{space 2} .2980108{col 26}{space 2} .1262233{col 37}{space 1}    2.36{col 46}{space 3}0.018{col 54}{space 4} .0502063{col 67}{space 3} .5458154
{txt}{space 8}344  {c |}{col 14}{res}{space 2}-.6630997{col 26}{space 2} .1357261{col 37}{space 1}   -4.89{col 46}{space 3}0.000{col 54}{space 4}-.9295604{col 67}{space 3}-.3966389
{txt}{space 8}387  {c |}{col 14}{res}{space 2}  .108682{col 26}{space 2}  .105284{col 37}{space 1}    1.03{col 46}{space 3}0.302{col 54}{space 4} -.098014{col 67}{space 3} .3153779
{txt}{space 8}391  {c |}{col 14}{res}{space 2}-.4086504{col 26}{space 2} .1263714{col 37}{space 1}   -3.23{col 46}{space 3}0.001{col 54}{space 4}-.6567458{col 67}{space 3}-.1605551
{txt}{space 8}443  {c |}{col 14}{res}{space 2} .2535704{col 26}{space 2} .1749576{col 37}{space 1}    1.45{col 46}{space 3}0.148{col 54}{space 4}-.0899105{col 67}{space 3} .5970512
{txt}{space 8}465  {c |}{col 14}{res}{space 2} .9879879{col 26}{space 2} .4189649{col 37}{space 1}    2.36{col 46}{space 3}0.019{col 54}{space 4} .1654662{col 67}{space 3}  1.81051
{txt}{space 8}480  {c |}{col 14}{res}{space 2} .1531287{col 26}{space 2}  .136322{col 37}{space 1}    1.12{col 46}{space 3}0.262{col 54}{space 4}-.1145019{col 67}{space 3} .4207593
{txt}{space 8}502  {c |}{col 14}{res}{space 2} .0207865{col 26}{space 2} .1153897{col 37}{space 1}    0.18{col 46}{space 3}0.857{col 54}{space 4}-.2057493{col 67}{space 3} .2473223
{txt}{space 8}533  {c |}{col 14}{res}{space 2} .5237216{col 26}{space 2} .1837773{col 37}{space 1}    2.85{col 46}{space 3}0.004{col 54}{space 4} .1629257{col 67}{space 3} .8845175
{txt}{space 8}585  {c |}{col 14}{res}{space 2}-.1058803{col 26}{space 2} .1386575{col 37}{space 1}   -0.76{col 46}{space 3}0.445{col 54}{space 4} -.378096{col 67}{space 3} .1663353
{txt}{space 8}587  {c |}{col 14}{res}{space 2}-.4053151{col 26}{space 2} .1062149{col 37}{space 1}   -3.82{col 46}{space 3}0.000{col 54}{space 4}-.6138387{col 67}{space 3}-.1967915
{txt}{space 8}608  {c |}{col 14}{res}{space 2}-.5705444{col 26}{space 2} .3170248{col 37}{space 1}   -1.80{col 46}{space 3}0.072{col 54}{space 4}-1.192935{col 67}{space 3} .0518462
{txt}{space 8}614  {c |}{col 14}{res}{space 2}-.2317312{col 26}{space 2} .1726058{col 37}{space 1}   -1.34{col 46}{space 3}0.180{col 54}{space 4}-.5705949{col 67}{space 3} .1071326
{txt}{space 8}635  {c |}{col 14}{res}{space 2}-.1940537{col 26}{space 2} .2112572{col 37}{space 1}   -0.92{col 46}{space 3}0.359{col 54}{space 4}-.6087988{col 67}{space 3} .2206915
{txt}{space 8}650  {c |}{col 14}{res}{space 2}-.6807491{col 26}{space 2} .1954544{col 37}{space 1}   -3.48{col 46}{space 3}0.001{col 54}{space 4} -1.06447{col 67}{space 3}-.2970285
{txt}{space 8}651  {c |}{col 14}{res}{space 2}-.3746174{col 26}{space 2} .2406403{col 37}{space 1}   -1.56{col 46}{space 3}0.120{col 54}{space 4}-.8470481{col 67}{space 3} .0978132
{txt}{space 8}659  {c |}{col 14}{res}{space 2}-.0353231{col 26}{space 2} .1210072{col 37}{space 1}   -0.29{col 46}{space 3}0.770{col 54}{space 4}-.2728872{col 67}{space 3}  .202241
{txt}{space 8}673  {c |}{col 14}{res}{space 2}-.3847426{col 26}{space 2} .1556038{col 37}{space 1}   -2.47{col 46}{space 3}0.014{col 54}{space 4}-.6902277{col 67}{space 3}-.0792576
{txt}{space 8}676  {c |}{col 14}{res}{space 2} .1641179{col 26}{space 2} .1125144{col 37}{space 1}    1.46{col 46}{space 3}0.145{col 54}{space 4}-.0567731{col 67}{space 3} .3850088
{txt}{space 8}714  {c |}{col 14}{res}{space 2} .0687202{col 26}{space 2} .1059243{col 37}{space 1}    0.65{col 46}{space 3}0.517{col 54}{space 4}-.1392328{col 67}{space 3} .2766732
{txt}{space 8}727  {c |}{col 14}{res}{space 2}-.2403305{col 26}{space 2} .2111667{col 37}{space 1}   -1.14{col 46}{space 3}0.255{col 54}{space 4}-.6548979{col 67}{space 3} .1742369
{txt}{space 8}729  {c |}{col 14}{res}{space 2}-.8919924{col 26}{space 2} .1992993{col 37}{space 1}   -4.48{col 46}{space 3}0.000{col 54}{space 4}-1.283261{col 67}{space 3}-.5007234
{txt}{space 8}757  {c |}{col 14}{res}{space 2}-.3392146{col 26}{space 2} .5235255{col 37}{space 1}   -0.65{col 46}{space 3}0.517{col 54}{space 4}-1.367012{col 67}{space 3}  .688583
{txt}{space 8}783  {c |}{col 14}{res}{space 2}-.7786585{col 26}{space 2} .2606809{col 37}{space 1}   -2.99{col 46}{space 3}0.003{col 54}{space 4}-1.290433{col 67}{space 3}-.2668836
{txt}{space 8}792  {c |}{col 14}{res}{space 2}-.2135062{col 26}{space 2} .1911438{col 37}{space 1}   -1.12{col 46}{space 3}0.264{col 54}{space 4}-.5887642{col 67}{space 3} .1617518
{txt}{space 8}800  {c |}{col 14}{res}{space 2}-.1325147{col 26}{space 2} .1620747{col 37}{space 1}   -0.82{col 46}{space 3}0.414{col 54}{space 4}-.4507036{col 67}{space 3} .1856741
{txt}{space 8}835  {c |}{col 14}{res}{space 2}  -.03977{col 26}{space 2} .1098304{col 37}{space 1}   -0.36{col 46}{space 3}0.717{col 54}{space 4}-.2553917{col 67}{space 3} .1758516
{txt}{space 8}877  {c |}{col 14}{res}{space 2} .4637351{col 26}{space 2} .2017233{col 37}{space 1}    2.30{col 46}{space 3}0.022{col 54}{space 4} .0677073{col 67}{space 3} .8597629
{txt}{space 8}880  {c |}{col 14}{res}{space 2} .0082723{col 26}{space 2} .2252945{col 37}{space 1}    0.04{col 46}{space 3}0.971{col 54}{space 4} -.434031{col 67}{space 3} .4505757
{txt}{space 8}899  {c |}{col 14}{res}{space 2}-.3978847{col 26}{space 2} .1798663{col 37}{space 1}   -2.21{col 46}{space 3}0.027{col 54}{space 4}-.7510024{col 67}{space 3}-.0447671
{txt}{space 8}900  {c |}{col 14}{res}{space 2}-.1439727{col 26}{space 2} .1295825{col 37}{space 1}   -1.11{col 46}{space 3}0.267{col 54}{space 4}-.3983722{col 67}{space 3} .1104267
{txt}{space 8}912  {c |}{col 14}{res}{space 2} .1369237{col 26}{space 2} .1580856{col 37}{space 1}    0.87{col 46}{space 3}0.387{col 54}{space 4}-.1734336{col 67}{space 3} .4472809
{txt}{space 8}916  {c |}{col 14}{res}{space 2} .1915127{col 26}{space 2} .1719814{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.1461252{col 67}{space 3} .5291506
{txt}{space 8}952  {c |}{col 14}{res}{space 2}-.0497648{col 26}{space 2} .2236819{col 37}{space 1}   -0.22{col 46}{space 3}0.824{col 54}{space 4}-.4889024{col 67}{space 3} .3893727
{txt}{space 7}1001  {c |}{col 14}{res}{space 2}-.2589266{col 26}{space 2} .1545756{col 37}{space 1}   -1.68{col 46}{space 3}0.094{col 54}{space 4}-.5623931{col 67}{space 3} .0445398
{txt}{space 7}1006  {c |}{col 14}{res}{space 2}-.3313152{col 26}{space 2} .1861883{col 37}{space 1}   -1.78{col 46}{space 3}0.076{col 54}{space 4}-.6968444{col 67}{space 3}  .034214
{txt}{space 7}1047  {c |}{col 14}{res}{space 2} .3191227{col 26}{space 2} .1259799{col 37}{space 1}    2.53{col 46}{space 3}0.012{col 54}{space 4}  .071796{col 67}{space 3} .5664494
{txt}{space 7}1079  {c |}{col 14}{res}{space 2}-.0430736{col 26}{space 2} .2318213{col 37}{space 1}   -0.19{col 46}{space 3}0.853{col 54}{space 4}-.4981905{col 67}{space 3} .4120433
{txt}{space 7}1087  {c |}{col 14}{res}{space 2}-.2922416{col 26}{space 2} .1509996{col 37}{space 1}   -1.94{col 46}{space 3}0.053{col 54}{space 4}-.5886876{col 67}{space 3} .0042043
{txt}{space 7}1110  {c |}{col 14}{res}{space 2}   .42445{col 26}{space 2} .1040617{col 37}{space 1}    4.08{col 46}{space 3}0.000{col 54}{space 4} .2201537{col 67}{space 3} .6287463
{txt}{space 7}1143  {c |}{col 14}{res}{space 2} .2591092{col 26}{space 2} .1039669{col 37}{space 1}    2.49{col 46}{space 3}0.013{col 54}{space 4}  .054999{col 67}{space 3} .4632194
{txt}{space 7}1162  {c |}{col 14}{res}{space 2}-.6149999{col 26}{space 2} .2108974{col 37}{space 1}   -2.92{col 46}{space 3}0.004{col 54}{space 4}-1.029039{col 67}{space 3}-.2009611
{txt}{space 7}1169  {c |}{col 14}{res}{space 2} .0860724{col 26}{space 2} .1069539{col 37}{space 1}    0.80{col 46}{space 3}0.421{col 54}{space 4}-.1239019{col 67}{space 3} .2960468
{txt}{space 7}1200  {c |}{col 14}{res}{space 2}-.4533615{col 26}{space 2}  .140741{col 37}{space 1}   -3.22{col 46}{space 3}0.001{col 54}{space 4}-.7296676{col 67}{space 3}-.1770554
{txt}{space 7}1263  {c |}{col 14}{res}{space 2}-.2564044{col 26}{space 2} .1979328{col 37}{space 1}   -1.30{col 46}{space 3}0.196{col 54}{space 4}-.6449908{col 67}{space 3}  .132182
{txt}{space 7}1299  {c |}{col 14}{res}{space 2} .0394552{col 26}{space 2} .1182307{col 37}{space 1}    0.33{col 46}{space 3}0.739{col 54}{space 4} -.192658{col 67}{space 3} .2715684
{txt}{space 7}1302  {c |}{col 14}{res}{space 2} .2334727{col 26}{space 2} .1686985{col 37}{space 1}    1.38{col 46}{space 3}0.167{col 54}{space 4}-.0977202{col 67}{space 3} .5646655
{txt}{space 7}1316  {c |}{col 14}{res}{space 2} .2748331{col 26}{space 2} .1540291{col 37}{space 1}    1.78{col 46}{space 3}0.075{col 54}{space 4}-.0275605{col 67}{space 3} .5772266
{txt}{space 7}1323  {c |}{col 14}{res}{space 2} .7377499{col 26}{space 2}  .119991{col 37}{space 1}    6.15{col 46}{space 3}0.000{col 54}{space 4} .5021806{col 67}{space 3} .9733191
{txt}{space 7}1327  {c |}{col 14}{res}{space 2}-.0838167{col 26}{space 2} .1331065{col 37}{space 1}   -0.63{col 46}{space 3}0.529{col 54}{space 4}-.3451345{col 67}{space 3} .1775012
{txt}{space 7}1353  {c |}{col 14}{res}{space 2} .3172273{col 26}{space 2} .1434948{col 37}{space 1}    2.21{col 46}{space 3}0.027{col 54}{space 4} .0355149{col 67}{space 3} .5989396
{txt}{space 7}1393  {c |}{col 14}{res}{space 2}   .84744{col 26}{space 2} .1467807{col 37}{space 1}    5.77{col 46}{space 3}0.000{col 54}{space 4} .5592767{col 67}{space 3} 1.135603
{txt}{space 7}1401  {c |}{col 14}{res}{space 2}  .490312{col 26}{space 2} .1151498{col 37}{space 1}    4.26{col 46}{space 3}0.000{col 54}{space 4} .2642471{col 67}{space 3} .7163769
{txt}{space 7}1434  {c |}{col 14}{res}{space 2} .0791227{col 26}{space 2} .1238367{col 37}{space 1}    0.64{col 46}{space 3}0.523{col 54}{space 4}-.1639963{col 67}{space 3} .3222417
{txt}{space 7}1441  {c |}{col 14}{res}{space 2} .3546949{col 26}{space 2} .1670461{col 37}{space 1}    2.12{col 46}{space 3}0.034{col 54}{space 4} .0267461{col 67}{space 3} .6826436
{txt}{space 7}1442  {c |}{col 14}{res}{space 2} .6254692{col 26}{space 2} .1419435{col 37}{space 1}    4.41{col 46}{space 3}0.000{col 54}{space 4} .3468024{col 67}{space 3} .9041361
{txt}{space 7}1480  {c |}{col 14}{res}{space 2}-.0756881{col 26}{space 2} .1397227{col 37}{space 1}   -0.54{col 46}{space 3}0.588{col 54}{space 4} -.349995{col 67}{space 3} .1986187
{txt}{space 7}1507  {c |}{col 14}{res}{space 2}-.6565443{col 26}{space 2} .1915625{col 37}{space 1}   -3.43{col 46}{space 3}0.001{col 54}{space 4}-1.032624{col 67}{space 3}-.2804644
{txt}{space 7}1510  {c |}{col 14}{res}{space 2} -.042371{col 26}{space 2} .1626412{col 37}{space 1}   -0.26{col 46}{space 3}0.795{col 54}{space 4}-.3616721{col 67}{space 3}   .27693
{txt}{space 7}1541  {c |}{col 14}{res}{space 2} .3294516{col 26}{space 2} .1509921{col 37}{space 1}    2.18{col 46}{space 3}0.029{col 54}{space 4} .0330203{col 67}{space 3} .6258829
{txt}{space 7}1550  {c |}{col 14}{res}{space 2} .1082452{col 26}{space 2} .1170527{col 37}{space 1}    0.92{col 46}{space 3}0.355{col 54}{space 4}-.1215553{col 67}{space 3} .3380457
{txt}{space 7}1576  {c |}{col 14}{res}{space 2} .6250175{col 26}{space 2}  .114226{col 37}{space 1}    5.47{col 46}{space 3}0.000{col 54}{space 4} .4007664{col 67}{space 3} .8492686
{txt}{space 7}1582  {c |}{col 14}{res}{space 2} .1119281{col 26}{space 2} .1512579{col 37}{space 1}    0.74{col 46}{space 3}0.460{col 54}{space 4}-.1850249{col 67}{space 3} .4088811
{txt}{space 7}1604  {c |}{col 14}{res}{space 2}-.0672299{col 26}{space 2} .1176889{col 37}{space 1}   -0.57{col 46}{space 3}0.568{col 54}{space 4}-.2982794{col 67}{space 3} .1638196
{txt}{space 7}1617  {c |}{col 14}{res}{space 2} .1712071{col 26}{space 2} .1537588{col 37}{space 1}    1.11{col 46}{space 3}0.266{col 54}{space 4}-.1306558{col 67}{space 3}   .47307
{txt}{space 7}1649  {c |}{col 14}{res}{space 2}-.0931845{col 26}{space 2}   .10714{col 37}{space 1}   -0.87{col 46}{space 3}0.385{col 54}{space 4}-.3035242{col 67}{space 3} .1171552
{txt}{space 7}1676  {c |}{col 14}{res}{space 2}-.5331883{col 26}{space 2} .1685276{col 37}{space 1}   -3.16{col 46}{space 3}0.002{col 54}{space 4}-.8640457{col 67}{space 3}-.2023309
{txt}{space 7}1677  {c |}{col 14}{res}{space 2}-.6145813{col 26}{space 2} .4600622{col 37}{space 1}   -1.34{col 46}{space 3}0.182{col 54}{space 4}-1.517786{col 67}{space 3} .2886237
{txt}{space 7}1683  {c |}{col 14}{res}{space 2}-.6439971{col 26}{space 2} .2453884{col 37}{space 1}   -2.62{col 46}{space 3}0.009{col 54}{space 4}-1.125749{col 67}{space 3}-.1622448
{txt}{space 7}1699  {c |}{col 14}{res}{space 2}-.4986564{col 26}{space 2} .1252457{col 37}{space 1}   -3.98{col 46}{space 3}0.000{col 54}{space 4}-.7445418{col 67}{space 3}-.2527711
{txt}{space 7}1740  {c |}{col 14}{res}{space 2}-.3459797{col 26}{space 2} .1556436{col 37}{space 1}   -2.22{col 46}{space 3}0.027{col 54}{space 4}-.6515429{col 67}{space 3}-.0404165
{txt}{space 7}1759  {c |}{col 14}{res}{space 2} .1524612{col 26}{space 2} .1279236{col 37}{space 1}    1.19{col 46}{space 3}0.234{col 54}{space 4}-.0986814{col 67}{space 3} .4036038
{txt}{space 7}1808  {c |}{col 14}{res}{space 2}-.1214276{col 26}{space 2} .1423358{col 37}{space 1}   -0.85{col 46}{space 3}0.394{col 54}{space 4}-.4008645{col 67}{space 3} .1580093
{txt}{space 7}1810  {c |}{col 14}{res}{space 2}-.1342012{col 26}{space 2} .1852442{col 37}{space 1}   -0.72{col 46}{space 3}0.469{col 54}{space 4} -.497877{col 67}{space 3} .2294746
{txt}{space 7}1844  {c |}{col 14}{res}{space 2} .2046464{col 26}{space 2} .1198519{col 37}{space 1}    1.71{col 46}{space 3}0.088{col 54}{space 4}-.0306496{col 67}{space 3} .4399425
{txt}{space 7}1858  {c |}{col 14}{res}{space 2} -1.56971{col 26}{space 2}  .231919{col 37}{space 1}   -6.77{col 46}{space 3}0.000{col 54}{space 4}-2.025019{col 67}{space 3}-1.114402
{txt}{space 7}1870  {c |}{col 14}{res}{space 2} .0064822{col 26}{space 2} .1411484{col 37}{space 1}    0.05{col 46}{space 3}0.963{col 54}{space 4}-.2706237{col 67}{space 3} .2835881
{txt}{space 7}1876  {c |}{col 14}{res}{space 2} .0009373{col 26}{space 2} .1318833{col 37}{space 1}    0.01{col 46}{space 3}0.994{col 54}{space 4} -.257979{col 67}{space 3} .2598536
{txt}{space 7}1915  {c |}{col 14}{res}{space 2}-.8194205{col 26}{space 2} .1768781{col 37}{space 1}   -4.63{col 46}{space 3}0.000{col 54}{space 4}-1.166672{col 67}{space 3}-.4721693
{txt}{space 7}1950  {c |}{col 14}{res}{space 2}-.1531015{col 26}{space 2} .2104452{col 37}{space 1}   -0.73{col 46}{space 3}0.467{col 54}{space 4}-.5662524{col 67}{space 3} .2600493
{txt}{space 7}1958  {c |}{col 14}{res}{space 2}-.5993507{col 26}{space 2} .2014344{col 37}{space 1}   -2.98{col 46}{space 3}0.003{col 54}{space 4}-.9948114{col 67}{space 3}-.2038899
{txt}{space 7}2026  {c |}{col 14}{res}{space 2} .4568849{col 26}{space 2} .2348164{col 37}{space 1}    1.95{col 46}{space 3}0.052{col 54}{space 4}-.0041121{col 67}{space 3} .9178819
{txt}{space 7}2088  {c |}{col 14}{res}{space 2} .0467672{col 26}{space 2} .1857872{col 37}{space 1}    0.25{col 46}{space 3}0.801{col 54}{space 4}-.3179746{col 67}{space 3}  .411509
{txt}{space 7}2113  {c |}{col 14}{res}{space 2}-.4586545{col 26}{space 2} .2919679{col 37}{space 1}   -1.57{col 46}{space 3}0.117{col 54}{space 4}-1.031853{col 67}{space 3} .1145438
{txt}{space 7}2126  {c |}{col 14}{res}{space 2} .2791053{col 26}{space 2}  .196177{col 37}{space 1}    1.42{col 46}{space 3}0.155{col 54}{space 4} -.106034{col 67}{space 3} .6642446
{txt}{space 12} {c |}
{space 7}_cons {c |}{col 14}{res}{space 2}-.5690275{col 26}{space 2} .3131847{col 37}{space 1}   -1.82{col 46}{space 3}0.070{col 54}{space 4}-1.183879{col 67}{space 3}  .045824
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto idfix
{txt}
{com}. 
. * store the coefficient and only keep individual effects
. matrix beta = e(b) 
{txt}
{com}. matrix beta = beta'
{txt}
{com}. matrix beta = beta[3..102,1]
{txt}
{com}. 
. * For part 2, regressing on time invarients, keeping one observation for each individual
. bysort personid: keep if _n == 1
{txt}(731 observations deleted)

{com}. svmat double beta, names(individual) // add individual effects in
{txt}
{com}. drop if individual == 0 // drop the reference group, as its individual effect is 0
{txt}(1 observation deleted)

{com}. 
. global xvar_timinv "ability mothered fathered brknhome siblings"
{txt}
{com}. reg individual $xvar_timinv, vce(robust)

{txt}Linear regression                               Number of obs     = {res}        99
                                                {txt}F(5, 93)          =  {res}     3.44
                                                {txt}Prob > F          = {res}    0.0067
                                                {txt}R-squared         = {res}    0.0796
                                                {txt}Root MSE          =    {res} .45281

{txt}{hline 13}{c TT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{col 14}{c |}{col 26}    Robust
{col 1} individual1{col 14}{c |}      Coef.{col 26}   Std. Err.{col 38}      t{col 46}   P>|t|{col 54}     [95% Con{col 67}f. Interval]
{hline 13}{c +}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{space 5}ability {c |}{col 14}{res}{space 2}-.0804296{col 26}{space 2} .0462974{col 37}{space 1}   -1.74{col 46}{space 3}0.086{col 54}{space 4}-.1723671{col 67}{space 3} .0115078
{txt}{space 4}mothered {c |}{col 14}{res}{space 2} .0128411{col 26}{space 2} .0196635{col 37}{space 1}    0.65{col 46}{space 3}0.515{col 54}{space 4}-.0262067{col 67}{space 3} .0518888
{txt}{space 4}fathered {c |}{col 14}{res}{space 2}  .013224{col 26}{space 2} .0181823{col 37}{space 1}    0.73{col 46}{space 3}0.469{col 54}{space 4}-.0228824{col 67}{space 3} .0493304
{txt}{space 4}brknhome {c |}{col 14}{res}{space 2} .1312838{col 26}{space 2} .1142444{col 37}{space 1}    1.15{col 46}{space 3}0.253{col 54}{space 4}-.0955829{col 67}{space 3} .3581505
{txt}{space 4}siblings {c |}{col 14}{res}{space 2} .0444889{col 26}{space 2} .0211131{col 37}{space 1}    2.11{col 46}{space 3}0.038{col 54}{space 4} .0025625{col 67}{space 3} .0864152
{txt}{space 7}_cons {c |}{col 14}{res}{space 2}-.5528412{col 26}{space 2}  .242963{col 37}{space 1}   -2.28{col 46}{space 3}0.025{col 54}{space 4}-1.035318{col 67}{space 3}-.0703648
{txt}{hline 13}{c BT}{hline 11}{hline 11}{hline 9}{hline 8}{hline 13}{hline 12}
{res}{txt}
{com}. est sto idfix_timinv
{txt}
{com}. 
. * HW2 summary
. est tab X_Y boot49 boot499, se title(OLS and bootstrape)
{res}
{txt}{p}OLS and bootstrape

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:X_Y} {space 1} {center 10:boot49} {space 1} {center 10:boot499} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 10}X1 {c |}{res} {ralign 10:.43835034}{txt} {space 1}{res} {ralign 10:.43835034}{txt} {space 1}{res} {ralign 10:.43835034}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.54743723}{txt} {space 1}{res} {ralign 10:.58697341}{txt} {space 1}{res} {ralign 10:.56666169}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-1.0103868}{txt} {space 1}{res} {ralign 10:-1.0103868}{txt} {space 1}{res} {ralign 10:-1.0103868}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.08909115}{txt} {space 1}{res} {ralign 10:.10057932}{txt} {space 1}{res} {ralign 10:.09150773}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.37314107}{txt} {space 1}{res} {ralign 10:.37314107}{txt} {space 1}{res} {ralign 10:.37314107}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.67303555}{txt} {space 1}{res} {ralign 10:.74072512}{txt} {space 1}{res} {ralign 10:.62863732}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:22.541928}{txt} {space 1}{res} {ralign 10:22.541928}{txt} {space 1}{res} {ralign 10:22.541928}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:1.2817391}{txt} {space 1}{res} {ralign 10:1.4386829}{txt} {space 1}{res} {ralign 10:1.3610506}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 53:legend: b/se}
{res}{txt}
{com}. est tab linear_ probit_ probit_m /*
> */ probit_mdelta logit_ logit_mdelta /*
> */ , se title(Linear, Probit, Logit)
{res}
{txt}{p}Linear, Probit, Logit

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:linear_} {space 1} {center 10:probit_} {space 1} {center 10:probit_m} {space 1} {center 10:probit_m~a} {space 1} {center 10:logit_} {space 1} {center 10:logit_md~a} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}_            {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:.01874188}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.02669155}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:-.03834067}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00434384}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:.04659131}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.03281539}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.67081067}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.06249412}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}Y_dum        {txt}{c |}{res}
{txt}{space 10}X1 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04497207}{txt} {space 1}{res} {ralign 10:.04497207}{txt} {space 1}{res} {ralign 10:.04497207}{txt} {space 1}{res} {ralign 10:.07525617}{txt} {space 1}{res} {ralign 10:.07525617}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.07120618}{txt} {space 1}{res} {ralign 10:.07120618}{txt} {space 1}{res} {ralign 10:.07120618}{txt} {space 1}{res} {ralign 10:.11528701}{txt} {space 1}{res} {ralign 10:.11528701}{txt} {space 1}
{res}{txt}{space 10}X2 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.10744515}{txt} {space 1}{res} {ralign 10:-.10744515}{txt} {space 1}{res} {ralign 10:-.10744515}{txt} {space 1}{res} {ralign 10:-.17363591}{txt} {space 1}{res} {ralign 10:-.17363591}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01280879}{txt} {space 1}{res} {ralign 10:.01280879}{txt} {space 1}{res} {ralign 10:.01280879}{txt} {space 1}{res} {ralign 10:.02137843}{txt} {space 1}{res} {ralign 10:.02137843}{txt} {space 1}
{res}{txt}{space 10}X3 {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.12439279}{txt} {space 1}{res} {ralign 10:.12439279}{txt} {space 1}{res} {ralign 10:.12439279}{txt} {space 1}{res} {ralign 10:.20079145}{txt} {space 1}{res} {ralign 10:.20079145}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.08770008}{txt} {space 1}{res} {ralign 10:.08770008}{txt} {space 1}{res} {ralign 10:.08770008}{txt} {space 1}{res} {ralign 10:.14189878}{txt} {space 1}{res} {ralign 10:.14189878}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.48680797}{txt} {space 1}{res} {ralign 10:.48680797}{txt} {space 1}{res} {ralign 10:.48680797}{txt} {space 1}{res} {ralign 10:.77878889}{txt} {space 1}{res} {ralign 10:.77878889}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.1690792}{txt} {space 1}{res} {ralign 10:.1690792}{txt} {space 1}{res} {ralign 10:.1690792}{txt} {space 1}{res} {ralign 10:.27359913}{txt} {space 1}{res} {ralign 10:.27359913}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 92:legend: b/se}
{res}{txt}
{com}. 
. * HW3 summary
. est tab c_logit m_logit mix_logit, se title(Conditional Logit)
{res}
{txt}{p}Conditional Logit

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:c_logit} {space 1} {center 10:m_logit} {space 1} {center 10:mix_logit} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}alt          {txt}{c |}{res}
{txt}{space 7}Price {c |}{res} {ralign 10:-6.6565793}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-6.6596692}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17427926}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.17476978}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}2            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00308874}{txt} {space 1}{res} {ralign 10:-.00425993}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00311397}{txt} {space 1}{res} {ralign 10:.00343921}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.95430683}{txt} {space 1}{res} {ralign 10:-.84532415}{txt} {space 1}{res} {ralign 10:-.84067337}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.05004624}{txt} {space 1}{res} {ralign 10:.09313545}{txt} {space 1}{res} {ralign 10:.10384458}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}3            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01458623}{txt} {space 1}{res} {ralign 10:.01434397}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00382546}{txt} {space 1}{res} {ralign 10:.00392209}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.2969683}{txt} {space 1}{res} {ralign 10:-2.3998576}{txt} {space 1}{res} {ralign 10:.88860693}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10865147}{txt} {space 1}{res} {ralign 10:.13358016}{txt} {space 1}{res} {ralign 10:.15945855}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}4            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00405043}{txt} {space 1}{res} {ralign 10:.00409985}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00309258}{txt} {space 1}{res} {ralign 10:.00320421}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.7173324}{txt} {space 1}{res} {ralign 10:-1.2013265}{txt} {space 1}{res} {ralign 10:-1.8284916}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.05415816}{txt} {space 1}{res} {ralign 10:.0971021}{txt} {space 1}{res} {ralign 10:.10321797}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}5            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00125359}{txt} {space 1}{res} {ralign 10:-.00118286}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00420238}{txt} {space 1}{res} {ralign 10:.00429708}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-2.9040048}{txt} {space 1}{res} {ralign 10:-1.6905817}{txt} {space 1}{res} {ralign 10:-2.8734104}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.07146052}{txt} {space 1}{res} {ralign 10:.12699518}{txt} {space 1}{res} {ralign 10:.13475726}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}6            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.03061202}{txt} {space 1}{res} {ralign 10:.02980895}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00467399}{txt} {space 1}{res} {ralign 10:.00472672}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-1.5153112}{txt} {space 1}{res} {ralign 10:-4.1397672}{txt} {space 1}{res} {ralign 10:-2.4571185}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12623034}{txt} {space 1}{res} {ralign 10:.21098899}{txt} {space 1}{res} {ralign 10:.21542599}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}7            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.00693258}{txt} {space 1}{res} {ralign 10:-.00924559}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0044161}{txt} {space 1}{res} {ralign 10:.00459348}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.25176838}{txt} {space 1}{res} {ralign 10:-1.5310415}{txt} {space 1}{res} {ralign 10:.49686917}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.07916402}{txt} {space 1}{res} {ralign 10:.12804344}{txt} {space 1}{res} {ralign 10:.14248236}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}8            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02288616}{txt} {space 1}{res} {ralign 10:.02199646}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00362167}{txt} {space 1}{res} {ralign 10:.00382029}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:1.4648684}{txt} {space 1}{res} {ralign 10:-2.8483523}{txt} {space 1}{res} {ralign 10:.80306}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1180467}{txt} {space 1}{res} {ralign 10:.13938482}{txt} {space 1}{res} {ralign 10:.17091994}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}9            {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01774297}{txt} {space 1}{res} {ralign 10:.01699109}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.0037623}{txt} {space 1}{res} {ralign 10:.0039155}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:2.3575051}{txt} {space 1}{res} {ralign 10:-2.5755973}{txt} {space 1}{res} {ralign 10:1.8641255}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13377396}{txt} {space 1}{res} {ralign 10:.13614002}{txt} {space 1}{res} {ralign 10:.1799469}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{res}10           {txt}{c |}{res}
{txt}{space 6}income {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01079092}{txt} {space 1}{res} {ralign 10:.00875958}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01013005}{txt} {space 1}{res} {ralign 10:.01030074}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-3.8965935}{txt} {space 1}{res} {ralign 10:-4.2822699}{txt} {space 1}{res} {ralign 10:-4.1423856}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17741899}{txt} {space 1}{res} {ralign 10:.34579197}{txt} {space 1}{res} {ralign 10:.35065634}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 53:legend: b/se}
{res}{txt}
{com}. 
. * HW4 Summary
. est tab re be fe fd, se title(Panel Methods)
{res}
{txt}{p}Panel Methods

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:re} {space 1} {center 10:be} {space 1} {center 10:fe} {space 1} {center 10:fd} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.10793802}{txt} {space 1}{res} {ralign 10:.09309987}{txt} {space 1}{res} {ralign 10:.12366202}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00338321}{txt} {space 1}{res} {ralign 10:.00466849}{txt} {space 1}{res} {ralign 10:.00576187}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.03876449}{txt} {space 1}{res} {ralign 10:.02599874}{txt} {space 1}{res} {ralign 10:.03856107}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00071784}{txt} {space 1}{res} {ralign 10:.00360489}{txt} {space 1}{res} {ralign 10:.00075848}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 6}educ_D {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04310838}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01517918}{txt} {space 1}
{res}{txt}{space 2}potexper_D {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.05353695}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.00292212}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:.56352057}{txt} {space 1}{res} {ralign 10:.84556882}{txt} {space 1}{res} {ralign 10:.40680158}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.0438846}{txt} {space 1}{res} {ralign 10:.07701791}{txt} {space 1}{res} {ralign 10:.0717348}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 66:legend: b/se}
{res}{txt}
{com}. est tab idfix idfix_timinv, se title(Individual Fixed effect w/ robust se)
{res}
{txt}{p}Individual Fixed effect w/ robust se

{hline 12}{c -}{c TT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 12:Variable} {c |} {center 10:idfix} {space 1} {center 10:idfix_ti~v} {space 1}
{hline 12}{c -}{c +}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{res}{txt}{space 8}educ {c |}{res} {ralign 10:.21221346}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.02754153}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 4}potexper {c |}{res} {ralign 10:.03111244}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.00366892}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 4}personid {c |}
{space 9}77  {c |}{res} {ralign 10:-.20085781}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19812544}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 9}94  {c |}{res} {ralign 10:-.06843357}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11442974}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}162  {c |}{res} {ralign 10:.33116019}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14051859}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}182  {c |}{res} {ralign 10:-1.0909903}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.2134577}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}200  {c |}{res} {ralign 10:.19288632}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14946674}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}210  {c |}{res} {ralign 10:-.24392402}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11606599}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}213  {c |}{res} {ralign 10:.6906579}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10148552}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}214  {c |}{res} {ralign 10:-1.6364336}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10000124}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}238  {c |}{res} {ralign 10:.69837705}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1256957}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}245  {c |}{res} {ralign 10:-.3011995}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12048052}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}248  {c |}{res} {ralign 10:.01155723}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15026096}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}253  {c |}{res} {ralign 10:.21245991}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.45461324}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}273  {c |}{res} {ralign 10:-.75897459}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10811752}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}300  {c |}{res} {ralign 10:-.11698828}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14133097}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}318  {c |}{res} {ralign 10:.29801085}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12622332}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}344  {c |}{res} {ralign 10:-.66309967}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13572614}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}387  {c |}{res} {ralign 10:.10868197}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10528396}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}391  {c |}{res} {ralign 10:-.40865044}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12637144}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}443  {c |}{res} {ralign 10:.25357038}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17495759}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}465  {c |}{res} {ralign 10:.98798793}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.41896492}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}480  {c |}{res} {ralign 10:.1531287}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13632202}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}502  {c |}{res} {ralign 10:.02078651}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11538973}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}533  {c |}{res} {ralign 10:.52372155}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1837773}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}585  {c |}{res} {ralign 10:-.10588033}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1386575}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}587  {c |}{res} {ralign 10:-.40531509}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1062149}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}608  {c |}{res} {ralign 10:-.57054438}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.31702483}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}614  {c |}{res} {ralign 10:-.23173119}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1726058}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}635  {c |}{res} {ralign 10:-.19405366}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21125721}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}650  {c |}{res} {ralign 10:-.68074906}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19545436}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}651  {c |}{res} {ralign 10:-.37461742}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.24064029}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}659  {c |}{res} {ralign 10:-.03532313}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12100717}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}673  {c |}{res} {ralign 10:-.38474263}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15560382}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}676  {c |}{res} {ralign 10:.16411785}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11251444}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}714  {c |}{res} {ralign 10:.06872022}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10592427}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}727  {c |}{res} {ralign 10:-.24033052}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21116671}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}729  {c |}{res} {ralign 10:-.89199237}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19929926}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}757  {c |}{res} {ralign 10:-.33921464}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.52352553}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}783  {c |}{res} {ralign 10:-.77865847}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.26068091}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}792  {c |}{res} {ralign 10:-.2135062}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19114382}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}800  {c |}{res} {ralign 10:-.13251475}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16207471}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}835  {c |}{res} {ralign 10:-.03977003}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10983043}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}877  {c |}{res} {ralign 10:.46373512}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20172325}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}880  {c |}{res} {ralign 10:.00827233}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.22529445}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}899  {c |}{res} {ralign 10:-.39788474}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17986627}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}900  {c |}{res} {ralign 10:-.14397272}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12958253}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}912  {c |}{res} {ralign 10:.13692366}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15808556}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}916  {c |}{res} {ralign 10:.19151269}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17198138}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 8}952  {c |}{res} {ralign 10:-.04976484}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.22368189}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1001  {c |}{res} {ralign 10:-.25892664}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15457559}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1006  {c |}{res} {ralign 10:-.33131521}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1861883}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1047  {c |}{res} {ralign 10:.31912265}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1259799}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1079  {c |}{res} {ralign 10:-.0430736}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.23182126}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1087  {c |}{res} {ralign 10:-.29224164}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15099959}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1110  {c |}{res} {ralign 10:.42444999}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10406167}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1143  {c |}{res} {ralign 10:.25910922}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10396686}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1162  {c |}{res} {ralign 10:-.61499986}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21089741}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1169  {c |}{res} {ralign 10:.08607244}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10695386}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1200  {c |}{res} {ralign 10:-.45336149}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14074103}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1263  {c |}{res} {ralign 10:-.25640443}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19793284}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1299  {c |}{res} {ralign 10:.03945519}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11823067}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1302  {c |}{res} {ralign 10:.23347265}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1686985}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1316  {c |}{res} {ralign 10:.27483309}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.1540291}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1323  {c |}{res} {ralign 10:.73774987}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11999105}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1327  {c |}{res} {ralign 10:-.08381666}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13310652}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1353  {c |}{res} {ralign 10:.31722725}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14349482}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1393  {c |}{res} {ralign 10:.84744003}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14678071}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1401  {c |}{res} {ralign 10:.490312}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11514985}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1434  {c |}{res} {ralign 10:.0791227}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12383667}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1441  {c |}{res} {ralign 10:.35469487}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16704607}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1442  {c |}{res} {ralign 10:.62546924}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14194351}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1480  {c |}{res} {ralign 10:-.07568814}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13972268}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1507  {c |}{res} {ralign 10:-.65654434}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19156248}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1510  {c |}{res} {ralign 10:-.04237101}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16264122}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1541  {c |}{res} {ralign 10:.32945158}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15099213}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1550  {c |}{res} {ralign 10:.10824518}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11705265}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1576  {c |}{res} {ralign 10:.62501749}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11422597}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1582  {c |}{res} {ralign 10:.11192808}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15125786}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1604  {c |}{res} {ralign 10:-.0672299}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11768887}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1617  {c |}{res} {ralign 10:.17120707}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15375881}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1649  {c |}{res} {ralign 10:-.09318454}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.10713997}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1676  {c |}{res} {ralign 10:-.53318831}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.16852763}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1677  {c |}{res} {ralign 10:-.61458129}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.46006223}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1683  {c |}{res} {ralign 10:-.64399705}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.24538839}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1699  {c |}{res} {ralign 10:-.49865643}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12524575}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1740  {c |}{res} {ralign 10:-.34597973}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.15564363}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1759  {c |}{res} {ralign 10:.15246117}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.12792359}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1808  {c |}{res} {ralign 10:-.1214276}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14233576}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1810  {c |}{res} {ralign 10:-.13420124}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18524422}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1844  {c |}{res} {ralign 10:.20464644}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.11985188}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1858  {c |}{res} {ralign 10:-1.5697104}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.23191896}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1870  {c |}{res} {ralign 10:.00648221}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.14114842}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1876  {c |}{res} {ralign 10:.00093728}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.13188327}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1915  {c |}{res} {ralign 10:-.8194205}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.17687808}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1950  {c |}{res} {ralign 10:-.15310155}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.21044517}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}1958  {c |}{res} {ralign 10:-.59935065}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.20143441}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2026  {c |}{res} {ralign 10:.45688492}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.23481637}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2088  {c |}{res} {ralign 10:.04676718}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.18578721}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2113  {c |}{res} {ralign 10:-.45865446}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.29196792}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 7}2126  {c |}{res} {ralign 10:.27910526}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.19617701}{txt} {space 1}{res} {ralign 10:}{txt} {space 1}
{res}{txt}{space 12} {c |}
{space 5}ability {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:-.08042965}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04629738}{txt} {space 1}
{res}{txt}{space 4}mothered {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01284107}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01966345}{txt} {space 1}
{res}{txt}{space 4}fathered {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01322399}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.01818227}{txt} {space 1}
{res}{txt}{space 4}brknhome {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.13128376}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.11424438}{txt} {space 1}
{res}{txt}{space 4}siblings {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.04448888}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:}{txt} {space 1}{res} {ralign 10:.02111306}{txt} {space 1}
{res}{txt}{space 7}_cons {c |}{res} {ralign 10:-.5690275}{txt} {space 1}{res} {ralign 10:-.55284123}{txt} {space 1}
{res}{txt}{space 12} {c |}{res} {ralign 10:.31318466}{txt} {space 1}{res} {ralign 10:.24296302}{txt} {space 1}
{res}{txt}{hline 12}{c -}{c BT}{c -}{hline 10}{c -}{c -}{c -}{hline 10}{c -}{c -}
{ralign 40:legend: b/se}
{res}{txt}
{com}. 
. 
{txt}end of do-file

{com}. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}C:\Users\jiere\Dropbox\Spring 2019\ECON 613\ECON613_HW\HW5_output\HW5.smcl
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}12 Apr 2019, 13:27:31
{txt}{.-}
{smcl}
{txt}{sf}{ul off}